#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnnualRefundTokenUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "AnnualRefundTokenUI_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class AnnualRefundTokenUI.FortPurchaseHistoryEntryBase
// 0x0040 (0x1580 - 0x1540)
#pragma pack(push, 0x1)
class alignas(0x10) UFortPurchaseHistoryEntryBase : public UFortHoldableButton
{
public:
	uint8                                         Pad_1430[0x8];                                     // 0x1538(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCosmeticItemCard>      ItemCardClass;                                     // 0x1540(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CardWidthOverride;                                 // 0x1548(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1431[0x4];                                     // 0x154C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_Name;                                         // 0x1550(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                         LootEntryItemTypesToExclude;                       // 0x1558(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	TArray<class FString>                         LootEntryItemTypesToCombine;                       // 0x1568(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)

public:
	void UpdateItemList(TArray<class UFortCosmeticItemCard*>& ItemCards);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryEntryBase">();
	}
	static class UFortPurchaseHistoryEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryEntryBase>();
	}
};
#pragma pack(pop)

// Class AnnualRefundTokenUI.FortPurchaseHistoryEntry
// 0x0000 (0x1580 - 0x1580)
class UFortPurchaseHistoryEntry final  : public UFortPurchaseHistoryEntryBase
{
public:
	void OnSetHistory(bool bHasBeenRefunded, bool bIsCancelPurchaseEligible, bool bIsTokenlessRefund, bool bPlayerHasTokens, bool bNonRefundable, bool IsPartOfABundle, bool IsNextRefundable, int32 IndexInBundle, int32 NumPurchasesInBundle);
	void SetPurchaseText(class FText& PurchaseDateText, class FText& RefundDateText, bool bHasBeenRefunded, EFortPurchaseHistoryRefundType RefundType);
	void SetupItemCard(class UFortCosmeticItemCard* ItemCard, class UFortItem* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryEntry">();
	}
	static class UFortPurchaseHistoryEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryEntry>();
	}
};

// Class AnnualRefundTokenUI.FortPurchaseHistoryBundleEntry
// 0x0000 (0x1580 - 0x1580)
class UFortPurchaseHistoryBundleEntry final  : public UFortPurchaseHistoryEntryBase
{
public:
	bool                                          bIsExpanded;                                       // 0x1578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1434[0x7];                                     // 0x1579(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetExpandButtonText(int32 NumPurchases);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryBundleEntry">();
	}
	static class UFortPurchaseHistoryBundleEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryBundleEntry>();
	}
};

// Class AnnualRefundTokenUI.FortPurchaseHistoryListView
// 0x0120 (0x03B0 - 0x0290)
class UFortPurchaseHistoryListView : public UListViewBase
{
public:
	uint8                                         Pad_1435[0x120];                                   // 0x0290(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryListView">();
	}
	static class UFortPurchaseHistoryListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryListView>();
	}
};

// Class AnnualRefundTokenUI.FortPurchaseHistoryTreeView
// 0x0038 (0x03E8 - 0x03B0)
class UFortPurchaseHistoryTreeView final  : public UFortPurchaseHistoryListView
{
public:
	uint8                                         Pad_1436[0x10];                                    // 0x03B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortPurchaseHistoryBundleEntry> HeaderEntryWidgetClass;                            // 0x03C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1437[0x20];                                    // 0x03C8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryTreeView">();
	}
	static class UFortPurchaseHistoryTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryTreeView>();
	}
};

// Class AnnualRefundTokenUI.FortAnnualRefundTicket
// 0x0008 (0x02D0 - 0x02C8)
class UFortAnnualRefundTicket final  : public UUserWidget
{
public:
	class UCommonTextBlock*                       Text_AvailableDate;                                // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPlayLockingAnimation();
	void OnUpdateAvailableState(bool bIsAvailable);
	void OnUpdatePendingState(bool bIsPending);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnnualRefundTicket">();
	}
	static class UFortAnnualRefundTicket* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnnualRefundTicket>();
	}
};

// Class AnnualRefundTokenUI.FortAnnualRefundTokenData
// 0x0020 (0x0560 - 0x0540)
class UFortAnnualRefundTokenData final  : public UFortGameFeatureData
{
public:
	TSoftClassPtr<class UClass>                   PurchaseHistoryScreenClass;                        // 0x0540(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAnnualRefundTokenData">();
	}
	static class UFortAnnualRefundTokenData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnnualRefundTokenData>();
	}
};

// Class AnnualRefundTokenUI.FortPurchaseHistoryScreen
// 0x0100 (0x0678 - 0x0578)
class UFortPurchaseHistoryScreen final  : public UFortActivatablePanel
{
public:
	struct FDataTableRowHandle                    BackAction;                                        // 0x0578(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1438[0x18];                                    // 0x0588(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   RefundConfirmationClass;                           // 0x05A0(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DirectPurchaseInfoModalClass;                      // 0x05C0(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonAnimatedSwitcher*                Switcher_MainContent;                              // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPurchaseHistoryTreeView*           TreeView_Purchases;                                // 0x05E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PostApproval;                               // 0x05F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_ReturnTypeInfo;                          // 0x0600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Desc;                                         // 0x0608(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RefundCount;                                  // 0x0610(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultHeader;                                 // 0x0618(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultTitle;                                  // 0x0620(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResultDesc;                                   // 0x0628(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Left;                                 // 0x0630(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Center;                               // 0x0638(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Right;                                // 0x0640(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_CancelPurchaseInfo;                         // 0x0648(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_ReturnTicketInfo;                           // 0x0650(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_TokenlessRefundInfo;                        // 0x0658(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_NonRefundableInfo;                          // 0x0660(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_BundledPurchaseInfo;                        // 0x0668(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Widget_BundledPurchaseTokenlessRefundInfo;         // 0x0670(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	bool BP_IsShowingPurchases();
	void OnBeginRefundSubmission();
	void OnEndRefundSubmission();
	void OnNoPurchasesAvailable();
	void OnPopulateView();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchaseHistoryScreen">();
	}
	static class UFortPurchaseHistoryScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchaseHistoryScreen>();
	}
};

// Class AnnualRefundTokenUI.FortRefundConfirmation
// 0x0058 (0x05D0 - 0x0578)
class UFortRefundConfirmation final  : public UFortActivatablePanel
{
public:
	uint8                                         Pad_1439[0x10];                                    // 0x0578(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_RefundsRemaining;                             // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RefundCount;                                  // 0x0590(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AreYouSure;                                   // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Yes;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_No;                                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x05B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Left;                                 // 0x05B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Center;                               // 0x05C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortAnnualRefundTicket*                RefundTicket_Right;                                // 0x05C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_UpdateItemsList(TArray<class UFortItemDefinition*>& SelectedItemDefs, int32 TotalMtxPaid);
	void BP_UpdateRefundType(EFortPurchaseHistoryRefundType RefundType, bool bBundledRefund);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRefundConfirmation">();
	}
	static class UFortRefundConfirmation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRefundConfirmation>();
	}
};

}

