#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_ParentBuildingContainerBlueprint

#include "Basic.hpp"

#include "DayPhaseFloats_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Prop_ParentBuildingContainerBlueprint.Athena_Prop_ParentBuildingContainerBlueprint_C
// 0x0110 (0x0CE0 - 0x0BD0)
class AAthena_Prop_ParentBuildingContainerBlueprint_C final  : public ABuildingProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          DebugWind;                                         // 0x0BD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8E6[0x7];                                     // 0x0BD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             IntenseWindMaterialsForPreview;                    // 0x0BE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UStaticMeshComponent*                   Wind_Intensity_Debug_Mesh;                         // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             OriginalMaterials;                                 // 0x0BF8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               Debug_TempMaterial;                                // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DebugWindYaw;                                      // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Debug_Wind_Intensity;                              // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Set_Max_Actor_Scale;                               // 0x0C20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8E7[0x7];                                     // 0x0C21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Max_Scale;                                         // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_TOD_Lights_and_Material_Emissive_Values;   // 0x0C30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_Static_Mesh_Shadow_Casting_When_Lights_Are_Active; // 0x0C31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_An_Alternate_Shadow_Mesh_When_The_Light_is_On_; // 0x0C32(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8E8[0x5];                                     // 0x0C33(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            AlternateShadowStaticMesh;                         // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate_Emissive_and_Lights_Over_Time;             // 0x0C40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8E9[0x7];                                     // 0x0C41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   CodeControlled_EmissiveColor;                      // 0x0C48(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                CodeControlled_LightConeOpacity;                   // 0x0C58(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDayPhaseFloats                        Light_Intensity_Over_Time_of_Day_;                 // 0x0C68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Day_Phase_Transition_Length;                       // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDayPhaseFloats                        Emissive_Intensity_Over_Time_of_Day;               // 0x0C80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Volumetric_Light_Scattering_Intensity;             // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cast_Volumetric_Shadows;                           // 0x0C98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate_Lights_With_A_Curve_Minus_Disables_time_of_day_light_controls; // 0x0C99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate_Mesh_MID_Emissive_Value_with_a_Curve_Minus_Disables_time_of_day_light_controls; // 0x0C9A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8EA[0x5];                                     // 0x0C9B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            LightAnimationCurve;                               // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CodeControlled_Animation_Curve_Animation_Length;   // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CodeControlled_NumberOfMaterials;                  // 0x0CB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8EB[0x4];                                     // 0x0CB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                NewVar_0;                                          // 0x0CB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Random_Time_Scale_Percent;                         // 0x0CC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CodeControlled_CurrentPlayLength;                  // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Snow_Coverage_Amount;                              // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Prop_ParentBuildingContainerBlueprint(int32 EntryPoint, EFortDayPhase Temp_byte_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, TScriptInterface<class IFortTimeOfDayManagerInterface> CallFunc_GetContextualTimeOfDayManager_ReturnValue, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 Temp_int_Variable, class UMaterialInstanceDynamic* CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Variable_1, class UMaterialInstanceDynamic* CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, EFortDayPhase Temp_byte_Variable_1, double Temp_real_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Array_Index_Variable_1, TScriptInterface<class IFortTimeOfDayManagerInterface> CallFunc_GetContextualTimeOfDayManager_ReturnValue_1, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue, EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue, int32 CallFunc_GetNumMaterials_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue, int32 Temp_int_Variable_2, class UMaterialInstanceDynamic* CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Array_Index_Variable_2, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue_2, int32 CallFunc_GetNumMaterials_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_5, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 Temp_int_Variable_3, EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue_1, class UMaterialInstanceDynamic* CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue_3, class UMaterial* CallFunc_GetBaseMaterial_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_6, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, EFortDayPhase Temp_byte_Variable_2, EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue_1, EFortDayPhase Temp_byte_Variable_3, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue_3, int32 CallFunc_GetNumMaterials_ReturnValue_2, EFortDayPhase Temp_byte_Variable_4, int32 CallFunc_Subtract_IntInt_ReturnValue_2, TScriptInterface<class IFortTimeOfDayManagerInterface> CallFunc_GetContextualTimeOfDayManager_ReturnValue_2, double Temp_real_Variable_1, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue_2, EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_2, TScriptInterface<class IFortTimeOfDayManagerInterface> CallFunc_GetContextualTimeOfDayManager_ReturnValue_3, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue_3, EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, double Temp_real_Variable_2, TScriptInterface<class IFortTimeOfDayManagerInterface> CallFunc_GetContextualTimeOfDayManager_ReturnValue_4, int32 Temp_int_Array_Index_Variable_3, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_4, EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue_3, EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue_3, double Temp_real_Variable_3, double Temp_real_Variable_4, double Temp_real_Variable_5, int32 Temp_int_Loop_Counter_Variable_3, EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue_4, int32 CallFunc_Add_IntInt_ReturnValue_7, double Temp_real_Variable_6, TScriptInterface<class IFortTimeOfDayManagerInterface> CallFunc_GetContextualTimeOfDayManager_ReturnValue_5, EFortDayPhase Temp_byte_Variable_5, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue_5, bool CallFunc_IsValid_ReturnValue_5, EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue_4, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue_4, int32 Temp_int_Variable_4, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue, class UMaterialInstanceDynamic* CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue_4, class UMaterialInstanceConstant* K2Node_DynamicCast_AsMaterial_Instance_Constant, bool K2Node_DynamicCast_bSuccess, float CallFunc_K2_GetScalarParameterValue_ReturnValue, const struct FLinearColor& CallFunc_K2_GetVectorParameterValue_ReturnValue, const struct FLinearColor& CallFunc_K2_GetVectorParameterValue_ReturnValue_1, bool CallFunc_NotEqual_DoubleDouble_ReturnValue, bool CallFunc_NotEqual_DoubleDouble_ReturnValue_1, bool CallFunc_NotEqual_DoubleDouble_ReturnValue_2, bool CallFunc_LessEqual_IntInt_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_8, int32 CallFunc_GetNumMaterials_ReturnValue_3, int32 CallFunc_Subtract_IntInt_ReturnValue_3, EFortDayPhase Temp_byte_Variable_6, bool CallFunc_LessEqual_IntInt_ReturnValue_2, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue_1, EFortDayPhase Temp_byte_Variable_7, bool CallFunc_IsDedicatedServer_ReturnValue_2, EFortDayPhase Temp_byte_Variable_8, double CallFunc_RandomFloatInRange_ReturnValue, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue_5, double CallFunc_RandomFloatInRange_ReturnValue_1, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue_6, EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue_5, int32 CallFunc_GetNumMaterials_ReturnValue_4, TScriptInterface<class IFortTimeOfDayManagerInterface> CallFunc_GetContextualTimeOfDayManager_ReturnValue_6, int32 CallFunc_Subtract_IntInt_ReturnValue_4, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue_6, bool CallFunc_LessEqual_IntInt_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_6, EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue_5, float CallFunc_GetScalarParameterValue_ReturnValue, EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue_6, EFortDayPhase Temp_byte_Variable_9, EFortDayPhase Temp_byte_Variable_10, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, int32 Temp_int_Loop_Counter_Variable_4, int32 CallFunc_Add_IntInt_ReturnValue_9, int32 Temp_int_Array_Index_Variable_4, int32 Temp_int_Variable_5, class UMaterialInstanceDynamic* CallFunc_GetOrCreateMIDOnDefaultMesh_ReturnValue_5, class UMaterial* CallFunc_GetBaseMaterial_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue_4, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_10, EFortDayPhase K2Node_Event_CurrentDayPhase, EFortDayPhase K2Node_Event_PreviousDayPhase, bool K2Node_Event_bAtCreation, double K2Node_Select_Default, double CallFunc_Array_Get_Item, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double K2Node_Select_Default_1, double K2Node_Select_Default_2, double K2Node_Select_Default_3, double K2Node_Select_Default_4, double CallFunc_Lerp_ReturnValue, const struct FLinearColor& CallFunc_Array_Get_Item_1, double CallFunc_Array_Get_Item_2, const struct FLinearColor& CallFunc_Multiply_LinearColorFloat_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, double CallFunc_Multiply_DoubleDouble_ReturnValue_3, const struct FLinearColor& CallFunc_Multiply_LinearColorFloat_ReturnValue_1, double CallFunc_Array_Get_Item_3, int32 CallFunc_Array_Add_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_4, const struct FLinearColor& CallFunc_Array_Get_Item_4, const struct FLinearColor& CallFunc_Multiply_LinearColorFloat_ReturnValue_2, int32 CallFunc_Array_Add_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, double K2Node_Select_Default_5, double K2Node_Select_Default_6, double CallFunc_Lerp_ReturnValue_1, double K2Node_Select_Default_7, double K2Node_Select_Default_8, double CallFunc_Lerp_ReturnValue_2, double K2Node_Select_Default_9, double K2Node_Select_Default_10, double CallFunc_Lerp_ReturnValue_3, const struct FLinearColor& CallFunc_Array_Get_Item_5, const struct FLinearColor& CallFunc_Multiply_LinearColorFloat_ReturnValue_3, const struct FLinearColor& CallFunc_Multiply_LinearColorFloat_ReturnValue_4, EFortDayPhase Temp_byte_Variable_11, double K2Node_Select_Default_11, double CallFunc_Lerp_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_7, int32 CallFunc_Subtract_IntInt_ReturnValue_5, bool CallFunc_LessEqual_IntInt_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue, EFortDayPhase Temp_byte_Variable_12, double K2Node_Select_Default_12, struct FFortBounceData& K2Node_Event_Data, double CallFunc_Multiply_DoubleDouble_ReturnValue_5, bool CallFunc_EqualEqual_ByteByte_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, float CallFunc_BreakColor_R, float CallFunc_BreakColor_G, float CallFunc_BreakColor_B, float CallFunc_BreakColor_A, double CallFunc_Multiply_DoubleDouble_ReturnValue_6, const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_BreakColor_R_1, float CallFunc_BreakColor_G_1, float CallFunc_BreakColor_B_1, float CallFunc_BreakColor_A_1, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, const struct FTimeOfDayControlledLightData& CallFunc_Array_Get_Item_6, const struct FTimeOfDayControlledLightData& CallFunc_Array_Get_Item_7, bool CallFunc_IsValid_ReturnValue_8, bool CallFunc_IsValid_ReturnValue_9, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, const struct FTimeOfDayControlledLightData& CallFunc_Array_Get_Item_8, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_2, const struct FTimeOfDayControlledLightData& CallFunc_Array_Get_Item_9, const struct FTimeOfDayControlledLightData& CallFunc_Array_Get_Item_10, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, bool CallFunc_IsValid_ReturnValue_10, double CallFunc_VSize_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_4, double CallFunc_FClamp_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_3, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_SelectFloat_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_5, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_4, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_2, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult, float CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast, float CallFunc_Multiply_LinearColorFloat_B_ImplicitCast, float CallFunc_Multiply_LinearColorFloat_B_ImplicitCast_1, float CallFunc_Multiply_LinearColorFloat_B_ImplicitCast_2, float CallFunc_Multiply_LinearColorFloat_B_ImplicitCast_3, float CallFunc_AddLightAnimationIntensity_StartValue_ImplicitCast, float CallFunc_AddLightAnimationIntensity_EndValue_ImplicitCast, float CallFunc_Multiply_LinearColorFloat_B_ImplicitCast_4, double CallFunc_Array_Add_NewItem_ImplicitCast, double CallFunc_NotEqual_DoubleDouble_A_ImplicitCast, double CallFunc_NotEqual_DoubleDouble_A_ImplicitCast_1, double CallFunc_NotEqual_DoubleDouble_A_ImplicitCast_2, float CallFunc_Delay_Duration_ImplicitCast, double CallFunc_Multiply_VectorFloat_B_ImplicitCast, float CallFunc_AddLightAnimationIntensity_Duration_ImplicitCast, double K2Node_Select_Morning_ImplicitCast, double K2Node_Select_Morning_ImplicitCast_1, double K2Node_Select_Day_ImplicitCast, double K2Node_Select_Day_ImplicitCast_1, double K2Node_Select_Evening_ImplicitCast, double K2Node_Select_Evening_ImplicitCast_1, double K2Node_Select_Night_ImplicitCast, double K2Node_Select_Night_ImplicitCast_1, float CallFunc_AddMIDAnimationFloat_EndValue_ImplicitCast, float CallFunc_AddMIDAnimationFloat_StartValue_ImplicitCast, double K2Node_Select_Morning_ImplicitCast_2, double K2Node_Select_Morning_ImplicitCast_3, double K2Node_Select_Day_ImplicitCast_2, double K2Node_Select_Day_ImplicitCast_3, double K2Node_Select_Evening_ImplicitCast_2, double K2Node_Select_Evening_ImplicitCast_3, double K2Node_Select_Night_ImplicitCast_2, double K2Node_Select_Night_ImplicitCast_3, double K2Node_Select_Morning_ImplicitCast_4, double K2Node_Select_Morning_ImplicitCast_5, double K2Node_Select_Day_ImplicitCast_4, double K2Node_Select_Day_ImplicitCast_5, double K2Node_Select_Evening_ImplicitCast_4, double K2Node_Select_Evening_ImplicitCast_5, double K2Node_Select_Night_ImplicitCast_4, double K2Node_Select_Night_ImplicitCast_5, float CallFunc_AddMIDAnimationFloat_Duration_ImplicitCast, float CallFunc_AddMIDAnimationColor_Duration_ImplicitCast, float CallFunc_AddMIDAnimationFloat_EndValue_ImplicitCast_1, float CallFunc_AddMIDAnimationFloat_StartValue_ImplicitCast_1, float CallFunc_SetScalarParameterValue_Value_ImplicitCast, double K2Node_Select_Morning_ImplicitCast_6, double K2Node_Select_Day_ImplicitCast_6, double K2Node_Select_Evening_ImplicitCast_6, double K2Node_Select_Night_ImplicitCast_6, float CallFunc_AddMIDAnimationFloat_Duration_ImplicitCast_1, float CallFunc_AddMIDAnimationColor_Duration_ImplicitCast_1, double K2Node_Select_Morning_ImplicitCast_7, double K2Node_Select_Morning_ImplicitCast_8, double K2Node_Select_Day_ImplicitCast_7, double K2Node_Select_Day_ImplicitCast_8, double K2Node_Select_Evening_ImplicitCast_7, double K2Node_Select_Evening_ImplicitCast_8, double K2Node_Select_Night_ImplicitCast_7, double K2Node_Select_Night_ImplicitCast_8, double K2Node_Select_Morning_ImplicitCast_9, double K2Node_Select_Morning_ImplicitCast_10, double K2Node_Select_Day_ImplicitCast_9, double K2Node_Select_Day_ImplicitCast_10, double K2Node_Select_Evening_ImplicitCast_9, double K2Node_Select_Evening_ImplicitCast_10, double K2Node_Select_Night_ImplicitCast_9, double K2Node_Select_Night_ImplicitCast_10, double K2Node_Select_Morning_ImplicitCast_11, double K2Node_Select_Morning_ImplicitCast_12, double K2Node_Select_Day_ImplicitCast_11, double K2Node_Select_Day_ImplicitCast_12, double K2Node_Select_Evening_ImplicitCast_11, double K2Node_Select_Evening_ImplicitCast_12, double K2Node_Select_Night_ImplicitCast_11, double K2Node_Select_Night_ImplicitCast_12, float CallFunc_SetIntensity_NewIntensity_ImplicitCast, double CallFunc_Multiply_VectorFloat_B_ImplicitCast_1, double CallFunc_Divide_DoubleDouble_B_ImplicitCast, double CallFunc_MakeVector_X_ImplicitCast, double CallFunc_MakeVector_Y_ImplicitCast, double CallFunc_MakeVector_Z_ImplicitCast, double CallFunc_MakeVector_X_ImplicitCast_1, double CallFunc_MakeVector_Y_ImplicitCast_1, double CallFunc_MakeVector_Z_ImplicitCast_1, float CallFunc_AddMIDAnimationFloat_Duration_ImplicitCast_2, float CallFunc_AddLightAnimationIntensity_Duration_ImplicitCast_1, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast);
	void GetTimeOfDayBlueprintDefaultVariables(struct FTimeOfDayBlueprintDefaultVariables* OutVariables, const struct FTimeOfDayBlueprintDefaultVariables& K2Node_MakeStruct_TimeOfDayBlueprintDefaultVariables, float K2Node_MakeStruct_VolumetricLightScatteringIntensity_ImplicitCast);
	void Loop_Animation_Curve();
	void OnBounceAnimationUpdate(struct FFortBounceData& Data);
	void OnDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void OnSetSearched();
	void ReceiveBeginPlay();
	void UserConstructionScript(class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue, class UCurveLinearColor* CallFunc_GetWindSpeedCurveForPreview_ReturnValue, class UCurveLinearColor* CallFunc_GetWindPannerSpeedCurveForPreview_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FLinearColor& CallFunc_GetLinearColorValue_ReturnValue, float CallFunc_BreakColor_R, float CallFunc_BreakColor_G, float CallFunc_BreakColor_B, float CallFunc_BreakColor_A, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_RotateAngleAxis_ReturnValue, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, const struct FLinearColor& CallFunc_GetLinearColorValue_ReturnValue_1, const struct FLinearColor& CallFunc_MakeColor_ReturnValue, float CallFunc_BreakColor_R_1, float CallFunc_BreakColor_G_1, float CallFunc_BreakColor_B_1, float CallFunc_BreakColor_A_1, TArray<class UMaterialInterface*>& CallFunc_GetIntenseWindMaterialsForPreview_Materials, bool CallFunc_GetIntenseWindMaterialsForPreview_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, class UStaticMeshComponent* CallFunc_GetBuildingMeshComponent_ReturnValue_1, class UCurveLinearColor* CallFunc_GetWindSpeedCurveForPreview_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UCurveLinearColor* CallFunc_GetWindPannerSpeedCurveForPreview_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, TArray<class UMaterialInterface*>& CallFunc_GetMaterials_ReturnValue, bool CallFunc_SetStaticMesh_ReturnValue, struct FTransform& Temp_struct_Variable, int32 Temp_int_Array_Index_Variable, class UMaterialInterface* CallFunc_Array_Get_Item, class UStaticMeshComponent* CallFunc_AddComponent_ReturnValue, class UMaterialInstance* K2Node_DynamicCast_AsMaterial_Instance, bool K2Node_DynamicCast_bSuccess, const struct FVector& CallFunc_GetActorScale3D_ReturnValue, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, double CallFunc_FMax_ReturnValue, double CallFunc_FMax_ReturnValue_1, const struct FVector& CallFunc_Divide_VectorFloat_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue, float CallFunc_GetTimeRange_MinTime, float CallFunc_GetTimeRange_MaxTime, double K2Node_VariableGet_CodeControlled_Animation_Curve_Animation_Length_ImplicitCast, class UMaterialInterface* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_2, class UMaterialInstance* K2Node_DynamicCast_AsMaterial_Instance_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_Less_IntInt_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, float CallFunc_GetLinearColorValue_InTime_ImplicitCast, float CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast, float CallFunc_K2_InterpolateMaterialInstanceParams_Alpha_ImplicitCast, float CallFunc_GetLinearColorValue_InTime_ImplicitCast_1, float CallFunc_MakeColor_R_ImplicitCast, float CallFunc_MakeColor_G_ImplicitCast, float CallFunc_MakeColor_B_ImplicitCast, float CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast, double K2Node_VariableSetRef_Value_ImplicitCast);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Prop_ParentBuildingContainerBlueprint_C">();
	}
	static class AAthena_Prop_ParentBuildingContainerBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Prop_ParentBuildingContainerBlueprint_C>();
	}
};

}

