#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtomRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AtomRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.AddPartInstance
// 0x0120 (0x0120 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_AddPartInstance final 
{
public:
	struct FAtomModelPartsCollection              PartCollection;                                    // 0x0000(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FAtomModelPartInstanceInfo             PartInstance;                                      // 0x0080(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.Conv_ModelPartGuidToString
// 0x0028 (0x0028 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_Conv_ModelPartGuidToString final 
{
public:
	struct FAtomModelPartGuid                     InModelPartGuid;                                   // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BD8[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.Conv_StringToModelPartGuid
// 0x0028 (0x0028 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_Conv_StringToModelPartGuid final 
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartGuid                     ReturnValue;                                       // 0x0010(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BD9[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.CreateColorInfoFromColorId
// 0x0010 (0x0010 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_CreateColorInfoFromColorId final 
{
public:
	int32                                         ColorId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartColorInfo                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.FilterGroup
// 0x0130 (0x0130 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_FilterGroup final 
{
public:
	class UAtomModel*                             Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BDA[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomModelPartsCollection              PartsCollectionToFilter;                           // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 GroupName;                                         // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewPartsCollectionName;                            // 0x00A0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              ReturnValue;                                       // 0x00B0(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.FilterNonTransparent
// 0x0110 (0x0110 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_FilterNonTransparent final 
{
public:
	struct FAtomModelPartsCollection              PartsCollectionToFilter;                           // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 NewPartsCollectionName;                            // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              ReturnValue;                                       // 0x0090(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.FilterSelectionSet
// 0x0120 (0x0120 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_FilterSelectionSet final 
{
public:
	struct FAtomModelPartsCollection              PartsCollectionToFilter;                           // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 SelectionSetName;                                  // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewPartsCollectionName;                            // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              ReturnValue;                                       // 0x00A0(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.FilterTransparent
// 0x0110 (0x0110 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_FilterTransparent final 
{
public:
	struct FAtomModelPartsCollection              PartsCollectionToFilter;                           // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 NewPartsCollectionName;                            // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              ReturnValue;                                       // 0x0090(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.GetModelPartGuidHash
// 0x0018 (0x0018 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_GetModelPartGuidHash final 
{
public:
	struct FAtomModelPartGuid                     InModelPartGuid;                                   // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.GetName
// 0x0090 (0x0090 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_GetName final 
{
public:
	struct FAtomModelPartsCollection              PartsCollection;                                   // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0080(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.GetParts
// 0x0090 (0x0090 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_GetParts final 
{
public:
	struct FAtomModelPartsCollection              PartsCollection;                                   // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelPartInstanceInfo>     ReturnValue;                                       // 0x0080(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.GetPrimitiveCommonParts
// 0x0020 (0x0020 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_GetPrimitiveCommonParts final 
{
public:
	class UAtomPrimitive*                         Primitive;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Scale;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAtomCommonPartAndTransform>    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.InitializeCommonParts
// 0x0110 (0x0110 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_InitializeCommonParts final 
{
public:
	struct FAtomModelPartsCollection              PartsCollection;                                   // 0x0000(0x0080)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAtomModel*                             Model;                                             // 0x0080(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0088(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveConnectedParts;                             // 0x008C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveAllKnobs;                                   // 0x008D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveAllTubes;                                   // 0x008E(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveAllPins;                                    // 0x008F(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomModelPartsCollection              ReturnValue;                                       // 0x0090(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.RemovePartInstance
// 0x00A0 (0x00A0 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_RemovePartInstance final 
{
public:
	struct FAtomModelPartsCollection              PartCollection;                                    // 0x0000(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FAtomModelPartGuid                     PartInstanceId;                                    // 0x0080(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BDB[0xC];                                     // 0x0094(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.ReplacePartInstance
// 0x0140 (0x0140 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_ReplacePartInstance final 
{
public:
	struct FAtomModelPartsCollection              PartCollection;                                    // 0x0000(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FAtomModelPartInstanceInfo             SourcePartInstance;                                // 0x0080(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAtomModelPartGuid                     TargetPartInstanceId;                              // 0x0120(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BDC[0xC];                                     // 0x0134(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.AtomPartsCollectionBlueprintLibrary.SetName
// 0x0090 (0x0090 - 0x0000)
struct AtomPartsCollectionBlueprintLibrary_SetName final 
{
public:
	struct FAtomModelPartsCollection              PartsCollection;                                   // 0x0000(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveBlueprintLibrary.GetDefaultPrimitiveScale
// 0x0004 (0x0004 - 0x0000)
struct AtomPrimitiveBlueprintLibrary_GetDefaultPrimitiveScale final 
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.CreateAtomGeometryFromCommonPart
// 0x0030 (0x0030 - 0x0000)
struct AtomPrimitiveGeometry_CreateAtomGeometryFromCommonPart final 
{
public:
	class FString                                 ExportStyleName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomCommonPartType                           CommonPartType;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BDE[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LODIndex;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CommonPartsMeshPath;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.CreateEmptyAtomGeometry
// 0x0008 (0x0008 - 0x0000)
struct AtomPrimitiveGeometry_CreateEmptyAtomGeometry final 
{
public:
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.GetNumberOfCommonPartLODs
// 0x0030 (0x0030 - 0x0000)
struct AtomPrimitiveGeometry_GetNumberOfCommonPartLODs final 
{
public:
	class FString                                 ExportStyleName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomCommonPartType                           CommonPartType;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BDF[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CommonPartsMeshPath;                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BE0[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.AtomPrimitiveGeometry.Append
// 0x0050 (0x0050 - 0x0000)
struct AtomPrimitiveGeometry_Append final 
{
public:
	class UAtomPrimitiveGeometry*                 GeometryToAppend;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BE1[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform3f                           Transform;                                         // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BE2[0x8];                                     // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.AtomPrimitiveGeometry.AppendAndWeld
// 0x0050 (0x0050 - 0x0000)
struct AtomPrimitiveGeometry_AppendAndWeld final 
{
public:
	class UAtomPrimitiveGeometry*                 GeometryToAppend;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BE3[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform3f                           Transform;                                         // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BE4[0x8];                                     // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.AtomPrimitiveGeometry.AttachVerticesToBoneIndex
// 0x0004 (0x0004 - 0x0000)
struct AtomPrimitiveGeometry_AttachVerticesToBoneIndex final 
{
public:
	int32                                         BoneIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.AttachVerticesToNamedBone
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometry_AttachVerticesToNamedBone final 
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.BakeScale
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometry_BakeScale final 
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BE5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.BakeTransform
// 0x0040 (0x0040 - 0x0000)
struct AtomPrimitiveGeometry_BakeTransform final 
{
public:
	struct FTransform3f                           Transform;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BE6[0x8];                                     // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.AtomPrimitiveGeometry.BakeTransforms
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveGeometry_BakeTransforms final 
{
public:
	TArray<struct FTransform3f>                   Transforms;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.SetMaterialName
// 0x0020 (0x0020 - 0x0000)
struct AtomPrimitiveGeometry_SetMaterialName final 
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PolygonGroupIndex;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BE7[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.SetTiledUVs
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometry_SetTiledUVs final 
{
public:
	float                                         TileSize;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BE8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.SetVertexColor
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometry_SetVertexColor final 
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BE9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.DuplicateGeometry
// 0x0008 (0x0008 - 0x0000)
struct AtomPrimitiveGeometry_DuplicateGeometry final 
{
public:
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.GetBoneIndexForName
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveGeometry_GetBoneIndexForName final 
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BEA[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.AtomPrimitiveGeometry.GetMaterialNames
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometry_GetMaterialNames final 
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.SplitByPolygonGroup
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometry_SplitByPolygonGroup final 
{
public:
	TArray<class UAtomPrimitiveGeometry*>         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometry.ToSimplifiedStaticMesh
// 0x0030 (0x0030 - 0x0000)
struct AtomPrimitiveGeometry_ToSimplifiedStaticMesh final 
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BEB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Param_Outer;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFastBuild;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BEC[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetCapsGeometry
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetCapsGeometry final 
{
public:
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetCollisionGeometry
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetCollisionGeometry final 
{
public:
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetDetailsGeometry
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetDetailsGeometry final 
{
public:
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetGeometry
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetGeometry final 
{
public:
	EPrimitiveGeometryComplexity                  PrimitiveGeometryComplexity;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BEF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetGeometryWithMaterialNames
// 0x0030 (0x0030 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetGeometryWithMaterialNames final 
{
public:
	EPrimitiveGeometryComplexity                  PrimitiveGeometryComplexity;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BF0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ShellMaterial;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UndersideMaterial;                                 // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetPartsGeometry
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetPartsGeometry final 
{
public:
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetScaledCapsGeometry
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetScaledCapsGeometry final 
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BF1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetScaledCollisionGeometry
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetScaledCollisionGeometry final 
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BF2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetScaledDetailsGeometry
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetScaledDetailsGeometry final 
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BF3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomPrimitiveGeometryAndTransform> ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetScaledGeometry
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetScaledGeometry final 
{
public:
	EPrimitiveGeometryComplexity                  PrimitiveGeometryComplexity;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BF4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomPrimitiveGeometry*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetScaledShellGeometry
// 0x0050 (0x0050 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetScaledShellGeometry final 
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BF5[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomPrimitiveGeometryAndTransform     ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetShellGeometry
// 0x0040 (0x0040 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetShellGeometry final 
{
public:
	struct FAtomPrimitiveGeometryAndTransform     ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.MakePrimitiveCollisionGeometry
// 0x0088 (0x0088 - 0x0000)
struct AtomPrimitiveGeometryContainer_MakePrimitiveCollisionGeometry final 
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BF6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomPrimitiveCollisionGeometry        ReturnValue;                                       // 0x0008(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetDefaultBoneTransforms
// 0x0018 (0x0018 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetDefaultBoneTransforms final 
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BF7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetExportStyleName
// 0x0010 (0x0010 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetExportStyleName final 
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.GetLOD
// 0x0004 (0x0004 - 0x0000)
struct AtomPrimitiveGeometryContainer_GetLOD final 
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomPrimitiveGeometryContainer.HasCollisionGeometry
// 0x0001 (0x0001 - 0x0000)
struct AtomPrimitiveGeometryContainer_HasCollisionGeometry final 
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetAllColorInfo
// 0x0050 (0x0050 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetAllColorInfo final 
{
public:
	TMap<int32, struct FAtomColorInfo>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetBitPackForColor
// 0x0008 (0x0008 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetBitPackForColor final 
{
public:
	struct FColor                                 Color;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetBitPackForColorId
// 0x0008 (0x0008 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetBitPackForColorId final 
{
public:
	int32                                         AtomColorId;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetCommonPartAssetDescriptionFromStaticMesh
// 0x0018 (0x0018 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetCommonPartAssetDescriptionFromStaticMesh final 
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomCommonPartAssetDescription        OutDescription;                                    // 0x0008(0x000C)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	EGetCommonPartDescriptionResult               OutIsValid;                                        // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BF8[0x3];                                     // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetCommonPartCategoryFromType
// 0x0002 (0x0002 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetCommonPartCategoryFromType final 
{
public:
	EAtomCommonPartType                           CommonPartType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomCommonPartCategory                       ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetCommonPartDescriptionFromType
// 0x0014 (0x0014 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetCommonPartDescriptionFromType final 
{
public:
	EAtomCommonPartType                           CommonPartType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BF9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomCommonPartDescription             OutDescription;                                    // 0x0004(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeBlueprintLibrary.GetInfoForColorId
// 0x0030 (0x0030 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetInfoForColorId final 
{
public:
	int32                                         ColorId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BFA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomColorInfo                         ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.AtomRuntimeSettings.GetColorDataTable
// 0x0008 (0x0008 - 0x0000)
struct AtomRuntimeSettings_GetColorDataTable final 
{
public:
	class UDataTable*                             ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.DisconnectAllObjectConnections
// 0x0004 (0x0004 - 0x0000)
struct WorldConnectivitySubsystem_DisconnectAllObjectConnections final 
{
public:
	struct FWorldConnectivityHandle               Object;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.DisconnectObjects
// 0x0008 (0x0008 - 0x0000)
struct WorldConnectivitySubsystem_DisconnectObjects final 
{
public:
	struct FWorldConnectivityHandle               ObjectA;                                           // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FWorldConnectivityHandle               ObjectB;                                           // 0x0004(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetClosestFieldToPoint
// 0x00C0 (0x00C0 - 0x0000)
struct WorldConnectivitySubsystem_GetClosestFieldToPoint final 
{
public:
	struct FWorldConnectivityHandle               Handle;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BFE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WorldLocation;                                     // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConnectionFieldGender                        Type;                                              // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9BFF[0xE];                                     // 0x0022(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlanarFieldInfo                       ReturnValue;                                       // 0x0030(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetConnectedObjects
// 0x0018 (0x0018 - 0x0000)
struct WorldConnectivitySubsystem_GetConnectedObjects final 
{
public:
	struct FWorldConnectivityHandle               Object;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C00[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWorldConnectivityHandle>       ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetConnectedObjectsRecursively
// 0x0018 (0x0018 - 0x0000)
struct WorldConnectivitySubsystem_GetConnectedObjectsRecursively final 
{
public:
	struct FWorldConnectivityHandle               Object;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C01[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWorldConnectivityHandle>       ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetOverlapPenetrationDepth
// 0x0040 (0x0040 - 0x0000)
struct WorldConnectivitySubsystem_GetOverlapPenetrationDepth final 
{
public:
	class AStaticMeshActor*                       Actor1;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AStaticMeshActor*                       Actor2;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetPlanarFieldCenter
// 0x00B0 (0x00B0 - 0x0000)
struct WorldConnectivitySubsystem_GetPlanarFieldCenter final 
{
public:
	struct FPlanarFieldInfo                       Field;                                             // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0090(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C02[0x8];                                     // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetPlanarFields
// 0x0018 (0x0018 - 0x0000)
struct WorldConnectivitySubsystem_GetPlanarFields final 
{
public:
	struct FWorldConnectivityHandle               Handle;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EConnectionFieldGender                        Type;                                              // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C03[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlanarFieldInfo>               ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.RegisterAtomActor
// 0x0010 (0x0010 - 0x0000)
struct WorldConnectivitySubsystem_RegisterAtomActor final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C04[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.WorldConnectivitySubsystem.RegisterConnectivityActor
// 0x0018 (0x0018 - 0x0000)
struct WorldConnectivitySubsystem_RegisterConnectivityActor final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomModel*                             Model;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C05[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.WorldConnectivitySubsystem.RegisterCustomConnectivityActor
// 0x0028 (0x0028 - 0x0000)
struct WorldConnectivitySubsystem_RegisterCustomConnectivityActor final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSerializedConnectivityObjects         ConnectivityObject;                                // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.RegisterModelActor
// 0x0028 (0x0028 - 0x0000)
struct WorldConnectivitySubsystem_RegisterModelActor final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSerializedConnectivityObjects         Connections;                                       // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.RunPlanarConnectivityQuery
// 0x0060 (0x0060 - 0x0000)
struct WorldConnectivitySubsystem_RunPlanarConnectivityQuery final 
{
public:
	class AActor*                                 AtomActorToPlace;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 AtomActorToConnect;                                // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                QueryStartLocation;                                // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                QueryEndLocation;                                  // 0x0028(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             QueryCollisionChannel;                             // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C06[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QueryRadius;                                       // 0x0044(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveConnectionOnSuccess;                          // 0x0048(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C07[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConnectivityQueryResult>       ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.TryConnectObjectAtLocation
// 0x0090 (0x0090 - 0x0000)
struct WorldConnectivitySubsystem_TryConnectObjectAtLocation final 
{
public:
	struct FWorldConnectivityHandle               ObjectToConnect;                                   // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C08[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DesiredObjectTransform;                            // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWorldConnectivityHandle>       ConnectionCandidates;                              // 0x0070(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          PerformConnection;                                 // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0081(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C09[0xE];                                     // 0x0082(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AtomRuntime.WorldConnectivitySubsystem.UnregisterConnectivityActor
// 0x0008 (0x0008 - 0x0000)
struct WorldConnectivitySubsystem_UnregisterConnectivityActor final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetActor
// 0x0010 (0x0010 - 0x0000)
struct WorldConnectivitySubsystem_GetActor final 
{
public:
	struct FWorldConnectivityHandle               Handle;                                            // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C0A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetAtomModel
// 0x0010 (0x0010 - 0x0000)
struct WorldConnectivitySubsystem_GetAtomModel final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomModel*                             ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetAtomModelAssetUserData
// 0x0010 (0x0010 - 0x0000)
struct WorldConnectivitySubsystem_GetAtomModelAssetUserData final 
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomModelAssetUserData*                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AtomRuntime.WorldConnectivitySubsystem.GetConnectivityHandle
// 0x0010 (0x0010 - 0x0000)
struct WorldConnectivitySubsystem_GetConnectivityHandle final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
