#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Pickaxe_DualWield_Generic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_Pickaxe_DualWield_Generic.B_Athena_Pickaxe_DualWield_Generic_C
// 0x00A8 (0x1B88 - 0x1AE0)
class AB_Athena_Pickaxe_DualWield_Generic_C final  : public AFortWeaponPickaxeDualWieldAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1AE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Equipped;                                          // 0x1AE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD58[0x7];                                     // 0x1AE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      Alteration_Ambient_PS;                             // 0x1AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MeleeHeavy_ParticleSystem;                         // 0x1AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               MeleeHeavy_PSC;                                    // 0x1B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDestroyEffect;                                  // 0x1B08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD59[0x7];                                     // 0x1B09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        WeaponDurabilityDestroyEffect;                     // 0x1B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffectIcon;                 // 0x1B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Offhand_Alteration_Ambient_PS;                     // 0x1B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bEquipPendingInstigator;                           // 0x1B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD5A[0x3];                                     // 0x1B29(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Offhand_Socket_Name;                               // 0x1B2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MontageReference;                                  // 0x1B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTimeofDayControl;                               // 0x1B38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD5B[0x7];                                     // 0x1B39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     Impact_FX;                                         // 0x1B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Swing_Right_;                                      // 0x1B48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_CD5C[0x7];                                     // 0x1B49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Left_Swing_Rotation;                               // 0x1B50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Right_Swing_Rotation;                              // 0x1B68(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Swing_Right__0;                                    // 0x1B80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Anim_Trails_Disable();
	void Anim_Trails_Notify(bool bActive);
	void Bind_Dual_Melee_Swing_Events(TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_4, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_5, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_6, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_7, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_8, class APawn* CallFunc_GetInstigator_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_9, class APlayerPawn_Generic_C* K2Node_DynamicCast_AsPlayer_Pawn_Generic, bool K2Node_DynamicCast_bSuccess, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_10, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_11, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_12, TDelegate<void(bool bActive)> K2Node_CreateDelegate_OutputDelegate_13, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_14, TDelegate<void(bool bActive)> K2Node_CreateDelegate_OutputDelegate_15, class APawn* CallFunc_GetInstigator_ReturnValue_1, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena, bool K2Node_DynamicCast_bSuccess_1);
	void Binding_Time_of_Day_Control(bool F_, TScriptInterface<class IFortTimeOfDayManagerInterface> CallFunc_GetContextualTimeOfDayManager_ReturnValue, TDelegate<void(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation)> K2Node_CreateDelegate_OutputDelegate, EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue, EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void ExecuteUbergraph_B_Athena_Pickaxe_DualWield_Generic(int32 EntryPoint, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 Temp_int_Variable_2, int32 Temp_int_Variable_3, int32 Temp_int_Variable_4, EPhysicalSurface Temp_byte_Variable, bool CallFunc_IsDedicatedServer_ReturnValue, bool K2Node_Event_bPersistentFire, bool K2Node_Event_bSecondaryFire, bool CallFunc_DoesSocketExist_ReturnValue, const struct FVector& CallFunc_GetSocketLocation_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue, class UObject* Temp_object_Variable, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess, class UNiagaraSystem* K2Node_DynamicCast_AsNiagara_System, bool K2Node_DynamicCast_bSuccess_1, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue, const struct FFortCosmeticModification& K2Node_Event_CosmeticMod, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, bool CallFunc_IsAssetNull_ReturnValue, bool K2Node_Event_bVisible, bool K2Node_Event_bSetForLocalControllerOnly, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue_1, class UFortWeaponItemDefinition* CallFunc_GetWeaponData_ReturnValue, TSoftObjectPtr<class UTexture2D> CallFunc_GetSmallPreviewImage_ReturnValue, class UTexture2D* CallFunc_GetOrLoadSynchronously_ReturnValue, class FName Temp_name_Variable, class UObject* K2Node_CustomEvent_Loaded, bool Temp_bool_Variable, bool CallFunc_IsValid_ReturnValue_1, int32 Temp_int_Variable_5, class APawn* CallFunc_GetInstigator_ReturnValue_1, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn_1, bool K2Node_DynamicCast_bSuccess_2, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_IsValid_ReturnValue_2, int32 Temp_int_Variable_6, class UFXSystemComponent* CallFunc_GetAnimTrailsPSC_ReturnValue, class UFXSystemComponent* CallFunc_GetAnimTrailsOffhandPSC_ReturnValue, int32 Temp_int_Variable_7, bool CallFunc_DoesSocketExist_ReturnValue_1, const struct FVector& CallFunc_GetSocketLocation_ReturnValue_1, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue_1, int32 Temp_int_Variable_8, bool CallFunc_K2_AttachToComponent_ReturnValue, int32 Temp_int_Variable_9, int32 Temp_int_Variable_10, class UFXSystemComponent* CallFunc_GetIdleVFXComponent_ReturnValue, class UFXSystemComponent* CallFunc_GetIdleOffhandVFXComponent_ReturnValue, class UFXSystemComponent* CallFunc_GetSwingOffhandVFXComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, class UFXSystemComponent* CallFunc_GetSwingOffhandVFXComponent_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_4, class UFXSystemComponent* CallFunc_GetSwingVFXComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue_5, class UFXSystemComponent* CallFunc_GetSwingVFXComponent_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_6, EFortDualWieldSwingState CallFunc_GetCurrentSwingState_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_CustomEvent_bActive, bool CallFunc_GetUseAnimTrailsPSC_ReturnValue, class FName CallFunc_GetAnimTrailsSecondSocketName_ReturnValue, class FName CallFunc_GetAnimTrailsFirstSocketName_ReturnValue, float CallFunc_GetAnimTrailsWidth_ReturnValue, bool CallFunc_GetUseAnimTrailsOffhandPSC_ReturnValue, class UFXSystemComponent* CallFunc_GetAnimTrailsOffhandPSC_ReturnValue_1, class UParticleSystemComponent* K2Node_DynamicCast_AsCascade_Particle_System_Component, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_IsValid_ReturnValue_7, class FName CallFunc_GetAnimTrailsOffhandSecondSocketName_ReturnValue, class FName CallFunc_GetAnimTrailsOffhandFirstSocketName_ReturnValue, float CallFunc_GetAnimTrailsOffhandWidth_ReturnValue, int32 Temp_int_Variable_11, bool CallFunc_GetUseAnimTrailsOffhandPSC_ReturnValue_1, class UFXSystemComponent* CallFunc_GetAnimTrailsOffhandPSC_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_8, class UParticleSystemComponent* K2Node_DynamicCast_AsCascade_Particle_System_Component_1, bool K2Node_DynamicCast_bSuccess_5, bool CallFunc_GetUseAnimTrailsPSC_ReturnValue_1, int32 Temp_int_Variable_12, int32 Temp_int_Variable_13, int32 Temp_int_Variable_14, int32 Temp_int_Variable_15, int32 Temp_int_Variable_16, class UFXSystemComponent* CallFunc_GetAnimTrailVFXComponent_ReturnValue, class UFXSystemComponent* CallFunc_GetAnimTrailVFXComponent_ReturnValue_1, class UParticleSystemComponent* K2Node_DynamicCast_AsCascade_Particle_System_Component_2, bool K2Node_DynamicCast_bSuccess_6, bool CallFunc_IsValid_ReturnValue_9, class UParticleSystemComponent* K2Node_DynamicCast_AsCascade_Particle_System_Component_3, bool K2Node_DynamicCast_bSuccess_7, bool CallFunc_IsValid_ReturnValue_10, EFortDualWieldSwingState CallFunc_GetCurrentSwingState_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1, EFortDualWieldSwingState CallFunc_GetCurrentSwingState_ReturnValue_2, bool K2Node_SwitchEnum_CmpSuccess_2, struct FHitResult& K2Node_Event_HitResult, EPhysicalSurface K2Node_Event_ImpactPhysicalSurface, class UFXSystemComponent* K2Node_Event_SpawnedPSC, bool CallFunc_IsValid_ReturnValue_11, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, EFortDayPhase K2Node_CustomEvent_CurrentDayPhase, EFortDayPhase K2Node_CustomEvent_PreviousDayPhase, bool K2Node_CustomEvent_bAtCreation, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable, class FName K2Node_CustomEvent_StatName, int32 K2Node_CustomEvent_StatValue, int32 Temp_int_Variable_17, int32 Temp_int_Variable_18, int32 K2Node_CustomEvent_Watched_Kills, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn_1, bool K2Node_DynamicCast_bSuccess_8, class UFortAsyncAction_CosmeticAdaptiveStatWatcher* CallFunc_WatchCosmeticStat_ReturnValue, bool CallFunc_IsValid_ReturnValue_12, int32 Temp_int_Variable_19, int32 Temp_int_Variable_20, int32 Temp_int_Variable_21, int32 Temp_int_Variable_22, bool Temp_bool_IsClosed_Variable, bool CallFunc_IsCosmeticObjectDisplayedInFrontendContext_ReturnValue, TDelegate<void(class FName StatName, int32 StatValue)> K2Node_CreateDelegate_OutputDelegate_1, int32 Temp_int_Variable_23, const struct FRotator& K2Node_Select_Default, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, bool CallFunc_IsSingleWielding_ReturnValue, bool CallFunc_IsSingleWielding_ReturnValue_1, bool CallFunc_IsDualWielding_ReturnValue, int32 Temp_int_Variable_24, class UFXSystemComponent* CallFunc_GetIdleOffhandVFXComponent_ReturnValue_1, bool CallFunc_IsCosmeticObjectDisplayedInFrontendContext_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_13, class UNiagaraComponent* K2Node_DynamicCast_AsNiagara_Particle_System_Component, bool K2Node_DynamicCast_bSuccess_9, int32 Temp_int_Variable_25, class UFXSystemComponent* CallFunc_GetIdleVFXComponent_ReturnValue_1, class UFXSystemComponent* CallFunc_GetIdleOffhandVFXComponent_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_14, bool CallFunc_IsValid_ReturnValue_15, class UNiagaraComponent* K2Node_DynamicCast_AsNiagara_Particle_System_Component_1, bool K2Node_DynamicCast_bSuccess_10, class UFXSystemComponent* CallFunc_GetIdleVFXComponent_ReturnValue_2, TScriptInterface<class IFortTimeOfDayManagerInterface> CallFunc_GetContextualTimeOfDayManager_ReturnValue, EFortDayPhase CallFunc_GetPreviousDayPhase_ReturnValue, EFortDayPhase CallFunc_GetCurrentDayPhase_ReturnValue, bool CallFunc_IsValid_ReturnValue_16, int32 Temp_int_Variable_26, int32 Temp_int_Variable_27, int32 Temp_int_Variable_28, int32 Temp_int_Variable_29, int32 Temp_int_Variable_30, class AFortPlayerPawn* K2Node_CustomEvent_FortPlayerPawn, class AActor* K2Node_CustomEvent_NewVehicle, class AActor* K2Node_CustomEvent_OldVehicle, bool CallFunc_IsDrivingVehicle_ReturnValue, bool CallFunc_IsPassengerInVehicle_ReturnValue, class UFXSystemComponent* CallFunc_GetIdleVFXComponent_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue, class UFXSystemComponent* CallFunc_GetIdleOffhandVFXComponent_ReturnValue_3, TDelegate<void(class AFortPlayerPawn* FortPlayerPawn, class AActor* NewVehicle, class AActor* OldVehicle)> K2Node_CreateDelegate_OutputDelegate_2, int32 Temp_int_Variable_31, int32 Temp_int_Variable_32, int32 Temp_int_Variable_33, bool CallFunc_IsDedicatedServer_ReturnValue_2, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn_2, bool K2Node_DynamicCast_bSuccess_11, bool CallFunc_AttachesAnimTrailsToWeapon_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UAnimMontage* CallFunc_GetCurrentActiveMontage_ReturnValue, bool CallFunc_AttachesAnimTrailsToWeapon_ReturnValue_1, class FName CallFunc_Montage_GetCurrentSection_ReturnValue, int32 CallFunc_GetSectionIndex_ReturnValue, bool CallFunc_AttachesAnimTrailsToWeapon_ReturnValue_2, int32 Temp_int_Variable_34, const struct FVector& CallFunc_GetSocketLocation_ReturnValue_2, const struct FVector& CallFunc_GetSocketLocation_ReturnValue_3, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue, bool CallFunc_DoesSocketExist_ReturnValue_2, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult, bool CallFunc_DoesSocketExist_ReturnValue_3, int32 Temp_int_Variable_35, bool CallFunc_BooleanAND_ReturnValue, int32 K2Node_Select_Default_1, class APawn* CallFunc_GetInstigator_ReturnValue_2, class APlayerPawn_Generic_Parent_C* K2Node_DynamicCast_AsPlayer_Pawn_Generic_Parent, bool K2Node_DynamicCast_bSuccess_12, const struct FVector& CallFunc_GetSocketLocation_ReturnValue_4, const struct FVector& CallFunc_GetSocketLocation_ReturnValue_5, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue_1, bool CallFunc_DoesSocketExist_ReturnValue_4, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult_1, bool CallFunc_DoesSocketExist_ReturnValue_5, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_17, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue_1, const struct FRotator& CallFunc_InverseTransformRotation_ReturnValue, const struct FRotator& CallFunc_ComposeRotators_ReturnValue, const struct FRotator& CallFunc_TransformRotation_ReturnValue, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult_2);
	void HandleKillWatch();
	void K2_OnUnEquip();
	void OnEquippedWeaponDestory();
	void OnInitCosmeticAlterations(const struct FFortCosmeticModification& CosmeticMod);
	void OnInitWeaponCosmetics();
	void OnInstigatorSet();
	void OnLoaded_F1C7B8E24518F4F2DE2C8DBABB95E06D(class UObject* Loaded);
	void OnPlayImpactFX(struct FHitResult& HitResult, EPhysicalSurface ImpactPhysicalSurface, class UFXSystemComponent* SpawnedPSC);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnStatChanged_9F72D14C4573F491E38302B51F08A0B8(class FName StatName, int32 StatValue);
	void OnWeaponAttached();
	void OnWeaponDetached();
	void OnWeaponVisibilityChanged(bool bVisible, bool bSetForLocalControllerOnly);
	void PlayRClickImpacts();
	void Set_Active_Alteration_Idle_Particles(bool Active, bool Reset, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void SetWpnRarity();
	void Swing_Left();
	void Swing_Left_2();
	void Swing_Left_End();
	void Swing_Right();
	void Swing_Right_2();
	void Swing_Right_End();
	void SwingLeft_Common();
	void SwingRight_Common();
	void TODCheck(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void Unbind_Dual_Melee_Swing_Events(TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_4, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_5, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_6, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_7, class APawn* CallFunc_GetInstigator_ReturnValue, TDelegate<void(bool bActive)> K2Node_CreateDelegate_OutputDelegate_8, class APlayerPawn_Generic_C* K2Node_DynamicCast_AsPlayer_Pawn_Generic, bool K2Node_DynamicCast_bSuccess, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_9, TDelegate<void(bool bActive)> K2Node_CreateDelegate_OutputDelegate_10, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_11, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_12, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_13, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_14, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_15, class APawn* CallFunc_GetInstigator_ReturnValue_1, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena, bool K2Node_DynamicCast_bSuccess_1);
	void UpdateBasedOnKills(int32 Watched_Kills);
	void UserConstructionScript();
	void Vehicle_Passenger(class AFortPlayerPawn* FortPlayerPawn, class AActor* NewVehicle, class AActor* OldVehicle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Athena_Pickaxe_DualWield_Generic_C">();
	}
	static class AB_Athena_Pickaxe_DualWield_Generic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_Pickaxe_DualWield_Generic_C>();
	}
};

}

