#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_EmotePreviewDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_EmotePreviewDisplay.B_EmotePreviewDisplay_C
// 0x0070 (0x0318 - 0x02A8)
class AB_EmotePreviewDisplay_C final  : public AFortEmotePreviewActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAthenaEmojiItemDefinition*             EmojiItemDefinition;                               // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            Animation;                                         // 0x02C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UFortMontageItemDefinitionBase*         DanceOrEmojiItemDefinition;                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartSectionName;                                  // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE73[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnEmoteSetupFinished;                              // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAthenaShoutItemDefinition*             ShoutItemDefinition;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                DynamicallySpawnedSounds;                          // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void SpecialCaseShoutHandler();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void PreviewEmote(class UFortMontageItemDefinitionBase* Emote);
	void PerformSpecialAction(class FName ActionName);
	void OnLoaded_638F148342254A777E929B88915A8958(class UObject* Loaded);
	void OnEmoteSetupFinished__DelegateSignature();
	void ExecuteUbergraph_B_EmotePreviewDisplay(int32 EntryPoint, bool CallFunc_IsValid_ReturnValue, class FName K2Node_Event_ActionName, EEndPlayReason K2Node_Event_EndPlayReason, class UObject* Temp_object_Variable, class UAnimMontage* K2Node_DynamicCast_AsAnim_Montage, bool K2Node_DynamicCast_bSuccess, class UFortMontageItemDefinitionBase* K2Node_Event_Emote, class UObject* K2Node_CustomEvent_Loaded, class UFortFrontEndContext* CallFunc_GetContext_ReturnValue, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate, class AFortPlayerPawn* CallFunc_GetHeroPlayerPawnForCurrentDisplayedItem_ReturnValue, class UFortEmojiPreviewComponent* CallFunc_GetComponentByClass_ReturnValue, struct FTransform& Temp_struct_Variable, bool CallFunc_IsValid_ReturnValue_1, class UFortEmojiPreviewComponent* CallFunc_AddComponent_ReturnValue, class UFortFrontEndContext* CallFunc_GetContext_ReturnValue_1, class AFortPlayerPawn* CallFunc_GetHeroPlayerPawnForCurrentDisplayedItem_ReturnValue_1, class UAthenaShoutItemDefinition* K2Node_DynamicCast_AsAthena_Shout_Item_Definition, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue_2, struct FTransform& CallFunc_GetTransform_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, class UAthenaEmojiItemDefinition* K2Node_DynamicCast_AsAthena_Emoji_Item_Definition, bool K2Node_DynamicCast_bSuccess_2, class UFortFrontEndContext* CallFunc_GetContext_ReturnValue_2, class AFortPlayerPawn* CallFunc_GetHeroPlayerPawnForCurrentDisplayedItem_ReturnValue_2, EFortCustomGender CallFunc_GetCharacterGender_ReturnValue, EFortCustomBodyType CallFunc_GetCharacterBodyType_ReturnValue, TSoftObjectPtr<class UAnimMontage> CallFunc_GetFrontendPreviewAnimation_ReturnValue, bool CallFunc_IsValidSoftObjectReference_ReturnValue, struct FTransform& Temp_struct_Variable_1, class UFortFrontEndContext* CallFunc_GetContext_ReturnValue_3, class UAudioComponent* CallFunc_SpawnSoundComponent_SpawnedComponent, class AFortPlayerPawn* CallFunc_GetHeroPlayerPawnForCurrentDisplayedItem_ReturnValue_3, class UFortEmojiPreviewComponent* CallFunc_AddComponent_ReturnValue_1, class UFortEmojiPreviewComponent* CallFunc_GetComponentByClass_ReturnValue_1, float CallFunc_PlayLocalAnimMontage_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, class FName CallFunc_PickMontageSection_ReturnValue, int32 CallFunc_Array_Add_ReturnValue);
	void CleanupDynamicSounds(int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, class UAudioComponent* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class UAudioComponent* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1);
	void ApplyEmoteToPet(bool IsRemoval, class UFortFrontEndContext* CallFunc_GetContext_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class AFortPlayerPawn* CallFunc_GetHeroPlayerPawnForCurrentDisplayedItem_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UFortPetAnimInstance* K2Node_DynamicCast_AsFort_Pet_Anim_Instance, bool K2Node_DynamicCast_bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_EmotePreviewDisplay_C">();
	}
	static class AB_EmotePreviewDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_EmotePreviewDisplay_C>();
	}
};

}

