#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_GasPump_Valet_Component

#include "Basic.hpp"

#include "ModularGameplay_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_GasPump_Valet_Component.B_GasPump_Valet_Component_C
// 0x0020 (0x00C0 - 0x00A0)
class UB_GasPump_Valet_Component_C final  : public UGameFrameworkComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Gas_Pump_Icon_Enabled;                             // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_913D[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Gas_Pump_IndicatorManager_Class;                   // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UValet_GasPumpIndicatorManagerV2_C*     Gas_Pump_IndicatorManager;                         // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_GasPump_Valet_Component(int32 EntryPoint, bool CallFunc_IsValid_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, ESubGame CallFunc_GetSubGame_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, EEvaluateCurveTableResult CallFunc_EvaluateCurveTableRow_OutResult, float CallFunc_EvaluateCurveTableRow_OutXY, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, EEndPlayReason K2Node_Event_EndPlayReason, class AActor* CallFunc_GetOwner_ReturnValue_1, class AFortGameStateAthena* CallFunc_GetGameStateAthena_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_HasAuthority_ReturnValue_1, class UFortGameStateComponent* CallFunc_GetComponentByClass_ReturnValue, class UValet_GasPumpIndicatorManagerV2_C* K2Node_DynamicCast_AsValet_Gas_Pump_Indicator_Manager_V2, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue_3, double CallFunc_Greater_DoubleDouble_A_ImplicitCast);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_GasPump_Valet_Component_C">();
	}
	static class UB_GasPump_Valet_Component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UB_GasPump_Valet_Component_C>();
	}
};

}

