#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_MusicEventDebugWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass B_MusicEventDebugWidget.B_MusicEventDebugWidget_C
// 0x0040 (0x0308 - 0x02C8)
class UB_MusicEventDebugWidget_C final  : public UMusicEventSubsystemDebugWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        Background;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        EventInstances;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 AssetFilter;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UMusicEventInstance*>            Instances;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         FontSize;                                          // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_MusicEventDebugWidget(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UMusicEventInstance*>& K2Node_Event_Instances, double K2Node_CustomEvent_X, double K2Node_CustomEvent_Y, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const class FString& K2Node_CustomEvent_Filter, const struct FWidgetTransform& K2Node_MakeStruct_WidgetTransform, int32 K2Node_CustomEvent_Size, TArray<class UUserWidget*>& CallFunc_GetDisplayedEntryWidgets_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UUserWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UB_MusicEventInstanceWidget_C* K2Node_DynamicCast_AsB_Music_Event_Instance_Widget, bool K2Node_DynamicCast_bSuccess);
	void FilterInstances(const TArray<int32>& IndicesToRemove, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, int32 CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, int32 CallFunc_Max_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_IsEmpty_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, class UMusicEventInstance* CallFunc_Array_Get_Item_1, bool CallFunc_Less_IntInt_ReturnValue, class USoundBase* CallFunc_GetAsset_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue, bool CallFunc_Contains_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue);
	void SetEventInstances(TArray<class UMusicEventInstance*>& Param_Instances);
	void SetMusicEventAssetFilter(const class FString& Filter);
	void SetMusicEventFontSize(int32 Size);
	void SetMusicEventPos(double X, double Y);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_MusicEventDebugWidget_C">();
	}
	static class UB_MusicEventDebugWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UB_MusicEventDebugWidget_C>();
	}
};

}

