#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SparksCosmeticPreviewDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SparksCosmeticPreviewDisplay_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_SparksCosmeticPreviewDisplay.B_SparksCosmeticPreviewDisplay_C
// 0x0050 (0x04D8 - 0x0488)
class AB_SparksCosmeticPreviewDisplay_C final  : public ABP_SparksCosmeticPreviewDisplay_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 MicMesh;                                           // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 LHDrumstick;                                       // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 RHDrumstick;                                       // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 MicStandMesh;                                      // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DrumMesh;                                          // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 GuitarMesh;                                        // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Is__active;                                        // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D35A[0x7];                                     // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             NewEventDispatcher;                                // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CustomizePreviewInstance(class UFortItemDefinition* InItemDefinition);
	void ExecuteUbergraph_B_SparksCosmeticPreviewDisplay(int32 EntryPoint, const struct FSparksVariantChoices& CallFunc_GetCurrentChoices_ReturnValue, class UFortItemDefinition* K2Node_Event_InItemDefinition, class USparksInstrumentItemDefBase* K2Node_DynamicCast_AsSparks_Instrument_Item_Def_Base, bool K2Node_DynamicCast_bSuccess, TSoftObjectPtr<class USparksInstrumentItemDefBase> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UFXSystemAsset* CallFunc_GetMainFXSystem_ReturnValue, class UMaterialInstance* CallFunc_GetMaterial_ReturnValue, class USkeletalMesh* CallFunc_GetMesh_ReturnValue, class UFXSystemAsset* CallFunc_GetLHFXSystem_ReturnValue, class UMaterialInstance* CallFunc_GetLeftHandMaterial_ReturnValue, class USkeletalMesh* CallFunc_GetLeftHandMesh_ReturnValue, class UFXSystemAsset* CallFunc_GetAuxFXSystem_ReturnValue, class UMaterialInstance* CallFunc_GetAuxiliaryMaterial2_ReturnValue, class UMaterialInstance* CallFunc_GetAuxiliaryMaterial_ReturnValue, class USkeletalMesh* CallFunc_GetAuxiliaryMesh_ReturnValue);
	void FixupMeshAndMaterials(class USkeletalMeshComponent* MeshComponent, class USkeletalMesh* NewMesh, class UMaterialInstance* Material1, class UMaterialInstance* Material2, class UFXSystemAsset* FX, class UFXSystemComponent* CallFunc_SpawnFXSystemAttached_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4);
	void Hide_all();
	void NewEventDispatcher__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_SparksCosmeticPreviewDisplay_C">();
	}
	static class AB_SparksCosmeticPreviewDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_SparksCosmeticPreviewDisplay_C>();
	}
};

}

