#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SparksOnActorPreviewDefault

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SparksCosmeticsRuntime_classes.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_SparksOnActorPreviewDefault.B_SparksOnActorPreviewDefault_C
// 0x0150 (0x0870 - 0x0720)
class AB_SparksOnActorPreviewDefault_C final  : public ASparksItemPreviewOnPawnActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Temp_IASDerezAbsorbPoint;                          // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             Directional_Light_For_Atmosphere_PC;               // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLightPC;                                        // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLightLowMobile;                                 // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLightMobile;                            // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    KeyLight_StandaloneForSwitch;                      // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    KeyLight5;                                         // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    KeyLight6;                                         // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    KeyLigh3;                                          // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    KeyLight2;                                         // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    BounceRear1;                                       // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimLowerRight1;                                    // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimLeft1;                                          // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimTopRight1;                                      // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimBottomLeft1;                                    // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Bounce1;                                           // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LightTransform;                                    // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Sample_Mesh;                                       // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RezInMaterialEffectTimeLine2_NewTrack_0_EE684F644FE38B4A30D17FB8CF917357; // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RezInMaterialEffectTimeLine2__Direction_EE684F644FE38B4A30D17FB8CF917357; // 0x07D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D32F[0x3];                                     // 0x07D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RezInMaterialEffectTimeLine2;                      // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         RezInMaterialEffectTimeLine_NewTrack_0_9C89220943F4EBA1DF12D38A05B1FC5C; // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RezInMaterialEffectTimeLine__Direction_9C89220943F4EBA1DF12D38A05B1FC5C; // 0x07E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D330[0x3];                                     // 0x07E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RezInMaterialEffectTimeLine;                       // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysOn;                                          // 0x07F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x07F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugConstructionLighting;                         // 0x07F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D331[0x5];                                     // 0x07F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               ObscuringLoopEmitter;                              // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ToonLightRotatio;                                  // 0x0800(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsBattlePassReward;                               // 0x0818(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D332[0x7];                                     // 0x0819(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LOD_StreamingSafetyTimer;                          // 0x0820(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DefaultFloorMaterial;                              // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CustomFloorMaterial;                               // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FStateTransitionPauseRequestHandle     ItemsPendingTransitionOutHandle;                   // 0x0838(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFXSystemComponent*                     IASLoadingFX_LoopFX;                               // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Secondary_Transition_Effects;                  // 0x0850(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Floor;                                        // 0x0851(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D333[0x6];                                     // 0x0852(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           IASLoadingDelayTimer;                              // 0x0858(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           IASLoadingFXDestroyDelayTimer;                     // 0x0860(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           IASResinDelayTimer;                                // 0x0868(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Backup_LODStreamingFailed();
	void DestroyLoadingEffects(bool CallFunc_IsValid_ReturnValue);
	void ExecuteUbergraph_B_SparksOnActorPreviewDefault(int32 EntryPoint, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue, uint8 CallFunc_Conv_IntToByte_ReturnValue, uint8 CallFunc_GetValidValue_ReturnValue, uint8 CallFunc_Conv_IntToByte_ReturnValue_1, uint8 CallFunc_GetEnumeratorValueFromIndex_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue, int32 Temp_int_Variable_2, uint8 CallFunc_Conv_IntToByte_ReturnValue_2, uint8 CallFunc_GetValidValue_ReturnValue_1, int32 Temp_int_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_1, uint8 CallFunc_Conv_IntToByte_ReturnValue_3, uint8 CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, const struct FVector& CallFunc_GetPawnLocation_ReturnValue, bool K2Node_Event_bEnableAutotestBackground, struct FStateTransitionControllerHandle& K2Node_Event_TransitionController, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, const struct FStateTransitionControllerHandle& K2Node_CustomEvent_TransitionController, const struct FVector& CallFunc_GreaterGreater_VectorRotator_ReturnValue, const struct FLinearColor& CallFunc_Conv_VectorToLinearColor_ReturnValue, class UMaterialInterface* K2Node_Event_InMaterialInstance, bool K2Node_Event_bUseSecondaryTransitionEffects, bool K2Node_Event_bShowFloor, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_GetUseIASItemPreviewLoadingEvents_ReturnValue, bool CallFunc_GetUseIASItemPreviewLoadingEvents_ReturnValue_1, bool CallFunc_GetUseIASItemPreviewLoadingEvents_ReturnValue_2, const struct FVector& CallFunc_GetPawnLocation_ReturnValue_1, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue_1, float CallFunc_GetStreamingSafetyDuration_ReturnValue, bool CallFunc_GetUseIASItemPreviewLoadingEvents_ReturnValue_3, struct FFortPawnMaterialOverrideCopiedParameters& Temp_struct_Variable, bool CallFunc_GetUseCleanUpForIASItemPreviewFXDestruction_ReturnValue, bool CallFunc_K2_AttachToComponent_ReturnValue, bool CallFunc_GetUseCleanUpForIASItemPreviewFXDestruction_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_1, TSoftObjectPtr<class UMaterialInstanceDynamic> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, class ACustomCharacterPartModifier* CallFunc_GetModifierForPartType_ReturnValue, class ACustomCharacterPartModifier* CallFunc_GetModifierForPartType_ReturnValue_1, class USkeletalMeshComponent* CallFunc_GetSkeletalMeshForPartType_ReturnValue, class USkeletalMeshComponent* CallFunc_GetSkeletalMeshForPartType_ReturnValue_1, class USkeletalMeshComponent* CallFunc_GetSkeletalMeshForPartType_ReturnValue_2, class USkeletalMeshComponent* CallFunc_GetSkeletalMeshForPartType_ReturnValue_3, class USkeletalMeshComponent* CallFunc_GetSkeletalMeshForPartType_ReturnValue_4, class USkeletalMeshComponent* CallFunc_GetSkeletalMeshForPartType_ReturnValue_5, class USkeletalMeshComponent* CallFunc_GetSkeletalMeshForPartType_ReturnValue_6, const struct FGuid& CallFunc_BP_ApplyMaterialOverrideLocalWithFlags_ReturnValue, bool CallFunc_RemoveMaterialOverrideLocal_ReturnValue, bool Temp_bool_Variable, class UMaterialInterface* K2Node_Select_Default, bool Temp_bool_Variable_1, bool Temp_bool_B_Execution_Happened_Variable, class UMaterialInterface* K2Node_Select_Default_1, int32 CallFunc_MakeLiteralInt_ReturnValue, int32 CallFunc_MakeLiteralInt_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_GetHideModifierFXUntilResInDissolveComplete_ReturnValue, bool CallFunc_GetHideModifierFXUntilResInDissolveComplete_ReturnValue_1, bool Temp_bool_A_Execution_Happened_Variable, bool CallFunc_BooleanAND_ReturnValue);
	void FinishShowingResOutEffects();
	void Get_LOD_Streaming_Safety_Duration();
	void HandleLightingSettingsChanged(class UFortGameUserSettings* CallFunc_GetFortGameUserSettings_ReturnValue, bool CallFunc_IsNintendoSwitch_ReturnValue, bool CallFunc_IsInPerformanceMode_ReturnValue, bool CallFunc_IsMobileGame_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, int32 CallFunc_GetShadowQuality_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_2);
	void Internal_ItemsPendingTransitionOutComplete(const struct FStateTransitionControllerHandle& TransitionController);
	void IsSkyDiveContrailItem(bool* bSuccess, class UAthenaSkyDiveContrailItemDefinition* K2Node_DynamicCast_AsAthena_Sky_Dive_Contrail_Item_Definition, bool K2Node_DynamicCast_bSuccess);
	void LightControl(bool Active, bool CallFunc_IsMobileGame_ReturnValue, bool CallFunc_IsNintendoSwitch_ReturnValue, bool CallFunc_IsNintendoSwitch_ReturnValue_1, class UFortGameUserSettings* CallFunc_GetFortGameUserSettings_ReturnValue, bool CallFunc_IsInPerformanceMode_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, int32 CallFunc_GetShadowQuality_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_3);
	void OnAllLODStreamingComplete();
	void OnCurrentVisualsCleanedUp();
	void OnItemsPendingTransitionOut(struct FStateTransitionControllerHandle& TransitionController);
	void OnItemsPendingTransitionOut_EnsureAllResOutEffectsAreCleanedUp();
	void OnItemsPendingTransitionOut_SpawnResOutEffects();
	void OnPreviewVisualsBeginLoading();
	void OnPreviewVisualsSpawned(bool bUseSecondaryTransitionEffects, bool bShowFloor);
	void OnSetFloorMaterial(class UMaterialInterface* InMaterialInstance);
	void OnUpdateFloorMaterial(bool bEnableAutotestBackground);
	void OutroAndDestroyLoadingEffects(float CallFunc_GetNumericCVar_OutValue, bool CallFunc_GetNumericCVar_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_GetUseOutroForIASLoadingEffects_ReturnValue, float CallFunc_GetNumericCVar_OutValue_1, bool CallFunc_GetNumericCVar_ReturnValue_1, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1, double CallFunc_Greater_DoubleDouble_A_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast_1);
	void RezInMaterialEffect();
	void RezInMaterialEffectTimeLine2__FinishedFunc();
	void RezInMaterialEffectTimeLine2__UpdateFunc();
	void RezInMaterialEffectTimeLine__FinishedFunc();
	void RezInMaterialEffectTimeLine__UpdateFunc();
	void SetFloorEnabled(bool Param_Show_Floor, bool CallFunc_Not_PreBool_ReturnValue);
	void SetupFloor(bool CallFunc_IsSkyDiveContrailItem_bSuccess, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class UCommonActivatableWidget* CallFunc_GetCurrentStateWidget_ReturnValue, TArray<EFortUIFeature>& K2Node_MakeArray_Array, bool CallFunc_IsValid_ReturnValue, class UAthenaUIStateWidget_Frontend* K2Node_DynamicCast_AsAthena_UIState_Widget_Frontend, bool K2Node_DynamicCast_bSuccess, EFortUIFeature CallFunc_GetCurrentTab_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_BooleanOR_ReturnValue);
	void SetupLighting();
	void SpawnLoadingEffects(const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UFXSystemComponent* CallFunc_SpawnFXAtLocation_ReturnValue);
	void SpawnResInEffects(const struct FVector& CallFunc_GetPawnLocation_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue);
	void SpawnSoundPlayback();
	void SwitchErebusLighting(bool Visibility, const TArray<class USpotLightComponent*>& L_lights);
	void SwitchMobileLighting(bool NewParam);
	void SwitchPCLighting(bool Visibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_SparksOnActorPreviewDefault_C">();
	}
	static class AB_SparksOnActorPreviewDefault_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_SparksOnActorPreviewDefault_C>();
	}
};

}

