#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AudioParameterComponent_Pawn

#include "Basic.hpp"

#include "AudioParameterQueryData_structs.hpp"
#include "Engine_structs.hpp"
#include "PlayerWaterDepthEnum_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AudioParameterComponent_Pawn.BP_AudioParameterComponent_Pawn_C
// 0x0040 (0x0130 - 0x00F0)
class UBP_AudioParameterComponent_Pawn_C final  : public UFortAudioParameterComponent_Pawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 LocalViewTarget;                                   // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAudioParameterQueryData>       QueryAudioParams;                                  // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bDebugEnabled;                                     // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInWater;                                         // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BFA4[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        LocalPlayerPawnTarget;                             // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        WaterDepthValue;                                   // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerWaterDepthEnum                         PlayerWaterDepth;                                  // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerWaterDepthEnum                         CurrentWaterDepth;                                 // 0x0129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaterDepthChanged;                                 // 0x012A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AudioParameterComponent_Pawn(int32 EntryPoint, class AActor* K2Node_Event_Actor);
	float GetWaterDepthValue(double CallFunc_MapRangeClamped_ReturnValue, double CallFunc_GetWorldDeltaSeconds_ReturnValue, float CallFunc_GetWaterImmersionDepth_ReturnValue, bool CallFunc_NotEqual_DoubleDouble_ReturnValue, double CallFunc_SelectFloat_ReturnValue, double CallFunc_FInterpTo_ReturnValue, float K2Node_FunctionResult_ReturnValue_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast, double CallFunc_NotEqual_DoubleDouble_A_ImplicitCast);
	void Movement_Mode_Change(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnEnterWater(class AFortPlayerPawn* FortPlayerPawn, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_1);
	void OnExitWater(class AFortPlayerPawn* FortPlayerPawn, bool bPawnIsOutsideOfAllWaterBodies, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_1);
	void OnViewTargetSet(class AActor* Actor);
	void OnWaterDepthSwitch(EPlayerWaterDepthEnum Temp_byte_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 Temp_int_Variable_2, int32 Temp_int_Variable_3, int32 Temp_int_Variable_4, bool CallFunc_IsValid_ReturnValue, class UAudioParameterComponent* CallFunc_GetAudioParameterComponent_ReturnValue, int32 K2Node_Select_Default, bool CallFunc_IsCrouching_ReturnValue, TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetIntParameter_self_CastInput, TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetBoolParameter_self_CastInput);
	void OnWaterUpdate(float CallFunc_GetWaterDepthValue_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, bool CallFunc_NotEqual_ByteByte_ReturnValue, bool CallFunc_IsSurfaceSwimming_ReturnValue, double CallFunc_Greater_DoubleDouble_A_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast_1);
	void PrintParameter(struct FAudioParameterQueryData& Parameter, bool Condition);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AudioParameterComponent_Pawn_C">();
	}
	static class UBP_AudioParameterComponent_Pawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AudioParameterComponent_Pawn_C>();
	}
};

}

