#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerPawn_Athena_Phoebe

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PlayerPawn_Athena_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C
// 0x0020 (0x6970 - 0x6950)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_PlayerPawn_Athena_Phoebe_C : public APlayerPawn_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PlayerPawn_Athena_Phoebe_C;      // 0x6950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   AIEvaluator_CharacterLaunchedKeyName;              // 0x6958(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCosmeticVariants;                              // 0x695C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9115[0x3];                                     // 0x695D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CosmeticVariantID;                                 // 0x6960(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AssignCosmeticVariant(bool CallFunc_GreaterEqual_IntInt_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, class USkeletalMeshComponent* CallFunc_GetSkeletalMeshForPartType_ReturnValue, bool CallFunc_IsValid_ReturnValue, float CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast);
	void ComputeCosmeticVariantID(bool CallFunc_Less_IntInt_ReturnValue, class UAthenaAIServicePlayerBots* CallFunc_GetAIServicePlayerBots_ReturnValue, int32 CallFunc_FetchNextCustomBotCosmeticVariantID_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe(int32 EntryPoint, class AFortPlayerPawn* K2Node_Event_Pawn, bool CallFunc_HasAuthority_ReturnValue);
	void OnCharacterCustomizationCompleted(class AFortPlayerPawn* Pawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerPawn_Athena_Phoebe_C">();
	}
	static class ABP_PlayerPawn_Athena_Phoebe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerPawn_Athena_Phoebe_C>();
	}
};
#pragma pack(pop)

}

