#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SparksCosmeticComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SparksCosmeticComponent.BP_SparksCosmeticComponent_C.Debug_BP_ShowCosmeticPicker
// 0x0001 (0x0001 - 0x0000)
struct BP_SparksCosmeticComponent_C_Debug_BP_ShowCosmeticPicker final 
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_SparksCosmeticComponent.BP_SparksCosmeticComponent_C.ExecuteUbergraph_BP_SparksCosmeticComponent
// 0x0010 (0x0010 - 0x0000)
struct BP_SparksCosmeticComponent_C_ExecuteUbergraph_BP_SparksCosmeticComponent final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AF4[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Sparks_Dbg_CosmeticPicker_C*       CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

}

