#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_SparksSongPreviewer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EpicMediaBasePlayer_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_SparksSongPreviewer.BPC_SparksSongPreviewer_C
// 0x0050 (0x00F0 - 0x00A0)
class UBPC_SparksSongPreviewer_C final  : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortBaseStreamingVideo*                Streamer;                                          // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentSong;                                       // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PendingSong;                                       // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeInDuration;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeOutDuration;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreviewDuration;                                   // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           LoopPointFadeTimerHandle;                          // 0x00D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        LoopFadeOutDurationFromEnd;                        // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FadeOutForStopTimerHandle;                         // 0x00E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFadingOut;                                       // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Clear_Current_Preview_and_Start_Pending_Preview(class FName CallFunc_MakeLiteralName_ReturnValue, bool CallFunc_NotEqual_NameName_ReturnValue);
	void DoneFadingOutForStop();
	void ExecuteUbergraph_BPC_SparksSongPreviewer(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, class UMusicEventSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, TDelegate<void(EBaseMediaTerminalErrorReason Reason)> K2Node_CreateDelegate_OutputDelegate_2, class UMusicEventSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_1, class UMusicEventSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_2, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, const struct FMediaPlayerOptions& K2Node_MakeStruct_MediaPlayerOptions, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_4, class UMediaSoundComponent* CallFunc_GetSoundComponent_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, class UMediaSoundComponent* CallFunc_GetSoundComponent_ReturnValue_1, class UMediaPlayer* CallFunc_GetMediaPlayer_ReturnValue, bool CallFunc_Open_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_5, class UMediaSoundComponent* CallFunc_GetSoundComponent_ReturnValue_2, EEndPlayReason K2Node_Event_EndPlayReason, double CallFunc_Subtract_DoubleDouble_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_2, EBaseMediaTerminalErrorReason K2Node_CustomEvent_Reason, class UMediaPlayer* CallFunc_GetMediaPlayer_ReturnValue_1, bool CallFunc_Rewind_ReturnValue, class UMediaSoundComponent* CallFunc_GetSoundComponent_ReturnValue_3, class UMediaSoundComponent* CallFunc_GetSoundComponent_ReturnValue_4, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_6, class UMediaSoundComponent* CallFunc_GetSoundComponent_ReturnValue_5, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_7, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, float CallFunc_FadeIn_FadeInDuration_ImplicitCast, float CallFunc_FadeOut_FadeOutDuration_ImplicitCast, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast, float CallFunc_FadeOut_FadeOutDuration_ImplicitCast_1, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2);
	void Fade_Out_And_Stop();
	void FadeInAfterLoop();
	void FadeOutAtLoop();
	void ForceStopPreviewImmediate();
	void InitPreview(bool CallFunc_IsValid_ReturnValue, class UFortBaseStreamingVideo* CallFunc_SpawnObject_ReturnValue, class UMediaSoundComponent* CallFunc_GetSoundComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_Init_ReturnValue);
	void OnPlaybackResumed_Event();
	void OnVideoResumed();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void StartPreview(class FName SongShortName, const class FString& CallFunc_Conv_NameToString_ReturnValue, bool CallFunc_NotEqual_NameName_ReturnValue, class FName CallFunc_MakeLiteralName_ReturnValue, class USparksSongCatalog* CallFunc_GetGameInstanceSubsystem_ReturnValue, class UCatalogData* CallFunc_GetSongByShortName_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsEmpty_ReturnValue);
	void StopPreview(bool WithFadeout, class FName CallFunc_MakeLiteralName_ReturnValue, bool CallFunc_NotEqual_NameName_ReturnValue);
	void StopPreviewingSong(bool WithFadeout, class FName SongShortName, bool CallFunc_EqualEqual_NameName_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue_1);
	void VideoOnClosed_Event();
	void VideoOnSuccess_Event();
	void VideoOnTerminalError_Event(EBaseMediaTerminalErrorReason Reason);

	void IsPlayingPreview(class FName Song, bool* Is_Playing_Or_Pending, bool* Is_Playing, bool* Is_Pending, bool CallFunc_EqualEqual_NameName_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_SparksSongPreviewer_C">();
	}
	static class UBPC_SparksSongPreviewer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_SparksSongPreviewer_C>();
	}
};

}

