#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionMapShared

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class CollectionMapShared.AthenaCollectionScreenMapBase
// 0x0088 (0x06D0 - 0x0648)
class UAthenaCollectionScreenMapBase : public UAthenaCollectionScreenBase
{
public:
	class UAthenaFullScreenMapBase*               MapWidget;                                         // 0x0648(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9136[0x8];                                     // 0x0650(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAthenaMapCollectionIcon>   CollectionIconType;                                // 0x0658(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UAthenaMapCollectionIcon*> MapCollectionIcons;                                // 0x0660(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9137[0x20];                                    // 0x06B0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCollectionScreenMapBase">();
	}
	static class UAthenaCollectionScreenMapBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCollectionScreenMapBase>();
	}
};

// Class CollectionMapShared.AthenaMapCollectionIcon
// 0x0000 (0x0388 - 0x0388)
class UAthenaMapCollectionIcon final  : public UAthenaMapNavigableIconCustom
{
public:
	void SetIsKnown(bool bIsKnown);
	void SetSecondaryIcon(TSoftObjectPtr<class UObject>& SecondaryIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaMapCollectionIcon">();
	}
	static class UAthenaMapCollectionIcon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMapCollectionIcon>();
	}
};

}

