#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContextualActionCodeRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ContextualActionCodeRuntime.EHijackingStatus
// NumValues: 0x0003
enum class EHijackingStatus : uint8
{
	WaitingForTarget                         = 0,
	AttachedToVehicle                        = 1,
	EHijackingStatus_MAX                     = 2,
};

// Enum ContextualActionCodeRuntime.ERappellingState
// NumValues: 0x0005
enum class ERappellingState : uint8
{
	Targeting                                = 0,
	ConnectedAndWaiting                      = 1,
	Rappelling                               = 2,
	RappellingSwing                          = 3,
	ERappellingState_MAX                     = 4,
};

// Enum ContextualActionCodeRuntime.ESwingingState
// NumValues: 0x0003
enum class ESwingingState : uint8
{
	Unattached                               = 0,
	Attached                                 = 1,
	ESwingingState_MAX                       = 2,
};

// ScriptStruct ContextualActionCodeRuntime.FortMovementMode_SwingingObjectRuntimeData
// 0x00C8 (0x00E0 - 0x0018)
struct alignas(0x10) FFortMovementMode_SwingingObjectRuntimeData final  : public FFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_9167[0xC8];                                    // 0x0018(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContextualActionCodeRuntime.FortMovementMode_SwingingObjectCreationData
// 0x0020 (0x0028 - 0x0008)
struct FFortMovementMode_SwingingObjectCreationData final  : public FFortMovementMode_BaseExtCreationData
{
public:
	struct FVector                                AttachLocation;                                    // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AFortSwingingObject>     TargetSwingingObject;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualActionCodeRuntime.FortMovementMode_SwingingRopeRuntimeData
// 0x0028 (0x0040 - 0x0018)
struct FFortMovementMode_SwingingRopeRuntimeData final  : public FFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_9168[0x28];                                    // 0x0018(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ContextualActionCodeRuntime.FortMovementMode_SwingingRopeCreationData
// 0x0020 (0x0028 - 0x0008)
struct FFortMovementMode_SwingingRopeCreationData final  : public FFortMovementMode_BaseExtCreationData
{
public:
	struct FVector                                AttachLocation;                                    // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AFortSwingingObject>     TargetSwingingRope;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ContextualActionCodeRuntime.FortSwingingObjectClassData
// 0x0000 (0x0108 - 0x0108)
struct FFortSwingingObjectClassData final  : public FBuildingGameplayActorClassData
{
};

}

