#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRDLevelInstanceRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class CRDLevelInstanceRuntime.FortAthenaMutator_LevelInstanceDevice
// 0x0008 (0x0340 - 0x0338)
class AFortAthenaMutator_LevelInstanceDevice final  : public AFortAthenaMutator
{
public:
	TWeakObjectPtr<class ALevelInstanceGameplayVolume> CachedGameplayVolume;                              // 0x0338(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_LevelInstanceDevice">();
	}
	static class AFortAthenaMutator_LevelInstanceDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_LevelInstanceDevice>();
	}
};

// Class CRDLevelInstanceRuntime.LevelInstanceGameplayVolume
// 0x01B8 (0x04E8 - 0x0330)
class ALevelInstanceGameplayVolume final  : public AGameplayVolume
{
public:
	uint8                                         Pad_A56B[0x8];                                     // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnLevelInstanceResolved;                           // 0x0338(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A56C[0x30];                                    // 0x0348(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnDisabledStateChanged;                            // 0x0378(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLevelInstanceGuidChanged;                        // 0x0388(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLevelInstanceNameChanged;                        // 0x0398(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLevelInstanceSizeChanged;                        // 0x03A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLevelInstanceContentCollectionChanged;           // 0x03B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A56D[0x1];                                     // 0x03C8(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEditMode;                                         // 0x03C9(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisabled;                                         // 0x03CA(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESpatialLoadingState                          LoadingState;                                      // 0x03CB(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A56E[0x4];                                     // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LevelInstanceName;                                 // 0x03D0(0x0010)(Net, ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInstanceLoaded;                                   // 0x03E0(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWantsLevelLoaded;                                 // 0x03E1(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A56F[0x1];                                     // 0x03E2(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bConvertStructuresToProps;                         // 0x03E3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A570[0x4];                                     // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          CachedMinigame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMutatorListComponent*              MutatorListComponent;                              // 0x03F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortClassTrackerComponent*             ClassFilterComponent;                              // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UObject>>            BlacklistedClasses;                                // 0x0400(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_A571[0x50];                                    // 0x0410(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  LevelInstanceSaveActorGuid;                        // 0x0460(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortLevelInstanceSaveActor*            LevelInstanceSaveActor;                            // 0x0470(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A572[0x70];                                    // 0x0478(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckForOverlappingVolumes();
	class AFortLevelInstanceSaveActor* CreateLevelInstanceSaveActor();
	void HandleActorHealthChanged(class AActor* Actor, float NewHealth);
	void InstantiateFromLevelInstanceSaveActor();
	void LevelInstanceBeingDestroyed();
	void LevelInstanceContentChanged(class AActor* InstigatorActor);
	void LevelInstanceContentCollectionChanged(class AActor* InstigatorActor, TSoftObjectPtr<class UFortCreativeActorCollection> ContentCollection);
	void LevelInstanceNameChanged(const class FString& Param_Name);
	void LevelInstanceSizeChanged(class AActor* InstigatorActor);
	void OnMinigameStateChanged(class AFortMinigame* Minigame, EFortMinigameState MinigameState);
	void OnRep_EditMode();
	void OnRep_InstanceLoaded();
	void OnRep_IsDisabled();
	void OnVolumeChanged();
	void RemoveActorWhenDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void RemoveActorWhenEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);
	void SetEditMode(bool bInEditMode);
	void SetLevelInstanceActorGuid(const struct FGuid& InLevelInstanceActorGuid);
	void SetLevelInstanceContentCollection(TSoftObjectPtr<class UFortCreativeActorCollection> ContentCollection);
	void SetLevelInstanceName(const class FString& InName);
	void SetReadyForInstantiation(bool bReady);
	void SetWantsLevelLoaded(bool bInWantsLevelLoaded);

	class FString GetLevelInstanceName() const;
	bool IsDisabled() const;
	bool IsInEditMode() const;
	bool IsPreviewActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelInstanceGameplayVolume">();
	}
	static class ALevelInstanceGameplayVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelInstanceGameplayVolume>();
	}
};

// Class CRDLevelInstanceRuntime.LevelInstanceItemListComponent
// 0x0000 (0x0128 - 0x0128)
class ULevelInstanceItemListComponent final  : public UFortMinigameItemContainerComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelInstanceItemListComponent">();
	}
	static class ULevelInstanceItemListComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelInstanceItemListComponent>();
	}
};

}

