#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRDPostProcess

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CRDPostProcess_structs.hpp"


namespace SDK
{

// Class CRDPostProcess.CRDPostProcessDeviceComponent
// 0x0058 (0x00F8 - 0x00A0)
class UCRDPostProcessDeviceComponent final  : public UActorComponent
{
public:
	class UPostProcessComponent*                  PostProcessComponent;                              // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerController*                      BlendInstigator;                                   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A5FD[0x48];                                    // 0x00B0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ApplyPostProcessSettingsToDeviceComponent(class UClass* ActorClass, bool bInEnabled, float InMaxStrength, int32 InPriority, float InEffectDuration, float InBlendInDuration, float InBlendOutDuration);
	void SetCurrentStrength(float Value);
	void SetHiddenStrength(float Value);
	void SetPostProcessEnabled(bool bEnabled);
	void StartBlending(class APlayerController* InBlendInstigator, bool bBlendIn, float Duration);
	void StartBlendingFromPriority(bool bShouldHide, float Duration);
	void StartEffectTimer(class APlayerController* InBlendInstigator);

	float GetBlendInTime() const;
	float GetBlendOutTime() const;
	bool GetClientEnabled() const;
	float GetCurrentStrength() const;
	int32 GetPriority() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CRDPostProcessDeviceComponent">();
	}
	static class UCRDPostProcessDeviceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCRDPostProcessDeviceComponent>();
	}
};

// Class CRDPostProcess.CRDPostProcessDevicePriorityControllerComponent
// 0x0010 (0x00B0 - 0x00A0)
class UCRDPostProcessDevicePriorityControllerComponent final  : public UActorComponent
{
public:
	TArray<class UCRDPostProcessDeviceComponent*> CachedAppliedEffects;                              // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UCRDPostProcessDevicePriorityControllerComponent* GetPostProcessDevicePriorityControllerComponentFromPlayerController(class APlayerController* PC, bool bCreateIfNotFound);

	void CachePostProcessDeviceApplication(class UCRDPostProcessDeviceComponent* InPostProcessDeviceComponent);
	void GetEffectsForPriority(int32 Priority, TArray<class UCRDPostProcessDeviceComponent*>* OutEffects);
	int32 GetHighestPriorityValue();
	void RemovePostProcessDevice(class UCRDPostProcessDeviceComponent* InPostProcessDeviceComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CRDPostProcessDevicePriorityControllerComponent">();
	}
	static class UCRDPostProcessDevicePriorityControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCRDPostProcessDevicePriorityControllerComponent>();
	}
};

// Class CRDPostProcess.CRDPostProcessDeviceControllerComponent
// 0x0190 (0x0230 - 0x00A0)
class UCRDPostProcessDeviceControllerComponent final  : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnPostProcessDeviceMessageRecieved;                // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPostProcessDeviceBlendFinished;                  // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FPostProcessDeviceMessageRingBuffer    PostProcessDeviceMessageBatch;                     // 0x00C0(0x0130)(Net, Transient, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A604[0x8];                                     // 0x01F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPostProcessDeviceMessage>      PostProcessDeviceMessageQueue;                     // 0x01F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A605[0x28];                                    // 0x0208(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void GetMinigamePlayersForPostProcessDevice(class AFortMinigame* FortMinigame, TArray<class APlayerState*>* OutPlayers);
	static class UCRDPostProcessDeviceControllerComponent* GetPostProcessDeviceControllerComponentFromPlayerController(class APlayerController* PC, bool bCreateIfNotFound);

	void AddBlendMessageToQueue(class AFortCreativeDeviceProp* PostProcessDevice, class AFortPlayerState* PlayerStateMessage, EPostProcessDeviceState EndState);
	void OnRep_PostProcessDeviceMessageBatch();
	void Reset();
	void ServerBlendFinished(class AFortCreativeDeviceProp* PostProcessDevice, class APlayerController* Instigator, bool bBlendIn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CRDPostProcessDeviceControllerComponent">();
	}
	static class UCRDPostProcessDeviceControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCRDPostProcessDeviceControllerComponent>();
	}
};

}

