#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeEmporiumUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "CreativeEmporiumUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class CreativeEmporiumUI.EmporiumBrowserFilterEntry
// 0x0060 (0x1500 - 0x14A0)
class UEmporiumBrowserFilterEntry final  : public UCommonButtonBase
{
public:
	FMulticastInlineDelegateProperty_             OnFilterEnabled;                                   // 0x14A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFilterSelected;                                  // 0x14B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnWidgetDestroyed;                                 // 0x14C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCommonTextBlock*                       TextBlock_FilterName;                              // 0x14D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFilterActive;                                     // 0x14D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A64F[0x7];                                     // 0x14D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEmporiumBrowserTag*                    Tag;                                               // 0x14E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ButtonText;                                        // 0x14E8(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A650[0x8];                                     // 0x14F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIsFilterActive(bool bInFilterActive);
	void UpdateButtonText();
	void UpdateCheckMarkState(bool bIsChecked);
	void UpdateItemCount(int32 ItemCount);

	bool IsFilterActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmporiumBrowserFilterEntry">();
	}
	static class UEmporiumBrowserFilterEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmporiumBrowserFilterEntry>();
	}
};

// Class CreativeEmporiumUI.EmporiumBrowserFiltersPanel
// 0x0298 (0x0588 - 0x02F0)
class UEmporiumBrowserFiltersPanel final  : public UCommonUserWidget
{
public:
	FMulticastInlineDelegateProperty_             OnFilterChanged;                                   // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnSortChanged;                                     // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnSortPanelToggled;                                // 0x0310(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFocusChanged;                                    // 0x0320(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCategoryActivated;                               // 0x0330(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCategoryFocused;                                 // 0x0340(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnUpdateCategoryCounts;                            // 0x0350(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A651[0x10];                                    // 0x0360(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortEmporiumFilterCategoryHeader> FilterSectionHeaderWidgetClass;                    // 0x0370(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortEmporiumFilterCategoryHeader> FilterCategoryHeaderWidgetClass;                   // 0x0378(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortEmporiumFilterCategoryHeader> FilterHomeHeaderWidgetClass;                       // 0x0380(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UEmporiumBrowserFilterEntry> FilterEntryWidgetClass;                            // 0x0388(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortEmporiumSortEntry>         SortEntries;                                       // 0x0390(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortEmporiumFilterEntry>       FilterEntries;                                     // 0x03A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortEmporiumPriceFilterEntry>  PriceFilterEntries;                                // 0x03B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           LicenseFilterEntries;                              // 0x03C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   DefaultCategoryFilter;                             // 0x03D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A652[0x54];                                    // 0x03D4(0x0054)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             ScrollBox_FilterScroll;                            // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEmporiumBrowserFilterEntry*            Button_All;                                        // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SortAndFilter;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A653[0x108];                                   // 0x0440(0x0108)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    FocusSearchInputActionRow;                         // 0x0548(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ClearSearchInputActionRow;                         // 0x0558(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CycleSectionsInputActionRow;                       // 0x0568(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A654[0x10];                                    // 0x0578(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExcludeItemDetailTag(class FName& TagID);
	void HandleCategoryActivated(bool bIsExpanded, class UObject* ListItemObject);
	void HandleCategoryExpansion(class UObject* ListItemObject);
	void HandleCategoryWidgetDestroyed(class UObject* ListItemObject);
	void HandleFilterEnabled(bool bIsFilterEnabled, class UObject* ListItemObject);
	void HandleFilterSelected(bool bIsFilterEnabled, class UEmporiumBrowserFilterEntry* Entry);
	void HandleSearchTextChanged(class FText& Text);
	void HandleShowAllEnabled(bool bShowAllItems, class UObject* ListItemObject);
	void HandleSortAndFilterClicked();
	void IncludeItemDetailTag(class FName& TagID);
	class UWidget* NavigateToNextSection(bool bReverse);
	void OnSetSearchFocused();
	void OnSetSearchText(class FText& NewSearchText);
	void OnSetSearchVisible(bool bVisible);
	void SetItemDetailTags(TArray<class FName>& TagIDs);

	int32 GetFilterCount() const;
	int32 GetNumFilterSectionWidgets() const;
	bool IsInFocusPath() const;
	bool IsShowingCategoryModal() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmporiumBrowserFiltersPanel">();
	}
	static class UEmporiumBrowserFiltersPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmporiumBrowserFiltersPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumFilterCategoryHeader
// 0x0038 (0x0300 - 0x02C8)
class UFortEmporiumFilterCategoryHeader final  : public UUserWidget
{
public:
	FMulticastInlineDelegateProperty_             OnCategoryActivated;                               // 0x02C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnWidgetDestroyed;                                 // 0x02D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnExpandCategory;                                  // 0x02E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UEmporiumBrowserTag*                    Tag;                                               // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ActivateCategory(bool bExpanded);
	void AddSubcategoryWidget(class UWidget* SubcategoryWidget);
	void ClearSubcategoryWidgets();
	void EnableCategoryExpansion(bool bShow);
	void ExpandCategory(bool bExpanded);
	void ExpandSection();
	void SetCategoryText(class FText& NewButtonText);
	void SetCycleSectionIcon(const struct FSlateBrush& CycleSectionIcon);
	void SetSubcategoryCount(int32 NewCount);
	void ShowCategoryActive(bool bIsActive);
	void ShowCycleSectionPrompt(bool bShow);
	void ShowUpperSpacer(bool bShow);
	void UpdateCategoryCount(int32 NewCount, bool bHideIfEmpty);

	class UCommonButtonBase* GetCategoryButton() const;
	TArray<class UWidget*> GetSubcategoryWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumFilterCategoryHeader">();
	}
	static class UFortEmporiumFilterCategoryHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumFilterCategoryHeader>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumFiltersSubPanel
// 0x0030 (0x02F8 - 0x02C8)
class UFortEmporiumFiltersSubPanel final  : public UUserWidget
{
public:
	FMulticastInlineDelegateProperty_             OnFilterEnabled;                                   // 0x02C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnShowAllEnabled;                                  // 0x02D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UEmporiumBrowserFilterEntry> FilterEntryWidgetClass;                            // 0x02E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEmporiumBrowserFilterEntry*            Button_All;                                        // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClearFilterWidgets();
	void HandleFilterEnabled(bool bIsFilterEnabled, class UObject* ListItemObject);
	void HandleFilterSelected(bool bIsFilterEnabled, class UEmporiumBrowserFilterEntry* Entry);
	void HandleShowAllEnabled(bool bShowAllItems, class UObject* ListItemObject);
	void OnAddSubcategoryWidget(class UEmporiumBrowserFilterEntry* SubcategoryWidget);
	void OnFilterSelected(class UEmporiumBrowserFilterEntry* SubcategoryWidget);
	void OnUpdateFilterEntries(TArray<class FName>& IncludedTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumFiltersSubPanel">();
	}
	static class UFortEmporiumFiltersSubPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumFiltersSubPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeEntryObjectWrapper
// 0x0008 (0x0030 - 0x0028)
class UFortEmporiumHomeEntryObjectWrapper final  : public UObject
{
public:
	class UFortEmporiumItemListTabPanel*          TabPanel;                                          // 0x0028(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeEntryObjectWrapper">();
	}
	static class UFortEmporiumHomeEntryObjectWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeEntryObjectWrapper>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeListEntry
// 0x01F8 (0x04C0 - 0x02C8)
class UFortEmporiumHomeListEntry final  : public UUserWidget
{
public:
	uint8                                         Pad_A65E[0x8];                                     // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumHomeListView*              ParentView;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A65F[0x30];                                    // 0x02D8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxItemsToShow;                                    // 0x0308(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A660[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumItemListTabPanel*          TabPanel;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_CategoryLabel;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCreativeItemTileView*            HomeListView_ItemOptions;                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A661[0x198];                                   // 0x0328(0x0198)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateWarningMessage(bool bShowMessage);

	EFortItemCardSize GetCardSizeForCategory() const;
	bool GetCollapseBorderPadFlagForCategory() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeListEntry">();
	}
	static class UFortEmporiumHomeListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeListEntry>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeListView
// 0x0250 (0x0E20 - 0x0BD0)
class UFortEmporiumHomeListView final  : public UCommonListView
{
public:
	uint8                                         Pad_A662[0x98];                                    // 0x0BD0(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortEmporiumItemListTabPanel*>  TabPanelList;                                      // 0x0C68(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A663[0x1A8];                                   // 0x0C78(0x01A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* GetFocusWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeListView">();
	}
	static class UFortEmporiumHomeListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeListView>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumHomeTabPanel
// 0x0040 (0x0488 - 0x0448)
class UFortEmporiumHomeTabPanel final  : public UFortCreativeContentBrowserTabPanelBase
{
public:
	uint8                                         Pad_A664[0x30];                                    // 0x0448(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FeaturedItemTag;                                   // 0x0478(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A665[0x4];                                     // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumHomeListView*              FortEmporiumHomeListView_Options;                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumHomeTabPanel">();
	}
	static class UFortEmporiumHomeTabPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumHomeTabPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItem
// 0x0008 (0x00A8 - 0x00A0)
class UFortEmporiumItem final  : public UFortItem
{
public:
	class UFortEmporiumItemDefinition*            ItemDefinition;                                    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItem">();
	}
	static class UFortEmporiumItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItem>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemDefinition
// 0x0108 (0x0288 - 0x0180)
class UFortEmporiumItemDefinition final  : public UFortItemDefinition
{
public:
	uint8                                         Pad_A666[0x8];                                     // 0x0180(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnItemThumbnailDownloaded;                         // 0x0188(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A667[0xF0];                                    // 0x0198(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const struct FFortEmporiumItemData GetEmporiumItemData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemDefinition">();
	}
	static class UFortEmporiumItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemDefinition>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemDetailsPanel
// 0x0068 (0x0358 - 0x02F0)
class UFortEmporiumItemDetailsPanel final  : public UCommonUserWidget
{
public:
	uint8                                         Pad_A668[0x30];                                    // 0x02F0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ItemDetailTagsInputRowHandle;                      // 0x0320(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A669[0x8];                                     // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemDefinitionBase*                    CachedItemDefinition;                              // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_Details;                                  // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortEmporiumItemInfo*                  ItemDetails;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemDetailsHostPanel*              LegacyItemDetails;                                 // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleItemTagSelected(class FName TagID, bool bSelected);
	void HideAdditionalButtons();
	void HideExtendedDataPanel();
	bool IsShowingAdditionalButtons();
	void SetActiveItemDetailTags(TArray<class FName>& ActiveTags);
	void SetItemDetails(class UFortItem* FortItem, bool bUseLargeThumbnail, bool bAllowInteractiveTags);
	void SetItemToDetail(class UFortItem* InItemToDetail, bool bUseLargeThumbnail, bool bAllowInteractiveTags);
	void SetSpecialItemTagVisibility(class FName& SpecialItemTag);
	void ShowExtendedDataPanel();
	void ToggleItemDetailsPanel();
	void UpdateItemDetailsDisplay(bool bShowItemDetails);

	TArray<class FName> BP_GetSpecialItemTags() const;
	bool HasLegacyItemDetailsPanel() const;
	bool IsShowingExtendedDataPanel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemDetailsPanel">();
	}
	static class UFortEmporiumItemDetailsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemDetailsPanel>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemInfo
// 0x0010 (0x0300 - 0x02F0)
class UFortEmporiumItemInfo final  : public UCommonUserWidget
{
public:
	TArray<class FName>                           HiddenTags;                                        // 0x02F0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void SetSelectItemTagsIcon(const struct FSlateBrush& SelectItemTagsIcon);
	void SetSelectItemTagsPrompt(class FText& Prompt);
	void SetTagFocus();
	void ShowSelectItemTagsPrompt(bool bShowPrompt);
	void UpdateWithFortItem(class UFortItem* Item, bool bAllowInteractiveTags);

	bool HasFocusableTags() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemInfo">();
	}
	static class UFortEmporiumItemInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemInfo>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumCategoryEntry
// 0x0020 (0x0048 - 0x0028)
class UFortEmporiumCategoryEntry final  : public UObject
{
public:
	class FString                                 Path;                                              // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumCategoryEntry">();
	}
	static class UFortEmporiumCategoryEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumCategoryEntry>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemListMenu
// 0x0598 (0x09A0 - 0x0408)
class UFortEmporiumItemListMenu final  : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_A66E[0x30];                                    // 0x0408(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCreativeItemListPanelData> PanelDataClass;                                    // 0x0438(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             ItemListCategorySource;                            // 0x0440(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortCreativeItemListPanelData*         ItemListPanelData;                                 // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortEmporiumItemListTabPanel> InventoryTabClass;                                 // 0x0450(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortCreativeLevelManagementTabPanel> LevelManagementTabClass;                           // 0x0458(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortEmporiumHomeTabPanel>  HomeTabClass;                                      // 0x0460(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonButtonBase>          InventoryTabButton;                                // 0x0468(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class FText>                Map_CreativeBetaTagNames;                          // 0x0470(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleItemDetailsInputActionRow;                   // 0x04C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UFortEmporiumItemListTabPanel*          ChestTabPanel;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeLevelManagementTabPanel*   LevelManagementTabPanel;                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumHomeTabPanel*              HomeTabPanel;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemListTabPanel*          FabTabPanel;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemListTabPanel*          SubItemsTabPanel;                                  // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FabTabNameId;                                      // 0x04F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A66F[0x4];                                     // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0500(0x0100)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FAthenaMapScreenContainerTabInfo       MapScreenContainerTabInfo;                         // 0x0600(0x0040)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bIsDefaultActiveTab;                               // 0x0640(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAddItemToInventoryOnEquip;                        // 0x0641(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLoadItemsOnInitialized;                           // 0x0642(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A670[0x1];                                     // 0x0643(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastUsedSlot;                                      // 0x0644(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A671[0x8];                                     // 0x0648(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UFortCreativeContentBrowserTabPanelBase*> TabMap;                                            // 0x0650(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A672[0x1B8];                                   // 0x06A0(0x01B8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortEmporiumItemDefinition*>    EmporiumItemDefinitionList;                        // 0x0858(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A673[0x18];                                    // 0x0868(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonVisibilitySwitcher*              Switcher_SidePanels;                               // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonAnimatedSwitcher*                Switcher_Categories;                               // 0x0888(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        Switcher_ItemTabWarnings;                          // 0x0890(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_ChestEmpty;                                // 0x0898(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_TabEmpty;                                  // 0x08A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_DownloadingFabCategories;                  // 0x08A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_FabCategoriesNotLoaded;                    // 0x08B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        Switcher_CommandBar;                               // 0x08B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_ChestCommands;                             // 0x08C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_VendCommands;                              // 0x08C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCreativeMenuQuickbar*              MenuQuickbar_QuickBars;                            // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ResetChest;                                 // 0x08D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CreateChest;                                // 0x08E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_AddToQuickBar;                              // 0x08E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_OpenItem;                                   // 0x08F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PlaceNow;                                   // 0x08F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Equip;                                      // 0x0900(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_AddToChest;                                 // 0x0908(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Drop;                                       // 0x0910(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CreateLlama;                                // 0x0918(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_RemoveFromChest;                            // 0x0920(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_SearchFilters;                             // 0x0928(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonAnimatedSwitcher*                Switcher_LeftPanel;                                // 0x0930(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEmporiumBrowserFiltersPanel*           FiltersPanel;                                      // 0x0938(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumFiltersSubPanel*           FiltersSubPanel;                                   // 0x0940(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemDetailsPanel*          SubTabItemDetailsPanel;                            // 0x0948(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationPickerSortAndFilterBlade* Blade_SortAndFilter;                               // 0x0950(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemDetailsPanel*          ItemDetailsSidePanel_DefaultSidePanel;             // 0x0958(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_ProductPage;                              // 0x0960(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_ItemBrowser;                               // 0x0968(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEmporiumItemDetailsPanel*          ItemProductPagePanel;                              // 0x0970(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                        Switcher_InventoryPermission;                      // 0x0978(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_EmporiumPanel;                             // 0x0980(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_InventoryNotAllowed;                       // 0x0988(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_EditorDisconnected;                        // 0x0990(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_InitializingInventory;                     // 0x0998(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	bool AddSelectionToQuickBar();
	bool DropItem(struct FFortItemEntry& SelectedItem);
	bool EquipItem(struct FFortItemEntry& ItemEntry);
	bool EquipSelection();
	void HandleAddSelectionToMoveToolComplete();
	void HandleCategoryActivated(class FName CategoryID);
	void HandleCategoryFocused(class FName CategoryID);
	void HandleChestItemCountChanged(int32 Count);
	void HandleEquipItem(struct FFortItemEntry& ItemEntry);
	void HandleFilterButtonClicked(class FName FilterNameId, class UCommonButtonBase* NewButton);
	void HandleFilterChanged();
	void HandleFilterPanelIsFocused(bool bIsFocused);
	void HandleGlobalSortPanelToggle();
	void HandleItemClicked(struct FFortItemEntry& ItemEntry);
	void HandleItemDoubleClicked(struct FFortItemEntry& ItemEntry);
	void HandleItemTagSelected(class FName& TagID, bool bSelected);
	void HandleItemThumbnailDownloaded(class UFortEmporiumItemDefinition* ItemDefinition);
	void HandleModalHitBlockerClicked();
	void HandleQuickbarPanelIsFocused(bool bIsFocused);
	void HandleQuickbarStateChanged(EFortContentBrowserQuickbarState State);
	void HandleSelectionChanged(class UFortCreativeContentBrowserTabPanelBase* Tab);
	void HandleSortButtonClicked(class FName SortNameId, class UCommonButtonBase* NewButton);
	void HandleSortChanged();
	void HandleSubFilterEnabled(bool bIsFilterEnabled, class UObject* ListItemObject);
	void HandleSubFilterShowAllEnabled(bool bIsFilterEnabled, class UObject* ListItemObject);
	void HandleTabItemDetailClicked(class FName& TagID);
	void HandleTabSelected(class FName TabID, bool bCaptureFocus);
	void HandleTabSortButtonClicked();
	void HandleUpdateCategoryCounts();
	void InitializeFabTab();
	void InitializeTabs();
	void LoadFabItems();
	void NativeOnBuiltInItemsLoaded();
	void NativeOnItemsLoaded();
	void NativeOnItemsRefreshed();
	void OnBuiltInItemsLoaded();
	void OnContentRatingFilterChanged();
	void OnCreativeQuickbarComponentLoaded();
	void OnExitSubTab();
	void OnFabCategoryListLoaded(bool bSuccess, const class FString& JsonString);
	void OnFabItemQueryComplete(bool bSuccess, const class FString& JsonString);
	void OnItemEquipped(struct FFortItemEntry& EquippedItemEntry);
	void OnItemsLoaded();
	void OnQuickbarStateChanged(EFortContentBrowserQuickbarState State);
	void OnSearchFiltersVisibilityChanged(bool bIsVisible);
	void OnSelectionOpened(class UItemDefinitionBase* SelectedItemDefinition);
	void OnSetPanelLayout(EFortEmporiumLayoutVersion LayoutVersion);
	void OnShowCategoryModal(bool bShowModal);
	void OnToggleItemDetails();
	void OnUpdateCategoryLabel(class FText& SectionLabel, class FText& CategoryLabel);
	void OnUpdateCommandBarVisibility(bool bShowBar);
	bool OpenSelection();
	bool PlaceSelectionInMoveTool();
	void RefreshTabWarningState();
	void SetIsItemCommandsEnabled(bool bInIsItemCommandEnabled);
	void SetSubTabOpened(class UItemDefinitionBase* ItemDefinition);
	void SpawnContainer(TSubclassOf<class AActor> SupplyDropClass);
	void SwitchItemDetailsPanel(bool bUseLegacy);
	void UpdateBackButtonText(bool bFilterFocus);
	void UpdateDetailsPanel();
	void UpdatePermissionsDisplay();

	bool CanAddToChest(struct FFortItemEntry& SelectedItem) const;
	bool CanDropItem(struct FFortItemEntry& SelectedItem) const;
	bool CanEquip(struct FFortItemEntry& SelectedItem) const;
	struct FFortItemEntry GetCurrentSelection() const;
	class UFortCreativeContentBrowserTabPanelBase* GetCurrentTab() const;
	class FName GetLastSelectedTabName() const;
	class UItemDefinitionBase* GetSubTabSelectedItemDefinition() const;
	bool IsSubTabOpened() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemListMenu">();
	}
	static class UFortEmporiumItemListMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemListMenu>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumItemListTabPanel
// 0x03F8 (0x0840 - 0x0448)
class UFortEmporiumItemListTabPanel final  : public UFortCreativeContentBrowserTabPanelBase
{
public:
	uint8                                         Pad_A681[0x8];                                     // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSourceItemCountChanged;                          // 0x0450(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnItemClickedDelegate;                             // 0x0460(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnItemDoubleClickedDelegate;                       // 0x0470(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A682[0x30];                                    // 0x0480(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCreativeItemTileView*            CreativeTileView_ItemOptions;                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Sort;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortItemEntry                         CurrentItemEntry;                                  // 0x04C0(0x0198)(BlueprintVisible, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             OnItemCountChanged;                                // 0x0658(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TArray<struct FFortItemEntry>                 Items;                                             // 0x0668(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FFortItemEntry>                 SourceItems;                                       // 0x0678(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A683[0x1A0];                                   // 0x0688(0x01A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortEmporiumItemListMenu*              EmporiumItemListMenuParent;                        // 0x0828(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A684[0x10];                                    // 0x0830(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddItem(struct FFortItemEntry& ItemToAdd);
	void AddItemToSource(struct FFortItemEntry& ItemToAdd);
	void ClearAllItems();
	void ClearFilteredItems();
	void FocusCurrentSelection();
	void HandleItemDetailTagSelected(class FName& TagID);
	bool IsEmpty();
	void ItemEquipped(struct FFortItemEntry& Item);
	void OnSetPanelLayout(EFortEmporiumLayoutVersion LayoutVersion);
	void RemoveSelectedItem();
	void RestoreLastSelection();
	void SetActiveItemDetailTags(TArray<class FName>& TagIDs);
	void ShowTopButtonBar(bool bShow);
	void UpdateSortButton(class FText& SortType);
	void UpdateTabHeader();

	bool CanPlayerCreateInVolume() const;
	EFortItemCardSize GetCardSizeForCategory() const;
	bool GetCollapseBorderPadFlagForCategory() const;
	class UItemDefinitionBase* GetSubTabSelectedItemDefinition() const;
	bool IsSubTabOpened() const;
	bool ShowLegacyItemDetailsPanel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEmporiumItemListTabPanel">();
	}
	static class UFortEmporiumItemListTabPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEmporiumItemListTabPanel>();
	}
};

// Class CreativeEmporiumUI.EmporiumBrowserTag
// 0x0008 (0x0030 - 0x0028)
class UEmporiumBrowserTag final  : public UObject
{
public:
	class FName                                   TagID;                                             // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A685[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmporiumBrowserTag">();
	}
	static class UEmporiumBrowserTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmporiumBrowserTag>();
	}
};

// Class CreativeEmporiumUI.FortEmporiumUtilities
// 0x0000 (0x0028 - 0x0028)
class UFortEmporiumUtilities final  : public UBlueprintFunctionLibrary
{
public:
	static const class FText GetCategoryDisplayName(class FName& CategoryID);
	static TArray<class FName> GetCreativeTagIDs(class UItemDefinitionBase* ItemDefinition);
	static class FText GetCreativeTagLabel(class FName& TagID, bool* bOutIsBeta);
	static class FName GetShowAllButtonID();
	static const class FText GetTextFromEmporiumLicense(EFortEmporiumItemLicense License);
