#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeQuickOptionsTab

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// Class CreativeQuickOptionsTab.FortCreativeQuickOptionsTab
// 0x0188 (0x0590 - 0x0408)
class UFortCreativeQuickOptionsTab final  : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_A690[0x30];                                    // 0x0408(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaMapScreenContainerTabInfo       MapScreenContainerTabInfo;                         // 0x0438(0x0040)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FName                                   QuickOptionsTabNameId;                             // 0x0478(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A691[0x4];                                     // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0480(0x0100)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bIsDefaultActiveTab;                               // 0x0580(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A692[0xF];                                     // 0x0581(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCreativeQuickOptionsTab">();
	}
	static class UFortCreativeQuickOptionsTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCreativeQuickOptionsTab>();
	}
};

}

