#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizableObject

#include "Basic.hpp"

#include "MutableRuntime_structs.hpp"
#include "ClothingSystemRuntimeCommon_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Enum CustomizableObject.EPackageSaveResolutionType
// NumValues: 0x0005
enum class EPackageSaveResolutionType : uint8
{
	None                                     = 0,
	NewFile                                  = 1,
	Overriden                                = 2,
	UnableToOverride                         = 3,
	EPackageSaveResolutionType_MAX           = 4,
};

// Enum CustomizableObject.EUpdateResult
// NumValues: 0x0008
enum class EUpdateResult : uint8
{
	Success                                  = 0,
	Warning                                  = 1,
	Error                                    = 2,
	ErrorOptimized                           = 3,
	ErrorReplaced                            = 4,
	ErrorDiscarded                           = 5,
	Error16BitBoneIndex                      = 6,
	EUpdateResult_MAX                        = 7,
};

// Enum CustomizableObject.EMutableParameterType
// NumValues: 0x0008
enum class EMutableParameterType : uint8
{
	None                                     = 0,
	Bool                                     = 1,
	Int                                      = 2,
	Float                                    = 3,
	Color                                    = 4,
	Projector                                = 5,
	Texture                                  = 6,
	EMutableParameterType_MAX                = 7,
};

// Enum CustomizableObject.ECustomizableObjectGroupType
// NumValues: 0x0005
enum class ECustomizableObjectGroupType : uint8
{
	COGT_TOGGLE                              = 0,
	COGT_ALL                                 = 1,
	COGT_ONE                                 = 2,
	COGT_ONE_OR_NONE                         = 3,
	COGT_MAX                                 = 4,
};

// Enum CustomizableObject.EMutableCompileMeshType
// NumValues: 0x0006
enum class EMutableCompileMeshType : uint8
{
	Full                                     = 0,
	Local                                    = 1,
	LocalAndChildren                         = 2,
	AddWorkingSetNoChildren                  = 3,
	AddWorkingSetAndChildren                 = 4,
	EMutableCompileMeshType_MAX              = 5,
};

// Enum CustomizableObject.ECustomizableObjectProjectorType
// NumValues: 0x0004
enum class ECustomizableObjectProjectorType : uint8
{
	Planar                                   = 0,
	Cylindrical                              = 1,
	Wrapping                                 = 2,
	ECustomizableObjectProjectorType_MAX     = 3,
};

// Enum CustomizableObject.ECustomizableObjectCompilationState
// NumValues: 0x0005
enum class ECustomizableObjectCompilationState : uint8
{
	None                                     = 0,
	InProgress                               = 1,
	Completed                                = 2,
	Failed                                   = 3,
	ECustomizableObjectCompilationState_MAX  = 4,
};

// Enum CustomizableObject.ECOResourceDataType
// NumValues: 0x0003
enum class ECOResourceDataType : uint16
{
	None                                     = 0,
	AssetUserData                            = 1,
	ECOResourceDataType_MAX                  = 2,
};

// Enum CustomizableObject.ECustomizableObjectNumBoneInfluences
// NumValues: 0x0004
enum class ECustomizableObjectNumBoneInfluences : uint8
{
	Four                                     = 4,
	Eight                                    = 8,
	Twelve                                   = 12,
	ECustomizableObjectNumBoneInfluences_MAX = 13,
};

// Enum CustomizableObject.ECustomizableObjectTextureCompression
// NumValues: 0x0004
enum class ECustomizableObjectTextureCompression : uint8
{
	None                                     = 0,
	Fast                                     = 1,
	HighQuality                              = 2,
	ECustomizableObjectTextureCompression_MAX = 3,
};

// ScriptStruct CustomizableObject.GeneratedTexture
// 0x0028 (0x0028 - 0x0000)
struct FGeneratedTexture final 
{
public:
	uint8                                         Pad_249E[0x10];                                    // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Texture;                                           // 0x0020(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.GeneratedMaterial
// 0x0020 (0x0020 - 0x0000)
struct FGeneratedMaterial final 
{
public:
	class UMaterialInterface*                     MaterialInterface;                                 // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGeneratedTexture>              Textures;                                          // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_249F[0x8];                                     // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.BakedResourceData
// 0x0018 (0x0018 - 0x0000)
struct FBakedResourceData final 
{
public:
	EPackageSaveResolutionType                    SaveType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24A0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AssetPath;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectInstanceBakeOutput
// 0x0018 (0x0018 - 0x0000)
struct FCustomizableObjectInstanceBakeOutput final 
{
public:
	bool                                          bWasBakeSuccessful;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24A1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBakedResourceData>             SavedPackages;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.UpdateContext
// 0x0001 (0x0001 - 0x0000)
struct FUpdateContext final 
{
public:
	EUpdateResult                                 UpdateResult;                                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.ReferencedPhysicsAssets
// 0x0040 (0x0040 - 0x0000)
struct FReferencedPhysicsAssets final 
{
public:
	uint8                                         Pad_24A2[0x10];                                    // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicsAsset*>                  PhysicsAssetsToMerge;                              // 0x0010(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_24A3[0x10];                                    // 0x0020(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicsAsset*>                  AdditionalPhysicsAssets;                           // 0x0030(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectClothConfigData
// 0x0028 (0x0028 - 0x0000)
struct FCustomizableObjectClothConfigData final 
{
public:
	class FString                                 ClassPath;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ConfigName;                                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24A4[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 ConfigBytes;                                       // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectClothingAssetData
// 0x0080 (0x0080 - 0x0000)
struct FCustomizableObjectClothingAssetData final 
{
public:
	TArray<struct FClothLODDataCommon>            LODData;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 LodMap;                                            // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           UsedBoneNames;                                     // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 UsedBoneIndices;                                   // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReferenceBoneIndex;                                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24A5[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCustomizableObjectClothConfigData> ConfigsData;                                       // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 PhysicsAssetPath;                                  // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OriginalAssetGuid;                                 // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24A6[0x4];                                     // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.ReferencedSkeletons
// 0x0028 (0x0028 - 0x0000)
struct FReferencedSkeletons final 
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint16>                                SkeletonIds;                                       // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class USkeleton*>                      SkeletonsToMerge;                                  // 0x0018(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableInstanceComponentData
// 0x0148 (0x0148 - 0x0000)
struct FCustomizableInstanceComponentData final 
{
public:
	TMap<class FName, TSoftClassPtr<class UClass>> AnimSlotToBP;                                      // 0x0000(0x0050)(Edit, EditFixedSize, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	TSet<class UAssetUserData*>                   AssetUserDataArray;                                // 0x0050(0x0050)(Edit, ExportObject, EditFixedSize, Transient, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_24A7[0x10];                                    // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReferencedSkeletons                   Skeletons;                                         // 0x00B0(0x0028)(Transient, NativeAccessSpecifierPublic)
	struct FReferencedPhysicsAssets               PhysicsAssets;                                     // 0x00D8(0x0040)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_24A8[0x20];                                    // 0x0118(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             OverrideMaterials;                                 // 0x0138(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.AnimInstanceOverridePhysicsAsset
// 0x0010 (0x0010 - 0x0000)
struct FAnimInstanceOverridePhysicsAsset final 
{
public:
	int32                                         PropertyIndex;                                     // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24A9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.AnimBpGeneratedPhysicsAssets
// 0x0010 (0x0010 - 0x0000)
struct FAnimBpGeneratedPhysicsAssets final 
{
public:
	TArray<struct FAnimInstanceOverridePhysicsAsset> AnimInstancePropertyIndexAndPhysicsAssets;         // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectBoolParameterValue
// 0x0028 (0x0028 - 0x0000)
struct FCustomizableObjectBoolParameterValue final 
{
public:
	class FString                                 ParameterName;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ParameterValue;                                    // 0x0010(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24AA[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  ID;                                                // 0x0014(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24AB[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.CustomizableObjectIntParameterValue
// 0x0040 (0x0040 - 0x0000)
struct FCustomizableObjectIntParameterValue final 
{
public:
	class FString                                 ParameterName;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterValueName;                                // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ParameterRangeValueNames;                          // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectFloatParameterValue
// 0x0038 (0x0038 - 0x0000)
struct FCustomizableObjectFloatParameterValue final 
{
public:
	class FString                                 ParameterName;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ParameterValue;                                    // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0014(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24AC[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ParameterRangeValues;                              // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectTextureParameterValue
// 0x0038 (0x0038 - 0x0000)
struct FCustomizableObjectTextureParameterValue final 
{
public:
	class FString                                 ParameterName;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterValue;                                    // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0014(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24AD[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ParameterRangeValues;                              // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectVectorParameterValue
// 0x0030 (0x0030 - 0x0000)
struct FCustomizableObjectVectorParameterValue final 
{
public:
	class FString                                 ParameterName;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ParameterValue;                                    // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectProjector
// 0x0038 (0x0038 - 0x0000)
struct FCustomizableObjectProjector final 
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Direction;                                         // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Up;                                                // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Scale;                                             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECustomizableObjectProjectorType              ProjectionType;                                    // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24AE[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Angle;                                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectProjectorParameterValue
// 0x0068 (0x0068 - 0x0000)
struct FCustomizableObjectProjectorParameterValue final 
{
public:
	class FString                                 ParameterName;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCustomizableObjectProjector           Value;                                             // 0x0010(0x0038)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectProjector>   RangeValues;                                       // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.MutableRemappedBone
// 0x0008 (0x0008 - 0x0000)
struct FMutableRemappedBone final 
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Hash;                                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.MutableModelParameterValue
// 0x0018 (0x0018 - 0x0000)
struct FMutableModelParameterValue final 
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24AF[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.MutableModelParameterProperties
// 0x0028 (0x0028 - 0x0000)
struct FMutableModelParameterProperties final 
{
public:
	uint8                                         Pad_24B0[0x10];                                    // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EMutableParameterType                         Type;                                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24B1[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMutableModelParameterValue>    PossibleValues;                                    // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.MutableModelImageProperties
// 0x0020 (0x0020 - 0x0000)
struct FMutableModelImageProperties final 
{
public:
	class FString                                 TextureParameterName;                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureFilter                                Filter;                                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24B2[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         SRGB : 1;                                          // 0x0014(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         FlipGreenChannel : 1;                              // 0x0014(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         IsPassThrough : 1;                                 // 0x0014(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_24B3[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LODBias;                                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureGroup                                 LODGroup;                                          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressX;                                          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressY;                                          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24B4[0x1];                                     // 0x001F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.MutableRefSocket
// 0x0058 (0x0058 - 0x0000)
struct FMutableRefSocket final 
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RelativeLocation;                                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRotation;                                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                RelativeScale;                                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceAlwaysAnimated;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24B5[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority;                                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.MutableRefLODInfo
// 0x000C (0x000C - 0x0000)
struct FMutableRefLODInfo final 
{
public:
	float                                         ScreenSize;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LODHysteresis;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportUniformlyDistributedSampling;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowCPUAccess;                                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24B6[0x2];                                     // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.MutableRefLODRenderData
// 0x0002 (0x0002 - 0x0000)
struct FMutableRefLODRenderData final 
{
public:
	bool                                          bIsLODOptional;                                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStreamedDataInlined;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.MutableRefLODData
// 0x0010 (0x0010 - 0x0000)
struct FMutableRefLODData final 
{
public:
	struct FMutableRefLODInfo                     LODInfo;                                           // 0x0000(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMutableRefLODRenderData               RenderData;                                        // 0x000C(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24B7[0x2];                                     // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.MutableRefSkeletalMeshSettings
// 0x0008 (0x0008 - 0x0000)
struct FMutableRefSkeletalMeshSettings final 
{
public:
	bool                                          bEnablePerPolyCollision;                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24B8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultUVChannelDensity;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.MutableRefAssetUserData
// 0x0008 (0x0008 - 0x0000)
struct FMutableRefAssetUserData final 
{
public:
	class UCustomizableObjectResourceDataContainer* AssetUserData;                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.MutableRefSkeletalMeshData
// 0x00D0 (0x00D0 - 0x0000)
struct FMutableRefSkeletalMeshData final 
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>           SoftSkeletalMesh;                                  // 0x0008(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMutableRefLODData>             LODData;                                           // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMutableRefSocket>              Sockets;                                           // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       Bounds;                                            // 0x0048(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMutableRefSkeletalMeshSettings        Settings;                                          // 0x0080(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	class USkeleton*                              Skeleton;                                          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   PostProcessAnimInst;                               // 0x0098(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                          ShadowPhysicsAsset;                                // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMutableRefAssetUserData>       AssetUserData;                                     // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.AnimBpOverridePhysicsAssetsInfo
// 0x0048 (0x0048 - 0x0000)
struct FAnimBpOverridePhysicsAssetsInfo final 
{
public:
	TSoftClassPtr<class UClass>                   AnimInstanceClass;                                 // 0x0000(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UPhysicsAsset>           SourceAsset;                                       // 0x0020(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropertyIndex;                                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24B9[0x4];                                     // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.MutableSkinWeightProfileInfo
// 0x000C (0x000C - 0x0000)
struct FMutableSkinWeightProfileInfo final 
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NameId;                                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DefaultProfile;                                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          DefaultProfileFromLODIndex;                        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24BA[0x2];                                     // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.MutableStreamableBlock
// 0x0010 (0x0010 - 0x0000)
struct FMutableStreamableBlock final 
{
public:
	uint32                                        FileId;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Size;                                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Offset;                                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.RealTimeMorphStreamable
// 0x0020 (0x0020 - 0x0000)
struct FRealTimeMorphStreamable final 
{
public:
	TArray<class FName>                           NameResolutionMap;                                 // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FMutableStreamableBlock                bLock;                                             // 0x0010(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.MorphTargetVertexData
// 0x001C (0x001C - 0x0000)
struct FMorphTargetVertexData final 
{
public:
	struct FVector3f                              PositionDelta;                                     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              TangentZDelta;                                     // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MorphNameIndex;                                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.MutableParamUIMetadata
// 0x00F0 (0x00F0 - 0x0000)
struct FMutableParamUIMetadata final 
{
public:
	class FString                                 ObjectFriendlyName;                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UISectionName;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UIOrder;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24BB[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              UIThumbnail;                                       // 0x0028(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ExtraInformation;                                  // 0x0048(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, TSoftObjectPtr<class UObject>> ExtraAssets;                                       // 0x0098(0x0050)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         MinimumValue;                                      // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumValue;                                      // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.IntegerParameterUIData
// 0x0100 (0x0100 - 0x0000)
struct FIntegerParameterUIData final 
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMutableParamUIMetadata                ParamUIMetadata;                                   // 0x0010(0x00F0)(BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.ParameterUIData
// 0x0170 (0x0170 - 0x0000)
struct FParameterUIData final 
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMutableParamUIMetadata                ParamUIMetadata;                                   // 0x0010(0x00F0)(BlueprintVisible, NativeAccessSpecifierPublic)
	EMutableParameterType                         Type;                                              // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24BC[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIntegerParameterUIData>        ArrayIntegerParameterOption;                       // 0x0108(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	ECustomizableObjectGroupType                  IntegerParameterGroupType;                         // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureCompressionStrategy                   TextureCompressionStrategy;                        // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableTextureStreaming;                          // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLiveUpdateMode;                                   // 0x011B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseInstanceTextures;                            // 0x011C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24BD[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            ForcedParameterValues;                             // 0x0120(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.ModelResources
// 0x0248 (0x0248 - 0x0000)
struct FModelResources final 
{
public:
	TArray<struct FMutableRefSkeletalMeshData>    ReferenceSkeletalMeshesData;                       // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class USkeleton>>       Skeletons;                                         // 0x0010(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMaterialInterface>> Materials;                                         // 0x0020(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UTexture>>        PassThroughTextures;                               // 0x0030(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UPhysicsAsset>>   PhysicsAssets;                                     // 0x0040(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           AnimBPs;                                           // 0x0050(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FAnimBpOverridePhysicsAssetsInfo> AnimBpOverridePhysiscAssetsInfo;                   // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           MaterialSlotNames;                                 // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, uint32>                   BoneNamesMap;                                      // 0x0080(0x0050)(NativeAccessSpecifierPublic)
	TArray<struct FMutableRefSocket>              SocketArray;                                       // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMutableSkinWeightProfileInfo>  SkinWeightProfilesInfo;                            // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMutableModelImageProperties>   ImageProperties;                                   // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, struct FParameterUIData>  ParameterUIDataMap;                                // 0x0100(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, struct FParameterUIData>  StateUIDataMap;                                    // 0x0150(0x0050)(NativeAccessSpecifierPublic)
	TMap<uint32, struct FRealTimeMorphStreamable> RealTimeMorphStreamables;                          // 0x01A0(0x0050)(NativeAccessSpecifierPublic)
	TMap<uint64, struct FMutableStreamableBlock>  HashToStreamableBlock;                             // 0x01F0(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         NumComponents;                                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumLODs;                                           // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumLODsToStream;                                   // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         FirstLODAvailable;                                 // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24BE[0x4];                                     // 0x0244(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.CustomizableObjectResourceData
// 0x0018 (0x0018 - 0x0000)
struct FCustomizableObjectResourceData final 
{
public:
	ECOResourceDataType                           Type;                                              // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24BF[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       Data;                                              // 0x0008(0x0010)(NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectAssetUserData
// 0x0008 (0x0008 - 0x0000)
struct FCustomizableObjectAssetUserData final 
{
public:
	class UAssetUserData*                         AssetUserData;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.PendingReleaseSkeletalMeshInfo
// 0x0010 (0x0010 - 0x0000)
struct FPendingReleaseSkeletalMeshInfo final 
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Timestamp;                                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.FParameterOptionsTags
// 0x0010 (0x0010 - 0x0000)
struct FFParameterOptionsTags final 
{
public:
	TArray<class FString>                         Tags;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.ParameterTags
// 0x0060 (0x0060 - 0x0000)
struct FParameterTags final 
{
public:
	TArray<class FString>                         Tags;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, struct FFParameterOptionsTags> ParameterOptions;                                  // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.ProfileParameterDat
// 0x0070 (0x0070 - 0x0000)
struct FProfileParameterDat final 
{
public:
	class FString                                 ProfileName;                                       // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectBoolParameterValue> BoolParameters;                                    // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectIntParameterValue> IntParameters;                                     // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectFloatParameterValue> FloatParameters;                                   // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectTextureParameterValue> TextureParameters;                                 // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectVectorParameterValue> VectorParameters;                                  // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectProjectorParameterValue> ProjectorParameters;                               // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CompilationOptions
// 0x0048 (0x0048 - 0x0000)
struct FCompilationOptions final 
{
public:
	ECustomizableObjectTextureCompression         TextureCompression;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24C0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OptimizationLevel;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDiskCompilation;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24C1[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        PackagedDataBytesLimit;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        EmbeddedDataBytesLimit;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24C2[0x28];                                    // 0x0020(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.CustomizableObjectMeshToMeshVertData
// 0x0040 (0x0040 - 0x0000)
struct FCustomizableObjectMeshToMeshVertData final 
{
public:
	float                                         PositionBaryCoordsAndDist[0x4];                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalBaryCoordsAndDist[0x4];                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TangentBaryCoordsAndDist[0x4];                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        SourceMeshVertIndices[0x4];                        // 0x0030(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         SourceAssetIndex;                                  // 0x003C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         SourceAssetLodIndex;                               // 0x003E(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.MutableLODSettings
// 0x0070 (0x0070 - 0x0000)
struct FMutableLODSettings final 
{
public:
	struct FPerPlatformInt                        MinLOD;                                            // 0x0000(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24C3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPerQualityLevelInt                    MinQualityLevelLOD;                                // 0x0008(0x0068)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectIdPair
// 0x0020 (0x0020 - 0x0000)
struct FCustomizableObjectIdPair final 
{
public:
	class FString                                 CustomizableObjectGroupName;                       // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CustomizableObjectName;                            // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.CustomizableObjectIdentifier
// 0x0030 (0x0030 - 0x0000)
struct FCustomizableObjectIdentifier final 
{
public:
	class FString                                 CustomizableObjectGroupName;                       // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CustomizableObjectName;                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 Guid;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.BakingConfiguration
// 0x0030 (0x0030 - 0x0000)
struct FBakingConfiguration final 
{
public:
	class FString                                 OutputPath;                                        // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputFilesBaseName;                               // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportAllResourcesOnBake;                         // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateConstantMaterialInstancesOnBake;          // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowOverridingOfFiles;                           // 0x0022(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24C4[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FCustomizableObjectInstanceBakeOutput& BakeOperationOutput)> OnBakeOperationCompletedCallback;                  // 0x0024(0x000C)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CustomizableObject.MultilayerProjectorLayer
// 0x0080 (0x0080 - 0x0000)
struct alignas(0x08) FMultilayerProjectorLayer
{
public:
	uint8                                         Pad_24C5[0x80];                                    // 0x0000(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CustomizableObject.MultilayerProjector
// 0x00F8 (0x00F8 - 0x0000)
struct FMultilayerProjector final 
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_24C6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      VirtualLayersMapping;                              // 0x0008(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, int32>                      VirtualLayersOrder;                                // 0x0058(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMultilayerProjectorLayer> DisableVirtualLayers;                              // 0x00A8(0x0050)(NativeAccessSpecifierPrivate)
};

// ScriptStruct CustomizableObject.CustomizableObjectInstanceDescriptor
// 0x0128 (0x0128 - 0x0000)
struct FCustomizableObjectInstanceDescriptor final 
{
public:
	class UCustomizableObject*                    CustomizableObject;                                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectBoolParameterValue> BoolParameters;                                    // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectIntParameterValue> IntParameters;                                     // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
