#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscoveryBrowserUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DiscoveryBrowserUI_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUILegacy_classes.hpp"


namespace SDK
{

// Class DiscoveryBrowserUI.DiscoverSelectedActivityViewModel
// 0x0028 (0x0090 - 0x0068)
class UDiscoverSelectedActivityViewModel final  : public UMVVMViewModelBase
{
public:
	bool                                          bLoading;                                          // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasPartyData;                                     // 0x0069(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsActiveInvite;                                   // 0x006A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsPartyPrivate;                                   // 0x006B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentPartySize;                                  // 0x006C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   RichPresenceText;                                  // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UFortActivityViewModel*                 ActivityVM;                                        // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AA0B[0x8];                                     // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DiscoverSelectedActivityViewModel">();
	}
	static class UDiscoverSelectedActivityViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscoverSelectedActivityViewModel>();
	}
};

// Class DiscoveryBrowserUI.FortActivityListItemWrapper
// 0x0010 (0x0038 - 0x0028)
class UFortActivityListItemWrapper final  : public UObject
{
public:
	uint8                                         Pad_AA0C[0x10];                                    // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityListItemWrapper">();
	}
	static class UFortActivityListItemWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityListItemWrapper>();
	}
};

// Class DiscoveryBrowserUI.FortDiscoverHomespace
// 0x0000 (0x0428 - 0x0428)
class UFortDiscoverHomespace final  : public UScrollableActivatableWidget
{
public:
	void OnPeekPushPercentMobileCVarChanged(float PeekPushPercent);

	void SendHomespaceSubviewEvent(class UWidget* SubWidget, const class FString& Text) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDiscoverHomespace">();
	}
	static class UFortDiscoverHomespace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDiscoverHomespace>();
	}
};

// Class DiscoveryBrowserUI.FortDiscoverPreviewManager
// 0x00C8 (0x00F0 - 0x0028)
class UFortDiscoverPreviewManager final  : public UObject
{
public:
	uint8                                         Pad_AA0D[0xC8];                                    // 0x0028(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortDiscoverPreviewManager">();
	}
	static class UFortDiscoverPreviewManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDiscoverPreviewManager>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserColorSchemeAsset
// 0x0050 (0x0080 - 0x0030)
class UFortActivityBrowserColorSchemeAsset final  : public UDataAsset
{
public:
	TMap<class UMaterialParameterCollection*, struct FColorSchemeParamaterValues> MaterialCollectionOverrides;                       // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserColorSchemeAsset">();
	}
	static class UFortActivityBrowserColorSchemeAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserColorSchemeAsset>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserListView
// 0x0230 (0x04C0 - 0x0290)
class UFortActivityBrowserListView final  : public UListViewBase
{
public:
	uint8                                         Pad_AA0E[0xE8];                                    // 0x0290(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionalNavigationTimeThreshold;                // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA0F[0x4];                                     // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortActivityBrowserRow>    DiscoverItemRowClass;                              // 0x0380(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityBrowserRow>    HomebarItemRowClass;                               // 0x0388(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class UFortActivityBrowserRow>> RowTypes;                                          // 0x0390(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bUseTinyOffsetWhenScrollingIntoView;               // 0x03E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA10[0xDF];                                    // 0x03E1(0x00DF)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void NavigateToActivityInFirstRow(int32 ActivityItemIndex);

	void HandleVisibleEntriesChanged() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserListView">();
	}
	static class UFortActivityBrowserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserListView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserTileBase
// 0x0060 (0x1500 - 0x14A0)
class UFortActivityBrowserTileBase : public UCommonButtonBase
{
public:
	uint8                                         Pad_AA11[0x60];                                    // 0x14A0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserTileBase">();
	}
	static class UFortActivityBrowserTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTileBase>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserPlayWithFriendsTile
// 0x00D0 (0x15D0 - 0x1500)
class UFortActivityBrowserPlayWithFriendsTile final  : public UFortActivityBrowserTileBase
{
public:
	int32                                         MaxNamesToDisplay;                                 // 0x1500(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxPortraitsToDisplay;                             // 0x1504(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AA12[0x10];                                    // 0x1508(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortJoinablePartyPortraitsDisplay*     PartyMembersAvatarsDisplay;                        // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsActiveInvite;                                   // 0x1520(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA13[0x3];                                     // 0x1521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentPartySize;                                  // 0x1524(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsPartyPrivate;                                   // 0x1528(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA14[0x7];                                     // 0x1529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivity*                      CachedGameActivity;                                // 0x1530(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA15[0x10];                                    // 0x1538(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class USocialUser>             CachedTargetSocialUser;                            // 0x1548(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   CurrentCTAButtonText;                              // 0x1550(0x0010)(Transient, NativeAccessSpecifierPrivate)
	class FText                                   JoinPartyText;                                     // 0x1560(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   RequestToJoinText;                                 // 0x1570(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    JoinFriendInputAction_Touch;                       // 0x1580(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA16[0x40];                                    // 0x1590(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_PartyInformationUpdated(bool bInIsTileSelected);
	class FText GetCTAButtonText();
	void HandleCTAButtonClicked();
	void OnGameActivityChanged(class UFortGameActivity* GameActivity);
	void OnTextureBeginLoading();
	void OnTextureLoadingComplete(class UTexture* ThumbnailTexture);
	void OnTileActiveChanged(bool bIsTileActive);
	void OnUpdateColumnSize(int32 NewColumnSize);
	void OpenSidebar();
	void UpdateCTAButtonInfo(class FText& InteractionText, bool bInteractionFound);
	void UpdateCTAButtonInteraction(bool bIsInteractionEnabled);
	void UpdateIslandThumbnail(class UTexture* ThumbnailTexture);
	void UpdateLastInteraction(class FText& LastInteraction);
	void UpdateOtherPlayersSubText(class FText& OtherPlayersSubText);
	void UpdatePartyMemberNames(class FText& Names);
	void UpdateRichPresence(class FText& RichPresence);
	void UpdateSingleFriendName(class FText& SingleFriendName);

	const int32 GetMaxPartySize() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserPlayWithFriendsTile">();
	}
	static class UFortActivityBrowserPlayWithFriendsTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserPlayWithFriendsTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRow
// 0x00C0 (0x03B0 - 0x02F0)
class UFortActivityBrowserRow : public UCommonUserWidget
{
public:
	uint8                                         Pad_AA18[0xB0];                                    // 0x02F0(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_CategoryName;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinimumVisibilityPercentageForRowActivation;       // 0x03A8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA19[0x4];                                     // 0x03AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCategoryItemChanged(bool bPlayAnimation);
	void OnRowIsActiveChanged(bool bIsActive);
	void OnRowIsSelectedChanged(bool bIsSelected);
	void OnRowMoveDown(bool bMovingOffscreen);
	void OnRowMoveUp(bool bMovingOffscreen);
	void OnRowPeekStateChanged(bool bIsInPeekState);

	bool GetIsActive() const;
	bool GetIsInPeekState() const;
	bool GetIsSelected() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRow">();
	}
	static class UFortActivityBrowserRow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRow>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRowList
// 0x0020 (0x03D0 - 0x03B0)
class UFortActivityBrowserRowList final  : public UFortActivityBrowserRow
{
public:
	class UFortActivityListView*                  ListView_Activities;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PageLeft;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_PageRight;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA1A[0x8];                                     // 0x03C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnQueryStatusChanged(bool bIsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRowList">();
	}
	static class UFortActivityBrowserRowList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowList>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserView
// 0x00B8 (0x0510 - 0x0458)
class UFortActivityBrowserView : public UFortActivityView
{
public:
	bool                                          bShowCustomMatchmakingModalButton;                 // 0x0458(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowSpectateMatchModalButton;                     // 0x0459(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowMobileGameDetailsButton;                      // 0x045A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowMobileAcceptButton;                           // 0x045B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShowBackToTopButton;                              // 0x045C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA1B[0x3];                                     // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DiscoverySurfaceName;                              // 0x0460(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA1C[0xAC];                                    // 0x0464(0x00AC)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSurfaceDataDirty();

	EFortInvalidActivityReason GetInvalidActivityReason() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserView">();
	}
	static class UFortActivityBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserRowView
// 0x01A0 (0x06B0 - 0x0510)
class UFortActivityBrowserRowView : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_AA1D[0x8];                                     // 0x0510(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MouseWheelScrollTimeThreshold;                     // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA1E[0x4];                                     // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityBrowserListView*           BrowserList_Activities;                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AA1F[0x60];                                    // 0x0528(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameID;                                         // 0x0588(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA20[0x4];                                     // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0590(0x0100)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                        SwipePanel_Navigation;                             // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA21[0x18];                                    // 0x0698(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleVerticalSwipe(int32 Direction);
	void OnActivityUpdated();
	void OnListViewScrolled(float ItemOffset, float DistanceRemaining);
	void OnQueryActivitiesFinished();
	void OnRowChanged(int32 NewCategoryIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserRowView">();
	}
	static class UFortActivityBrowserRowView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserRowView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityBrowserTile
// 0x0060 (0x1560 - 0x1500)
class UFortActivityBrowserTile final  : public UFortActivityBrowserTileBase
{
public:
	class UFortActivityTileDetailsDisplay*        Display_TileDetails;                               // 0x1500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA22[0x58];                                    // 0x1508(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActivitySelected();
	void HandleDisplayTileDetailsHoldTriggered(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityBrowserTile">();
	}
	static class UFortActivityBrowserTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityBrowserTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerBrowserView
// 0x0140 (0x0650 - 0x0510)
class UFortActivityPlayerBrowserView : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_AA23[0x8];                                     // 0x0510(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameActivityProvider*              ActivityProvider;                                  // 0x0518(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortActivityTileView*                  TileView_PlayerActivities;                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TabNameID;                                         // 0x0528(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA24[0x4];                                     // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0530(0x0100)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EFortCreativeDiscoveryPlayHistoryType         PlayHistoryProviderType;                           // 0x0630(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA25[0x1F];                                    // 0x0631(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnTileViewUpdated();
	void OnPlayViewIntro();
	void OnQueryActivitiesComplete();
	void OnQueryActivitiesStarted();
	void PlayViewIntro();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerBrowserView">();
	}
	static class UFortActivityPlayerBrowserView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerBrowserView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryPageView
// 0x0040 (0x0690 - 0x0650)
class UFortActivityCategoryPageView : public UFortActivityPlayerBrowserView
{
public:
	uint8                                         Pad_AA26[0x8];                                     // 0x0650(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonRichTextBlock*                   Text_CategoryTitle;                                // 0x0658(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BackToTop;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0668(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_MobileAccept;                               // 0x0678(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_MobileShowGameDetails;                      // 0x0680(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AA27[0x8];                                     // 0x0688(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryPageView">();
	}
	static class UFortActivityCategoryPageView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryPageView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityTileViewTileBase
// 0x0090 (0x1530 - 0x14A0)
class UFortActivityTileViewTileBase : public UCommonButtonBase
{
public:
	uint8                                         Pad_AA28[0x90];                                    // 0x14A0(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityTileViewTileBase">();
	}
	static class UFortActivityTileViewTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityTileViewTileBase>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryTile
// 0x0010 (0x1540 - 0x1530)
class UFortActivityCategoryTile final  : public UFortActivityTileViewTileBase
{
public:
	class UCommonTextBlock*                       Text_CategoryTitle;                                // 0x1530(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA29[0x8];                                     // 0x1538(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTileActiveSet(bool bIsTileActive);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryTile">();
	}
	static class UFortActivityCategoryTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryTilePanel
// 0x0070 (0x0360 - 0x02F0)
class UFortActivityCategoryTilePanel final  : public UCommonUserWidget
{
public:
	class UFortActivityTileView*                  TileView_Categories;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TileViewQueryThreshold;                            // 0x0300(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA2A[0x4];                                     // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCreativeDiscoveryActivityProvider* CachedActivityProvider;                            // 0x0308(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA2B[0x50];                                    // 0x0310(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryTilePanel">();
	}
	static class UFortActivityCategoryTilePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryTilePanel>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCategoryView
// 0x0130 (0x0640 - 0x0510)
class UFortActivityCategoryView final  : public UFortActivityBrowserView
{
public:
	uint8                                         Pad_AA2C[0x8];                                     // 0x0510(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TabNameID;                                         // 0x0518(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA2D[0x4];                                     // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                TabButtonLabelInfo;                                // 0x0520(0x0100)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         TilePanel_Featured;                                // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         TilePanel_All;                                     // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityCategoryTilePanel*         CurrentSelectedPanel;                              // 0x0630(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA2E[0x8];                                     // 0x0638(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortActivityCategoryTilePanel* NavigateFromPanel(EUINavigation Direction, class UFortActivityCategoryTilePanel* NavigatingPanel);
	void OnCategoryTilePanelSelected(class UFortActivityCategoryTilePanel* SelectedPanel);
	void OnSurfaceDataReady();

	const class UFortActivityCategoryTilePanel* GetCurrentSelectedPanel() const;
	class UFortActivityCategoryTilePanel* GetTopMostVisiblePanel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCategoryView">();
	}
	static class UFortActivityCategoryView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCategoryView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityCreatorPageView
// 0x0080 (0x0710 - 0x0690)
class UFortActivityCreatorPageView final  : public UFortActivityCategoryPageView
{
public:
	uint8                                         Pad_AA30[0x28];                                    // 0x0690(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AmountOfCreatorLinkEntriesQueried;                 // 0x06B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ProcessedCreatorLinkEntries;                       // 0x06BC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AmountOfEntriesQueried;                            // 0x06C0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA31[0x4C];                                    // 0x06C4(0x004C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCreatorActivitiesQueryFinished();
	void OnNoContentFoundForCreator();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityCreatorPageView">();
	}
	static class UFortActivityCreatorPageView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityCreatorPageView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityDiscoverView
// 0x00A0 (0x0750 - 0x06B0)
class UFortActivityDiscoverView final  : public UFortActivityBrowserRowView
{
public:
	bool                                          bPlayDetailsAnimationOnScreenOpen;                 // 0x06B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA32[0x3];                                     // 0x06B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DetailsDisplayUpdateDelay;                         // 0x06B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivatableMovieWidget> MovieWidgetClass;                                  // 0x06B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_SelectedActivity;                   // 0x06C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityDetailsDisplay*            DetailsDisplay_PromotedActivity;                   // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_VideoSlot;                                   // 0x06D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_PromotedVideoSlot;                           // 0x06D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivatableMovieWidget*            ActivityMovieWidget;                               // 0x06E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivatableMovieWidget*            PromotedActivityMovieWidget;                       // 0x06E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA33[0x48];                                    // 0x06F0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       BoundKeyArtOutroAnimation;                         // 0x0738(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA34[0x10];                                    // 0x0740(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckUpdateDetailsDelay();
	void HandleMovieWidgetMediaPreEndEvent();
	void HandleMovieWidgetMediaStarted();
	void OnMoviePlayingChanged(bool bIsPlaying);
	void OnMoviePreEndEvent();
	void OnPlayKeyArtIntro();
	void OnPlayKeyArtOutro();
	void OnPreviewImageChanged(bool bIsLoading, class UTexture* Texture);
	void OnUpdateDetailsDisplay();

	const class UTexture* GetCurrentTexture() const;
	class UWidgetAnimation* GetKeyArtOutroAnimation() const;
	class UFortActivatableMovieWidget* GetMovieWidget() const;
	class UFortActivatableMovieWidget* GetPromotedMovieWidget() const;
	bool IsImageLoading() const;
	bool IsInOutroState() const;
	bool IsShowingPromotedContent() const;
	bool IsShowingSeasonalContent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityDiscoverView">();
	}
	static class UFortActivityDiscoverView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityDiscoverView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityDiscoverViewV2
// 0x0150 (0x0800 - 0x06B0)
class UFortActivityDiscoverViewV2 final  : public UFortActivityBrowserRowView
{
public:
	FMulticastInlineDelegateProperty_             OnActivityRequested;                               // 0x06B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortDiscoverPreviewManager*            DiscoverPreviewManager;                            // 0x06C0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA36[0x28];                                    // 0x06C8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UDiscoverSelectedActivityViewModel*     SelectedActivityVM;                                // 0x06F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SoftCustomMatchmakingModalClass;                   // 0x06F8(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   SoftSpectateMatchModalClass;                       // 0x0718(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA37[0x8];                                     // 0x0738(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    BackToTopInputAction;                              // 0x0740(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA38[0x8];                                     // 0x0750(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CustomKeyInputAction;                              // 0x0758(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA39[0x8];                                     // 0x0768(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ShowSpectateMatchModalInputAction;                 // 0x0770(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA3A[0x8];                                     // 0x0780(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    JoinAsSpectatorInputAction;                        // 0x0788(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA3B[0x8];                                     // 0x0798(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    JoinAsPlayerInputAction;                           // 0x07A0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA3C[0x8];                                     // 0x07B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    SelectActivityInputAction_Touch;                   // 0x07B8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA3D[0x38];                                    // 0x07C8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DeactivationTransitionCompleted();
	void FireDiscoverExitedAnalyticEvent();
	void StartDiscoverAnalyticSession();
	void UpdateMiscActionBindingVisibility(bool bVisible);

	bool IsShowingPromotedContent() const;
	bool IsShowingSeasonalContent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityDiscoverViewV2">();
	}
	static class UFortActivityDiscoverViewV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityDiscoverViewV2>();
	}
};

// Class DiscoveryBrowserUI.FortActivityListView
// 0x01A0 (0x0430 - 0x0290)
class UFortActivityListView final  : public UListViewBase
{
public:
	uint8                                         Pad_AA3E[0xE8];                                    // 0x0290(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionalNavigationTimeThreshold;                // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrientation                                  Orientation;                                       // 0x037C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AA3F[0x3];                                     // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EntrySpacing;                                      // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCircularNavigationEnabled;                        // 0x0384(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA40[0x3];                                     // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EActivityBrowserTileStyle, TSubclassOf<class UFortActivityBrowserTileBase>> TileTypes;                                         // 0x0388(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA41[0x58];                                    // 0x03D8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddTileType(EActivityBrowserTileStyle Style, TSubclassOf<class UFortActivityBrowserTileBase> WidgetClass);

	int32 GetInViewCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityListView">();
	}
	static class UFortActivityListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityListView>();
	}
};

// Class DiscoveryBrowserUI.FortActivityLobbyTile
// 0x0080 (0x1570 - 0x14F0)
class UFortActivityLobbyTile final  : public UCommonButtonLegacy
{
public:
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityBrowserTag*                ActivityBrowserTag_EpicOriginal;                   // 0x14F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityModeSetSelectionModalBase> ActivityModeSetSelectionModalClass;                // 0x1500(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGameActivityProvider*              ActivityProvider;                                  // 0x1508(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA43[0x60];                                    // 0x1510(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDetailsUpdated();
	void OnPreviewImageChanged(bool bIsLoading, class UTexture* Texture);
	void ShowModeSetSelectionModal();

	class FText GetChildActivityDisplayName() const;
	bool IsActivityEpicCreated() const;
	bool ShouldShowSubmodeSelectButton() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityLobbyTile">();
	}
	static class UFortActivityLobbyTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityLobbyTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivityModeSetSelectionModal
// 0x0068 (0x0488 - 0x0420)
class UFortActivityModeSetSelectionModal final  : public UFortActivityModeSetSelectionModalBase
{
public:
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA45[0x28];                                    // 0x0428(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Back;                                       // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_BackBoard;                                  // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityModeSetSelection*          List_SubModeList;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivitySquadFillButton*           Button_ActivitySquadFill;                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityPrivacyButton*             Button_ActivityPrivacy;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityHabaneroButton*            Button_Activity_Habanero;                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA46[0x8];                                     // 0x0480(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActivityChanged(class UFortGameActivity* GameActivity, const class FString& StartingSelectedMnemonic);
	void OnPreviewImageChanged(bool bIsLoading, class UTexture* Texture);
	void OnSubModeSelected();
	void OnSubModeSelectionChanged();
	void SaveSelectionAndClose();
	void SetHabaneroValues(bool bHabaneroEnabled, bool bHabaneroExists);
	void SetIsRankedSwitchAvailable(bool bIsRankedSwitchAvailable);

	bool IsCreativeModeSetActivity() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityModeSetSelectionModal">();
	}
	static class UFortActivityModeSetSelectionModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityModeSetSelectionModal>();
	}
};

// Class DiscoveryBrowserUI.FortActivityPlayerBrowserTile
// 0x0060 (0x1590 - 0x1530)
class UFortActivityPlayerBrowserTile final  : public UFortActivityTileViewTileBase
{
public:
	class UFortActivityTileDetailsDisplay*        Display_TileDetails;                               // 0x1530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_LastPlayedDate;                               // 0x1538(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA48[0x50];                                    // 0x1540(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActivitySelected();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityPlayerBrowserTile">();
	}
	static class UFortActivityPlayerBrowserTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityPlayerBrowserTile>();
	}
};

// Class DiscoveryBrowserUI.FortActivitySelector
// 0x00F8 (0x0120 - 0x0028)
class UFortActivitySelector final  : public UObject
{
public:
	uint8                                         Pad_AA49[0x20];                                    // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            SelectedContextWidget;                             // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA4A[0x20];                                    // 0x0050(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortActivityCreatorPageView*           CachedCreatorPageView;                             // 0x0070(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA4B[0x10];                                    // 0x0078(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UFortActivityBrowserColorSchemeAsset*> ColorSchemes;                                      // 0x0088(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortActivityBrowserColorSchemeAsset*   CurrentColorScheme;                                // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA4C[0x40];                                    // 0x00E0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConfirmSelectedActivity();
	void HandleShowActivityDetails();
	void OnEnableColorScheme(bool bIsColorSchemeActive);
	void OnSwapColorScheme(bool bInIsUsingAlternateColorScheme);
	void OpenCreatorPage();
	void ToggleFavorite();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivitySelector">();
	}
	static class UFortActivitySelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivitySelector>();
	}
};

// Class DiscoveryBrowserUI.FortActivityTileDetailsDisplay
// 0x01A0 (0x1740 - 0x15A0)
class UFortActivityTileDetailsDisplay final  : public UUIKitHoldableModularButton
{
public:
	FMulticastInlineDelegateProperty_             OnActivitySelectedDelegate;                        // 0x15A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             OnActivityUnSelectedDelegate;                      // 0x15B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowDetailsButton;                                // 0x15C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AA4D[0x3];                                     // 0x15C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultColumnSize;                                 // 0x15C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_ActivityName;                                 // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_PlayerCount;                                  // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Favorite;                                   // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Details;                                    // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityBrowserTag*                ActivityBrowserTag_EpicOriginal;                   // 0x15E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_DebugId;                                      // 0x15F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActivityVideoCycle*                ActivityVideoCycleWidget;                          // 0x15F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<uint32, ECreativeLinkPreviewSize>        MinColumnSizeToImageSize;                          // 0x1600(0x0050)(Config, NativeAccessSpecifierPrivate)
	uint8                                         MaxMobileColumnSize;                               // 0x1650(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         MinMobileColumnSize;                               // 0x1651(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsVideoEnabledForDynamicTileSizingV2;             // 0x1652(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA4E[0x5];                                     // 0x1653(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortActivityDetailsModal>  ActivityDetailsModalClass;                         // 0x1658(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityCreatorPageView> ActivityCreatorPageViewClass;                      // 0x1660(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortCampaignPurchaseScreen> ActivityCampaignPurchaseScreenClass;               // 0x1668(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivityBrowserAttributionsModal> ActivityAttributionsClass;                         // 0x1670(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA4F[0xC8];                                    // 0x1678(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActivitySelected();
	void HandleShowActivityDetails();
	void OnActivitySelected__DelegateSignature();
	void OnActivityUnSelected__DelegateSignature();
	void OnDetailsUpdated();
	void OnFriendsPlayingChanged(int32 NumPlaying);
	void OnIsFavoriteChanged(bool bIsFavorite);
	void OnLocalPlayerDemoted();
	void OnLocalPlayerPromotedToLeader();
	void OnLogoImageChanged(bool bIsLoading, class UTexture* Texture);
	void OnPartySizeChanged(int32 PartySize);
	void OnPreviewImageChanged(bool bIsLoading, class UTexture* Texture);
	void OnRequiresPurchaseChanged(bool bRequiresPurchase);
	void OnRespondToTileViewVisibilityChange(bool bIsVisible);
	void OnTileActiveSet(bool bIsTileActive);
	void OnTileClicked();
	void ShouldPlayTileVideo(bool* bOutResult);
	void StartTileVideo();
	void StopTileVideo();
	void UpdateActivitySelector();
	void UpdateCCU(int32 CCUCount);
	void UpdateFromFortActivityViewModel();
	void UpdateSqueegeeWidgets(class UFortGameActivity* GameActivity);

	void BroadcastOnActivityConfirmed() const;
	bool DoesActivityRequirePurchase() const;
	class FString GetActivityCreatorDisplayText() const;
	class UFortActivitySelector* GetActivitySelector() const;
	EFortInvalidActivityReason GetInvalidActivityReason() const;
	EFortActivityIsLockedReason GetIsActivityLockedReason() const;
	bool IsActivityFavorited() const;
	bool IsActivityLocked() const;
	bool IsModeSetActivity() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityTileDetailsDisplay">();
	}
	static class UFortActivityTileDetailsDisplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivityTileDetailsDisplay>();
	}
};

// Class DiscoveryBrowserUI.FortActivityTileView
// 0x0000 (0x0C00 - 0x0C00)
class UFortActivityTileView final  : public UCommonTileView
{
public:
	void NavigateToTop();
	void RespondToVisibilityChange(bool bIsVisible);
	void SetListenForMouseWheelInput(bool bListenForInput);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivityTileView">();
	}
