#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityInteract_0

#include "Basic.hpp"

#include "EntityInteract_0_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function EntityInteract.interact_component.$InitCDO
// 0x03B0 (0x03B0 - 0x0000)
struct Interact_component__InitCDO final 
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_2;                                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_3;                                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_4;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_C088[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_message*                         _ExprResultStack_6;                                // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0038(0x0010)(HasGetValueTypeHash)
	struct EntityInteract_0::FTuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_8;                                     // 0x0048(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x00B8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_10;                                    // 0x00C8(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_11;                                    // 0x00D8(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_1;                          // 0x0128(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_12;                                     // 0x0178(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_13;                                      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_3;                          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_3;                        // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_14 : 1;                                // 0x01D2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_136 : 7;                                    // 0x00D2(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_15 : 1;                                // 0x01D3(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_C089[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseEngine_subscribable_event*        _ExprResult_16;                                    // 0x01D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_17;                               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_18;                                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_19;                                    // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_20;                                    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_21 : 1;                                // 0x0200(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_C08A[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_message*                         _ExprResultStack_22;                               // 0x0208(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_23;                                        // 0x0210(0x0010)(HasGetValueTypeHash)
	struct EntityInteract_0::FTuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R _ExprResult_24;                                    // 0x0220(0x0070)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_25;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_26;                                    // 0x02A0(0x0010)(HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ExprResult_27;                                    // 0x02B0(0x0050)(ContainsInstancedReference)
	TMap<EVerseFalse, EVerseFalse>                __verse_0xC87067A2_Map_6;                          // 0x0300(0x0050)(ContainsInstancedReference)
	TMap<FVerseStringProperty_, class UVerse_localizable_value*> _ForResult_28;                                     // 0x0350(0x0050)(ContainsInstancedReference)
	int64                                         _ForIndex_29;                                      // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x589418B4_Key_8;                          // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0x31A8F10C_Value_8;                        // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_30 : 1;                                // 0x03AA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_137 : 7;                                    // 0x00AA(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_31 : 1;                                // 0x03AB(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct Interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final 
{
public:
	struct EntityInteract_0::FTuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetInteractText
// 0x0018 (0x0018 - 0x0000)
struct Interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetInteractText final 
{
public:
	struct EntityInteract_0::FTuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_C08B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_ROnRep__Enabled
// 0x0001 (0x0001 - 0x0000)
struct Interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_ROnRep__Enabled final 
{
public:
	struct EntityInteract_0::FTuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetInteractText_L_Nmessage_R
// 0x0008 (0x0008 - 0x0000)
struct Interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetInteractText_L_Nmessage_R final 
{
public:
	class UVerse_message*                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSuccessfullyInteract
// 0x0001 (0x0001 - 0x0000)
struct Interact_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSuccessfullyInteract final 
{
public:
	struct EntityInteract_0::FTuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable
// 0x0001 (0x0001 - 0x0000)
struct Interact_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable final 
{
public:
	struct EntityInteract_0::FTuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable
// 0x0001 (0x0001 - 0x0000)
struct Interact_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable final 
{
public:
	struct EntityInteract_0::FTuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function EntityInteract.interact_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled
// 0x0003 (0x0003 - 0x0000)
struct Interact_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled final 
{
public:
	struct EntityInteract_0::FTuple_L_R           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

