#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityInteract

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "LocalizableMessage_structs.hpp"


namespace SDK
{

// Class EntityInteract.EntityInteractLibrary
// 0x0000 (0x0028 - 0x0028)
class UEntityInteractLibrary final  : public UBlueprintFunctionLibrary
{
public:
	static class AActor* EntityInteractGetActor(class UObject* WorldContextObject, struct FHitResult& HitResult);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityInteractLibrary">();
	}
	static class UEntityInteractLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityInteractLibrary>();
	}
};

// Class EntityInteract.EntityInteractProxyActor
// 0x0068 (0x02F8 - 0x0290)
class AEntityInteractProxyActor final  : public AActor
{
public:
	uint8                                         Pad_A9DC[0x8];                                     // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        ActorRootComponent;                                // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLocalizableMessage                    InteractMessage;                                   // 0x02A0(0x0030)(Net, RepNotify, NativeAccessSpecifierPrivate)
	class FText                                   InteractText;                                      // 0x02D0(0x0010)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_A9DD[0x10];                                    // 0x02E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForwardInteractOffset;                             // 0x02F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RightInteractOffset;                               // 0x02F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_Message();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityInteractProxyActor">();
	}
	static class AEntityInteractProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEntityInteractProxyActor>();
	}
};

// Class EntityInteract.FortAthenaMutator_EntityInteract
// 0x0000 (0x0338 - 0x0338)
class AFortAthenaMutator_EntityInteract final  : public AFortAthenaMutator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_EntityInteract">();
	}
	static class AFortAthenaMutator_EntityInteract* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_EntityInteract>();
	}
};

}

