#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityInteract_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Entity_0_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass EntityInteract.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class EntityInteract_0::U_SolarisSignatureFunctionOuter final  : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass EntityInteract.$SolarisSignatureFunctionOuter", true>();
	}
	static class EntityInteract_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<EntityInteract_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass EntityInteract.interact_component
// 0x00E8 (0x0248 - 0x0160)
class UInteract_component final  : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x08120DBC__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSuccessfullyInteract; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFB044ADC__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetInteractText_L_Nmessage_R; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B691C74__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetInteractText; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x94AF88A7__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_ROnRep__Enabled; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9F9250BD__L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable; // 0x01A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x20BC70FC__L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable; // 0x01B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7E7AEB13__L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled; // 0x01C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_C086[0x30];                                    // 0x01D0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x5CDFC2A5_Enabled : 1;                    // 0x0200(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_C087[0x1F];                                    // 0x0201(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x0FAFAE20_InteractFinishedEvent;          // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0xAB115356_InteractDistance;               // 0x0228(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x0AA06607_InteractTime;                   // 0x0230(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xD5BE1F0C_TimesCanTrigger;                // 0x0238(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerse_message*                         __verse_0x1BB43167_DefaultInteractText;            // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO(class UVerseEngine_subscribable_event* _ExprResult_0, uint64 _InstancingGraph_1, double _ExprResult_2, double _ExprResult_3, double _ExprResult_4, uint8 _ExprResult_5, class UVerse_message* _ExprResultStack_6, FVerseFunctionProperty_ _Callee_7, const struct EntityInteract_0::FTuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R& _ExprResult_8, FVerseStringProperty_ _ExprResult_9, FVerseStringProperty_ _ExprResult_10, const TMap<FVerseStringProperty_, class UVerse_localizable_value*>& _ExprResult_11, const TMap<EVerseFalse, EVerseFalse>& __verse_0xC87067A2_Map_1, const TMap<FVerseStringProperty_, class UVerse_localizable_value*>& _ForResult_12, int64 _ForIndex_13, EVerseFalse __verse_0x589418B4_Key_3, EVerseFalse __verse_0x31A8F10C_Value_3, uint8 _ExprResult_14, uint8 _ExprResult_15, class UVerseEngine_subscribable_event* _ExprResult_16, uint64 _InstancingGraph_17, double _ExprResult_18, double _ExprResult_19, double _ExprResult_20, uint8 _ExprResult_21, class UVerse_message* _ExprResultStack_22, FVerseFunctionProperty_ _Callee_23, const struct EntityInteract_0::FTuple_L_Kchar_M_Kchar_M_5b_Kchar_5dlocalizable__value_R& _ExprResult_24, FVerseStringProperty_ _ExprResult_25, FVerseStringProperty_ _ExprResult_26, const TMap<FVerseStringProperty_, class UVerse_localizable_value*>& _ExprResult_27, const TMap<EVerseFalse, EVerseFalse>& __verse_0xC87067A2_Map_6, const TMap<FVerseStringProperty_, class UVerse_localizable_value*>& _ForResult_28, int64 _ForIndex_29, EVerseFalse __verse_0x589418B4_Key_8, EVerseFalse __verse_0x31A8F10C_Value_8, uint8 _ExprResult_30, uint8 _ExprResult_31);
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct EntityInteract_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RGetInteractText(const struct EntityInteract_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_ROnRep__Enabled(const struct EntityInteract_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSetInteractText_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2finteract__component_N_RSuccessfullyInteract(const struct EntityInteract_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(const struct EntityInteract_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(const struct EntityInteract_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(const struct EntityInteract_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"interact_component">();
	}
	static class UInteract_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteract_component>();
	}
};

}

