#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicMediaMetadataResolver

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class EpicMediaMetadataResolver.EpicMediaMetadataResolver
// 0x01A0 (0x0240 - 0x00A0)
class UEpicMediaMetadataResolver : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnFailure;                                         // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             MetadataResultExt;                                 // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UEpicMediaCDNHostnames*                 CDNHostNames;                                      // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3404[0x168];                                   // 0x00D8(0x0168)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetBlurl(const class FString& InVUID, bool bInBlurlLive, struct FEpicMediaOptions& InMediaOptions);
	bool GetData(const class FString& UID, bool bLive, struct FEpicMediaOptions& InMediaOptions);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EpicMediaMetadataResolver">();
	}
	static class UEpicMediaMetadataResolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEpicMediaMetadataResolver>();
	}
};

}

