#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExecutionTestSuite_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass ExecutionTestSuite.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class ExecutionTestSuite_0::U_SolarisSignatureFunctionOuter final  : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass ExecutionTestSuite.$SolarisSignatureFunctionOuter", true>();
	}
	static class ExecutionTestSuite_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ExecutionTestSuite_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass ExecutionTestSuite.ExecutionTestSuite_test_phase_user
// 0x00A8 (0x00D0 - 0x0028)
class UExecutionTestSuite_test_phase_user final  : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0xC2A49D98__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RInit_L_Nexecution__subscribable_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x58CAF33A__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCancel; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8EAD5EAE__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderAfter_L_Ntest__phase__user_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1B3C2783__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderBefore_L_Ntest__phase__user_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8651BCF8__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCountNext; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8683E68B__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFF9BD1AE__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime_L_Nfloat_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCAAD6922__L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute2; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<class UExecution_subscription*, true> __verse_0x14C56FCA_Connection;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UExecution_subscription*                __verse_0x9327ADAA_Connection2;                    // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xC0B43457_Counter;                        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x742B3E02_Time;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x5C605981_Counter2;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO(int64 _ExprResult_0, double _ExprResult_1, TOptional<class UExecution_subscription*, true> _ExprResult_2, TOptional<EVerseFalse> __verse_0x00000000__1, uint8 _ExprResult_3, TOptional<EVerseFalse> _ExprResultStack_4, class UExecution_subscription* _ExprResult_5, uint64 _InstancingGraph_6, int64 _ExprResult_7, int64 _ExprResult_8, double _ExprResult_9, TOptional<class UExecution_subscription*, true> _ExprResult_10, TOptional<EVerseFalse> __verse_0x00000000__3, uint8 _ExprResult_11, TOptional<EVerseFalse> _ExprResultStack_12, class UExecution_subscription* _ExprResult_13, uint64 _InstancingGraph_14, int64 _ExprResult_15);
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCancel(const struct ExecutionTestSuite_0::FTuple_L_R& __verse_0xB2CDDD72_Argument, class UExecution_subscription* __verse_0x7E090ADF_Connected_1, TOptional<class UExecution_subscription*, true> _ExprResultStack_0, class UExecution_subscription* __verse_0x00000000__2, EVerseTrue _InvokeSureResultDummy_1, FVerseFunctionProperty_ _Callee_2, const struct ExecutionTestSuite_0::FTuple_L_R& _ExprResult_3, class UExecution_subscription* __verse_0x7E090ADF_Connected_3, TOptional<class UExecution_subscription*, true> _ExprResultStack_4, class UExecution_subscription* __verse_0x00000000__4, EVerseTrue _InvokeSureResultDummy_5, FVerseFunctionProperty_ _Callee_6, const struct ExecutionTestSuite_0::FTuple_L_R& _ExprResult_7);
	void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RCountNext(const struct ExecutionTestSuite_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_RInit_L_Nexecution__subscribable_R(class UExecution_subscribable* __verse_0xB2CDDD72_Argument, class UExecution_subscription* __verse_0x7E090ADF_Connected_3, TOptional<class UExecution_subscription*, true> _ExprResultStack_0, class UExecution_subscription* __verse_0x00000000__4, EVerseTrue _InvokeSureResultDummy_1, FVerseFunctionProperty_ _Callee_2, const struct ExecutionTestSuite_0::FTuple_L_R& _ExprResult_3, TOptional<class UExecution_subscription*, true> _AssignmentScratch_4, TOptional<class UExecution_subscription*, true> _ExprResult_5, class UExecution_subscription* _ExprResult_6, TOptional<class UExecution_subscription*, true> _FallibleType_7, class UObject* _ExprResult_8, class UExecution_subscribable* __verse_0x00000000__5, FVerseFunctionProperty_ _Callee_9, class UExecution_subscription* __verse_0x7E090ADF_Connected_8, TOptional<class UExecution_subscription*, true> _ExprResultStack_10, class UExecution_subscription* __verse_0x00000000__9, EVerseTrue _InvokeSureResultDummy_11, FVerseFunctionProperty_ _Callee_12, const struct ExecutionTestSuite_0::FTuple_L_R& _ExprResult_13, TOptional<class UExecution_subscription*, true> _AssignmentScratch_14, TOptional<class UExecution_subscription*, true> _ExprResult_15, class UExecution_subscription* _ExprResult_16, TOptional<class UExecution_subscription*, true> _FallibleType_17, class UObject* _ExprResult_18, class UExecution_subscribable* __verse_0x00000000__10, FVerseFunctionProperty_ _Callee_19);
	void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute(const struct ExecutionTestSuite_0::FTuple_L_R& __verse_0xB2CDDD72_Argument, EVerseTrue _InvokeSureResultDummy_0, FVerseFunctionProperty_ _Callee_1, const struct ExecutionTestSuite_0::FTuple_L_R& _ExprResult_2, EVerseTrue _InvokeSureResultDummy_3, FVerseFunctionProperty_ _Callee_4, const struct ExecutionTestSuite_0::FTuple_L_R& _ExprResult_5);
	void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecute2(const struct ExecutionTestSuite_0::FTuple_L_R& __verse_0xB2CDDD72_Argument, int64 InvokeResultDummy_0, int64 InvokeResultDummy_1);
	void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROnExecuteWithTime_L_Nfloat_R(double __verse_0xB2CDDD72_Argument, EVerseTrue _InvokeSureResultDummy_0, FVerseFunctionProperty_ _Callee_1, const struct ExecutionTestSuite_0::FTuple_L_R& _ExprResult_2, double InvokeResultDummy_3, EVerseTrue _InvokeSureResultDummy_4, FVerseFunctionProperty_ _Callee_5, const struct ExecutionTestSuite_0::FTuple_L_R& _ExprResult_6, double InvokeResultDummy_7);
	void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderAfter_L_Ntest__phase__user_R(class UExecutionTestSuite_test_phase_user* __verse_0xB2CDDD72_Argument, class UExecution_subscription* __verse_0xCF28E5A8_C_1, TOptional<class UExecution_subscription*, true> _ExprResultStack_0, class UExecution_subscription* __verse_0xC2BD6D73_AfterC_1, TOptional<class UExecution_subscription*, true> _ExprResultStack_1, class UExecution_subscription* __verse_0x00000000__2, EVerseTrue _InvokeSureResultDummy_2, FVerseFunctionProperty_ _Callee_3, class UExecution_subscription* __verse_0xCF28E5A8_C_3, TOptional<class UExecution_subscription*, true> _ExprResultStack_4, class UExecution_subscription* __verse_0xC2BD6D73_AfterC_3, TOptional<class UExecution_subscription*, true> _ExprResultStack_5, class UExecution_subscription* __verse_0x00000000__4, EVerseTrue _InvokeSureResultDummy_6, FVerseFunctionProperty_ _Callee_7);
	void _L_2fUnrealEngine_2ecom_2fExecutionTestSuite_2ftest__phase__user_N_ROrderBefore_L_Ntest__phase__user_R(class UExecutionTestSuite_test_phase_user* __verse_0xB2CDDD72_Argument, class UExecution_subscription* __verse_0xCF28E5A8_C_1, TOptional<class UExecution_subscription*, true> _ExprResultStack_0, class UExecution_subscription* __verse_0x36F41A1B_BeforeC_1, TOptional<class UExecution_subscription*, true> _ExprResultStack_1, class UExecution_subscription* __verse_0x00000000__2, EVerseTrue _InvokeSureResultDummy_2, FVerseFunctionProperty_ _Callee_3, class UExecution_subscription* __verse_0xCF28E5A8_C_3, TOptional<class UExecution_subscription*, true> _ExprResultStack_4, class UExecution_subscription* __verse_0x36F41A1B_BeforeC_3, TOptional<class UExecution_subscription*, true> _ExprResultStack_5, class UExecution_subscription* __verse_0x00000000__4, EVerseTrue _InvokeSureResultDummy_6, FVerseFunctionProperty_ _Callee_7);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExecutionTestSuite_test_phase_user">();
	}
	static class UExecutionTestSuite_test_phase_user* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExecutionTestSuite_test_phase_user>();
	}
};

// VerseClass ExecutionTestSuite.ExecutionTestSuite_test_phases
// 0x0020 (0x0048 - 0x0028)
class UExecutionTestSuite_test_phases final  : public UObject
{
public:
	TOptional<class UExecution_subscribable*, true> __verse_0xC9DB6D90_Gameplay;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UExecution_subscribable*, true> __verse_0x8A2FD5A2_PrePhysics;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UExecution_subscribable*, true> __verse_0xF70848B2_PostPhysics;                    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int64                                         __verse_0xC0B43457_Counter;                        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO(TOptional<class UExecution_subscribable*, true> _ExprResult_0, TOptional<EVerseFalse> __verse_0x00000000__1, uint8 _ExprResult_1, TOptional<EVerseFalse> _ExprResultStack_2, TOptional<class UExecution_subscribable*, true> _ExprResult_3, TOptional<EVerseFalse> __verse_0x00000000__3, uint8 _ExprResult_4, TOptional<EVerseFalse> _ExprResultStack_5, TOptional<class UExecution_subscribable*, true> _ExprResult_6, TOptional<EVerseFalse> __verse_0x00000000__5, uint8 _ExprResult_7, TOptional<EVerseFalse> _ExprResultStack_8, int64 _ExprResult_9, TOptional<class UExecution_subscribable*, true> _ExprResult_10, TOptional<EVerseFalse> __verse_0x00000000__7, uint8 _ExprResult_11, TOptional<EVerseFalse> _ExprResultStack_12, TOptional<class UExecution_subscribable*, true> _ExprResult_13, TOptional<EVerseFalse> __verse_0x00000000__9, uint8 _ExprResult_14, TOptional<EVerseFalse> _ExprResultStack_15, TOptional<class UExecution_subscribable*, true> _ExprResult_16, TOptional<EVerseFalse> __verse_0x00000000__11, uint8 _ExprResult_17, TOptional<EVerseFalse> _ExprResultStack_18, int64 _ExprResult_19);
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExecutionTestSuite_test_phases">();
	}
	static class UExecutionTestSuite_test_phases* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExecutionTestSuite_test_phases>();
	}
};

}

