#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMCalibrationRuntime

#include "Basic.hpp"

#include "FMCalibrationRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function FMCalibrationRuntime.BeatmatchCalibrationHelper.CalcCalibrationResult
// 0x0030 (0x0030 - 0x0000)
struct BeatmatchCalibrationHelper_CalcCalibrationResult final 
{
public:
	TArray<float>                                 Samples;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 SamplesDeltaTimes;                                 // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         BPS;                                               // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECalibrationState                             ResultingState;                                    // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_908F[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ResultMs;                                          // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9090[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction FMCalibrationRuntime.FMCalibrationControllerComponent.OnCalibrationRegisterPreamble__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct FMCalibrationControllerComponent_OnCalibrationRegisterPreamble__DelegateSignature final 
{
public:
	class UFMCalibrationControllerComponent*      CalibrationControllerComponent;                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PreambleGameplayTag;                               // 0x0008(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9092[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction FMCalibrationRuntime.FMCalibrationControllerComponent.OnCalibrationRequestOpenModal__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct FMCalibrationControllerComponent_OnCalibrationRequestOpenModal__DelegateSignature final 
{
public:
	class UFMCalibrationControllerComponent*      CalibrationControllerComponent;                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePreamble;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9093[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction FMCalibrationRuntime.FMCalibrationControllerComponent.OnHasTalkedWithRoadie__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct FMCalibrationControllerComponent_OnHasTalkedWithRoadie__DelegateSignature final 
{
public:
	class UFMCalibrationControllerComponent*      CalibrationControllerComponent;                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasTalkedWithRoadie;                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9094[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction FMCalibrationRuntime.FMCalibrationControllerComponent.OnIsAutolaunchDisabledUpdated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct FMCalibrationControllerComponent_OnIsAutolaunchDisabledUpdated__DelegateSignature final 
{
public:
	class UFMCalibrationControllerComponent*      CalibrationControllerComponent;                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAutolaunchDisabled;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9095[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction FMCalibrationRuntime.FMCalibrationControllerComponent.OnIsCalibratedUpdated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct FMCalibrationControllerComponent_OnIsCalibratedUpdated__DelegateSignature final 
{
public:
	class UFMCalibrationControllerComponent*      CalibrationControllerComponent;                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCalibrated;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9096[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction FMCalibrationRuntime.FMCalibrationControllerComponent.OnIsCalibrationDebugEnabled__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct FMCalibrationControllerComponent_OnIsCalibrationDebugEnabled__DelegateSignature final 
{
public:
	class UFMCalibrationControllerComponent*      CalibrationControllerComponent;                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCalibrationDebugEnabled;                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9097[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction FMCalibrationRuntime.FMCalibrationControllerComponent.OnIsPreambleDisabledUpdated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct FMCalibrationControllerComponent_OnIsPreambleDisabledUpdated__DelegateSignature final 
{
public:
	class UFMCalibrationControllerComponent*      CalibrationControllerComponent;                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPreambleDisabled;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9098[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction FMCalibrationRuntime.FMCalibrationControllerComponent.OnLatencyMsUpdated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct FMCalibrationControllerComponent_OnLatencyMsUpdated__DelegateSignature final 
{
public:
	class UFMCalibrationControllerComponent*      CalibrationControllerComponent;                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LatencyMs;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9099[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SendToggleModalMessage
// 0x0010 (0x0010 - 0x0000)
struct FMCalibrationControllerComponent_SendToggleModalMessage final 
{
public:
	class AActor*                                 ContextActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePreamble;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutoLaunch;                                     // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_909A[0x6];                                     // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetAudioLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_SetAudioLatencyMs final 
{
public:
	float                                         LatencyMs;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetHasTalkedWithRoadie
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetHasTalkedWithRoadie final 
{
public:
	bool                                          bHasTalkedWithRoadie;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsAutolaunchDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsAutolaunchDisabled final 
{
public:
	bool                                          bAutolaunchDisabled;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsCalibrated
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsCalibrated final 
{
public:
	bool                                          bCalibrated;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsCalibrationDebugEnabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsCalibrationDebugEnabled final 
{
public:
	bool                                          bCalibrationDebugEnabled;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetIsPreambleDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_SetIsPreambleDisabled final 
{
public:
	bool                                          bPreambleDisabled;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.SetVideoLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_SetVideoLatencyMs final 
{
public:
	float                                         LatencyMs;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetAudioLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_GetAudioLatencyMs final 
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetHasTalkedWithRoadie
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetHasTalkedWithRoadie final 
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsAutolaunchDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsAutolaunchDisabled final 
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsCalibrated
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsCalibrated final 
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsCalibrationDebugEnabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsCalibrationDebugEnabled final 
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetIsPreambleDisabled
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_GetIsPreambleDisabled final 
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.GetVideoLatencyMs
// 0x0004 (0x0004 - 0x0000)
struct FMCalibrationControllerComponent_GetVideoLatencyMs final 
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.IsCalibrationDataLoaded
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_IsCalibrationDataLoaded final 
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCalibrationRuntime.FMCalibrationControllerComponent.IsCalibrationDataOnLatestVersion
// 0x0001 (0x0001 - 0x0000)
struct FMCalibrationControllerComponent_IsCalibrationDataOnLatestVersion final 
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

