#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMCoreRuntime

#include "Basic.hpp"

#include "HarmonixMidi_structs.hpp"
#include "FMCoreRuntime_structs.hpp"


namespace SDK::Params
{

// Function FMCoreRuntime.FMCoreMusicFunctionLibrary.GetDegreeShiftFromProgression
// 0x0008 (0x0008 - 0x0000)
struct FMCoreMusicFunctionLibrary_GetDegreeShiftFromProgression final 
{
public:
	EHarmonicProgression                          Progression;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AEE[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicFunctionLibrary.GetIntervalAtStepInScale
// 0x0008 (0x0008 - 0x0000)
struct FMCoreMusicFunctionLibrary_GetIntervalAtStepInScale final 
{
public:
	int32                                         ScaleStep;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMusicKeyMode                                 KeyMode;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMusicInterval                                ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AEF[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMCoreRuntime.FMCoreMusicFunctionLibrary.GetIntervalForNote
// 0x0003 (0x0003 - 0x0000)
struct FMCoreMusicFunctionLibrary_GetIntervalForNote final 
{
public:
	struct FMidiNote                              Note;                                              // 0x0000(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EMusicKey                                     Key;                                               // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMusicInterval                                ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicFunctionLibrary.GetIntervalStepInScale
// 0x0008 (0x0008 - 0x0000)
struct FMCoreMusicFunctionLibrary_GetIntervalStepInScale final 
{
public:
	EMusicInterval                                Interval;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMusicKeyMode                                 KeyMode;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AF0[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicFunctionLibrary.GetMidiNoteFromScale
// 0x000C (0x000C - 0x0000)
struct FMCoreMusicFunctionLibrary_GetMidiNoteFromScale final 
{
public:
	EMusicKey                                     Key;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AF1[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Octave;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMusicInterval                                Interval;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMidiNote                              ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AF2[0x2];                                     // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMCoreRuntime.FMCoreMusicFunctionLibrary.SnapToScale
// 0x0004 (0x0004 - 0x0000)
struct FMCoreMusicFunctionLibrary_SnapToScale final 
{
public:
	struct FMidiNote                              Note;                                              // 0x0000(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EMusicKey                                     Key;                                               // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMusicKeyMode                                 KeyMode;                                           // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMidiNote                              ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// DelegateFunction FMCoreRuntime.FMCoreMusicManagerComponent.OnKeyChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct FMCoreMusicManagerComponent_OnKeyChanged__DelegateSignature final 
{
public:
	EMusicKey                                     Param_CurrentKey;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction FMCoreRuntime.FMCoreMusicManagerComponent.OnModeChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct FMCoreMusicManagerComponent_OnModeChanged__DelegateSignature final 
{
public:
	EMusicKeyMode                                 Param_CurrentMode;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction FMCoreRuntime.FMCoreMusicManagerComponent.OnSpeedChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FMCoreMusicManagerComponent_OnSpeedChanged__DelegateSignature final 
{
public:
	float                                         Param_CurrentSpeed;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction FMCoreRuntime.FMCoreMusicManagerComponent.OnTempoChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FMCoreMusicManagerComponent_OnTempoChanged__DelegateSignature final 
{
public:
	int32                                         Param_CurrentTempo;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction FMCoreRuntime.FMCoreMusicManagerComponent.OnTimeSignatureChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FMCoreMusicManagerComponent_OnTimeSignatureChanged__DelegateSignature final 
{
public:
	struct FFMCoreTimeSignature                   TimeSignature;                                     // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicManagerComponent.TriggerKeyChange
// 0x0001 (0x0001 - 0x0000)
struct FMCoreMusicManagerComponent_TriggerKeyChange final 
{
public:
	EMusicKey                                     InKey;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicManagerComponent.TriggerModeChange
// 0x0001 (0x0001 - 0x0000)
struct FMCoreMusicManagerComponent_TriggerModeChange final 
{
public:
	EMusicKeyMode                                 InMode;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicManagerComponent.TriggerSpeedChange
// 0x0008 (0x0008 - 0x0000)
struct FMCoreMusicManagerComponent_TriggerSpeedChange final 
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalChangeOnly;                                  // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AF7[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMCoreRuntime.FMCoreMusicManagerComponent.TriggerTempoChange
// 0x0008 (0x0008 - 0x0000)
struct FMCoreMusicManagerComponent_TriggerTempoChange final 
{
public:
	int32                                         BPM;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalChangeOnly;                                  // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AF8[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMCoreRuntime.FMCoreMusicManagerComponent.TriggerTimeSignatureChange
// 0x0008 (0x0008 - 0x0000)
struct FMCoreMusicManagerComponent_TriggerTimeSignatureChange final 
{
public:
	int32                                         Numerator;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Denominator;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicManagerComponent.GetCurrentAudioState
// 0x0008 (0x0008 - 0x0000)
struct FMCoreMusicManagerComponent_GetCurrentAudioState final 
{
public:
	EMusicKey                                     OutKey;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMusicKeyMode                                 OutKeyMode;                                        // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AF9[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OutTempo;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicManagerComponent.GetCurrentKey
// 0x0001 (0x0001 - 0x0000)
struct FMCoreMusicManagerComponent_GetCurrentKey final 
{
public:
	EMusicKey                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicManagerComponent.GetCurrentKeyMode
// 0x0001 (0x0001 - 0x0000)
struct FMCoreMusicManagerComponent_GetCurrentKeyMode final 
{
public:
	EMusicKeyMode                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicManagerComponent.GetCurrentSpeed
// 0x0004 (0x0004 - 0x0000)
struct FMCoreMusicManagerComponent_GetCurrentSpeed final 
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicManagerComponent.GetCurrentTempo
// 0x0004 (0x0004 - 0x0000)
struct FMCoreMusicManagerComponent_GetCurrentTempo final 
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMCoreMusicManagerComponent.GetCurrentTimeSignature
// 0x0008 (0x0008 - 0x0000)
struct FMCoreMusicManagerComponent_GetCurrentTimeSignature final 
{
public:
	struct FFMCoreTimeSignature                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// DelegateFunction FMCoreRuntime.FMPlayspaceScopedSystemComponent.OnAddedToPlayspaceSystemManager__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct FMPlayspaceScopedSystemComponent_OnAddedToPlayspaceSystemManager__DelegateSignature final 
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMCoreRuntime.FMPlayspaceScopedSystemManager.GetOrCreateSystemForActorBP
// 0x0020 (0x0020 - 0x0000)
struct FMPlayspaceScopedSystemManager_GetOrCreateSystemForActorBP final 
{
public:
	TSubclassOf<class AActor>                     SystemClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Requester;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OutActor;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESystemGetResult                              OutWasValid;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AFA[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMCoreRuntime.FMPlayspaceScopedSystemManager.GetSystemForActorIfExistsBP
// 0x0020 (0x0020 - 0x0000)
struct FMPlayspaceScopedSystemManager_GetSystemForActorIfExistsBP final 
{
public:
	TSubclassOf<class AActor>                     SystemClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Requester;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OutActor;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESystemGetResult                              OutWasValid;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AFB[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMCoreRuntime.FMPlayspaceScopedSystemManager.MulticastNewSystemCreated
// 0x0018 (0x0018 - 0x0000)
struct FMPlayspaceScopedSystemManager_MulticastNewSystemCreated final 
{
public:
	class AActor*                                 PlayspaceActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     SystemClass;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 CreatedActor;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

