#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMJamCatalogRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "Engine_classes.hpp"
#include "FMCoreRuntime_structs.hpp"
#include "FMJamCoreRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "FMJamCatalogRuntime_structs.hpp"


namespace SDK
{

// Class FMJamCatalogRuntime.FMJamCatalogDeveloperSettings
// 0x0018 (0x0048 - 0x0030)
class UFMJamCatalogDeveloperSettings final  : public UDeveloperSettings
{
public:
	bool                                          bOverrideJamSongLoadout;                           // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8BFA[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           JamSongLoadout;                                    // 0x0038(0x0010)(Edit, EditFixedSize, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMJamCatalogDeveloperSettings">();
	}
	static class UFMJamCatalogDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMJamCatalogDeveloperSettings>();
	}
};

// Class FMJamCatalogRuntime.FMJamLoop
// 0x00F8 (0x0128 - 0x0030)
class UFMJamLoop final  : public UPrimaryDataAsset
{
public:
	TSoftObjectPtr<class UMidiFile>               MidiFileMajor;                                     // 0x0030(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMidiFile>               MidiFileMinor;                                     // 0x0050(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFusionPatch>            FusionPatchMajor;                                  // 0x0070(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFusionPatch>            FusionPatchMinor;                                  // 0x0090(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideDefaultTransposition;                     // 0x00B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8BFB[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EMusicKey, int32>                        Transposes;                                        // 0x00B8(0x0050)(Edit, EditFixedSize, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFMJamSong>              Song;                                              // 0x0108(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	EMusicKey GetKey() const;
	EFMJamLoopType GetLoopType() const;
	void GetMajorMidi(TSoftObjectPtr<class UMidiFile>* OutMetasoundMidi, TSoftObjectPtr<class UFusionPatch>* OutMetasoundFusion) const;
	void GetMidi(EMusicKeyMode Mode, TSoftObjectPtr<class UMidiFile>* OutMetasoundMidi, TSoftObjectPtr<class UFusionPatch>* OutMetasoundFusion) const;
	void GetMinorMidi(TSoftObjectPtr<class UMidiFile>* OutMetasoundMidi, TSoftObjectPtr<class UFusionPatch>* OutMetasoundFusion) const;
	int32 GetSemitoneTranspose(EMusicKey ToKey) const;
	class UFMJamSong* GetSong() const;
	bool HasPitch() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMJamLoop">();
	}
	static class UFMJamLoop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMJamLoop>();
	}
};

// Class FMJamCatalogRuntime.FMJamSong
// 0x00D0 (0x0100 - 0x0030)
class UFMJamSong final  : public UPrimaryDataAsset
{
public:
	class FName                                   SongShortName;                                     // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJamSongSource                                SongDataSource;                                    // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8BFE[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              AlbumArt;                                          // 0x0038(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UEFNLinkCode;                                      // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8BFF[0x8];                                     // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0070(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   Artist;                                            // 0x0080(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                         Year;                                              // 0x0090(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C00[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AdditionalTags;                                    // 0x0098(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EMusicKey                                     Key;                                               // 0x00B8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMusicKeyMode                                 Mode;                                              // 0x00B9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C01[0x2];                                     // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Tempo;                                             // 0x00BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFMJamLoop*                             Lead;                                              // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFMJamLoop*                             Misc;                                              // 0x00C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFMJamLoop*                             Bass;                                              // 0x00D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFMJamLoop*                             Beat;                                              // 0x00D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimSequence>           LipSyncAnimAsset;                                  // 0x00E0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	const struct FGameplayTagContainer GetAdditionalTags() const;
	class FString GetArtist() const;
	EMusicKey GetKey() const;
	const TSoftObjectPtr<class UAnimSequence> GetLipSyncAnimAsset() const;
	class UFMJamLoop* GetLoop(EFMJamLoopType LoopType) const;
	EFMJamLoopType GetLoopTypeForLoop(class UFMJamLoop* Loop) const;
	EMusicKeyMode GetMode() const;
	class FName GetSongShortName() const;
	int32 GetTempo() const;
	class FString GetTitle() const;
	int32 GetYear() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMJamSong">();
	}
	static class UFMJamSong* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMJamSong>();
	}
};

// Class FMJamCatalogRuntime.FMJamSongCatalog
// 0x00B0 (0x0150 - 0x00A0)
class UFMJamSongCatalog final  : public UGameStateComponent
{
public:
	uint8                                         Pad_8C04[0x48];                                    // 0x00A0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UFMJamSong*>          SongsByShortName;                                  // 0x00E8(0x0050)(NativeAccessSpecifierPrivate)
	class USparksSongCatalog*                     CachedCMSCatalog;                                  // 0x0138(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumCMSRetries;                                     // 0x0140(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHaveSongCatalog;                                  // 0x0144(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C05[0xB];                                     // 0x0145(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFMJamSongCatalog* GetFMJamSongCatalog(class UObject* WorldContextObject);
	static EFMJamLoopType GetLoopTypeByTag(struct FGameplayTag& LoopTag);
	static class FText GetLoopTypeText(EFMJamLoopType& LoopType);
	static class UFMJamSongCatalog* TryGetFMJamSongCatalog(class UObject* WorldContextObject);

	void OnSongCatalogRetrieved(bool bSuccess);

	TArray<class UFMJamSong*> GetRandomSongList(int32 NumSongs, struct FGameplayTagQuery& TagQuery) const;
	class UFMJamSong* GetSongByShortName(class FName ShortName) const;
	class UCatalogData* GetSongCatalogEntryByShortName(class FName ShortName) const;
	TArray<class UFMJamSong*> GetSortedSongList(EFMJamSongCatalogSortMethod SortMethod, EFMJamSongCatalogSortDirection SortDirection, struct FGameplayTagQuery& TagQuery) const;
	bool HaveCMSSongCatalog() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMJamSongCatalog">();
	}
	static class UFMJamSongCatalog* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMJamSongCatalog>();
	}
};

// Class FMJamCatalogRuntime.FortJamEmoteItemDefinition
// 0x0008 (0x07A0 - 0x0798)
class UFortJamEmoteItemDefinition final  : public UAthenaDanceItemDefinition
{
public:
	uint32                                        SongIndex;                                         // 0x0798(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReadSongDataFromAllOwnedSongs;                     // 0x079C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C0C[0x3];                                     // 0x079D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetJamSongShortNameForPlayer(class AFortPlayerState* PlayerState) const;
	bool IsJamLoopEnabled(class AFortPlayerController* PlayerController) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortJamEmoteItemDefinition">();
	}
	static class UFortJamEmoteItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortJamEmoteItemDefinition>();
	}
};

}

