#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMJamPlayspaceRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "FMJamCoreRuntime_structs.hpp"
#include "FMJamPlayspaceRuntime_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SparksMusicPlayspaceRuntime_classes.hpp"
#include "FMCoreRuntime_structs.hpp"
#include "GameplayEventRouter_structs.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class FMJamPlayspaceRuntime.JamAnalytics
// 0x00A0 (0x0148 - 0x00A8)
class UJamAnalytics final  : public UFortControllerComponent
{
public:
	uint8                                         Pad_8C1C[0x40];                                    // 0x00A8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinLoopLength;                                     // 0x00E8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         LoopStartTime;                                     // 0x0110(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LoopLength;                                        // 0x0114(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   LoopShortName;                                     // 0x0118(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C1D[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LoopType;                                          // 0x0120(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 LoopID;                                            // 0x0130(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AJamPlayspace*                          JamPlayspace;                                      // 0x0140(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamAnalytics">();
	}
	static class UJamAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamAnalytics>();
	}
};

// Class FMJamPlayspaceRuntime.JamMidiEventDriver
// 0x0020 (0x0048 - 0x0028)
class UJamMidiEventDriver final  : public UObject
{
public:
	uint8                                         Pad_8C1E[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UJamMusicSlot>           WeakOwningMusicSlotPtr;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParsedMidiEventData*                   ParsedMidiEventData;                               // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C1F[0x8];                                     // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamMidiEventDriver">();
	}
	static class UJamMidiEventDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamMidiEventDriver>();
	}
};

// Class FMJamPlayspaceRuntime.JamPlayspace
// 0x0068 (0x0858 - 0x07F0)
class AJamPlayspace final  : public ASparksMusicPlayspace
{
public:
	uint8                                         Pad_8C20[0x18];                                    // 0x07F0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UJamPlayspaceComponent_MusicManager*    MusicManager;                                      // 0x0808(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C21[0x18];                                    // 0x0810(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UJamPlayspaceComponent_LipSyncAssetManager* JamLipSyncManager;                                 // 0x0828(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJamPlayspaceComponent_ReactiveFX*      ReactiveFXComponent;                               // 0x0830(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C22[0x20];                                    // 0x0838(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginShutdownJam();
	void ConvertPlayerToAutoJammer(class APlayerState* PlayerState);
	class UAudioComponent* GetJamAudioSource();
	void PlayLoop(class APlayerState* PlayerState, class FName SongShortName, EFMJamLoopType LoopType, bool bForceAudioState, bool bIsAutoJammer);
	void StopAllLoops(bool bStopAutoJammers);
	void StopAllLoopsForLoopType(EFMJamLoopType LoopType);
	void StopAutoJammersForPlayer(class APlayerState* PlayerState);
	void StopLoopByInstanceId(int32 LoopInstanceId);
	void StopLoopForPlayer(class APlayerState* PlayerState, bool bStopAutoJammers);

	int32 CountActiveLoops(bool bCountAutoJammers) const;
	bool DoAnyOtherJammersHaveGameplayTag(class APlayerState* LocalPlayerState, const struct FGameplayTag& GlobalControlsTag) const;
	void GetAllowGlobalControlAccess(bool* OutAllowGlobalControlAccess, struct FGameplayTagContainer* OutRestrictionReason) const;
	TArray<class APlayerState*> GetJammers() const;
	class UJamMusicSlot* GetMusicSlotForPlayer(class APlayerState* PlayerState) const;
	TArray<class UJamMusicSlot*> GetMusicSlots() const;
	TArray<class UJamMusicSlot*> GetMusicSlotsForLoopType(EFMJamLoopType LoopType) const;
	TArray<class UJamMusicSlot*> GetMusicSlotsInUse() const;
	TArray<class UJamMusicSlot*> GetMusicSlotsSortedByLoopType() const;
	bool IsJamFull(bool bCountAutoJammers) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamPlayspace">();
	}
	static class AJamPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJamPlayspace>();
	}
};

// Class FMJamPlayspaceRuntime.JamPlayspaceComponent_LipSyncAssetManager
// 0x0028 (0x00F0 - 0x00C8)
class UJamPlayspaceComponent_LipSyncAssetManager final  : public UPlayspaceComponent_LipSyncAssetManager
{
public:
	uint8                                         Pad_8C29[0x28];                                    // 0x00C8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamPlayspaceComponent_LipSyncAssetManager">();
	}
	static class UJamPlayspaceComponent_LipSyncAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamPlayspaceComponent_LipSyncAssetManager>();
	}
};

// Class FMJamPlayspaceRuntime.JamMusicSlot
// 0x00A0 (0x00C8 - 0x0028)
class UJamMusicSlot final  : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnLoopStarted;                                     // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLoopStopped;                                     // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UMidiFile*                              CurrentMidiFile;                                   // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFusionPatch*                           CurrentFusionPatch;                                // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USparksJamEmoteItemDefinition*          CurrentItemDef;                                    // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJamMidiEventDriver*                    MidiEventDriver;                                   // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAttemptingResolveAndLoad;                         // 0x0068(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C2A[0x27];                                    // 0x0069(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJamPlayParams                         CurrentPlayParams;                                 // 0x0090(0x0028)(Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UJamPlayspaceComponent_MusicManager*    JamMusicManager;                                   // 0x00B8(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NthSlot;                                           // 0x00C0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C2B[0x4];                                     // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCMSCatalogRequestFinished(class UFMJamSongCatalog* Sender, bool bSuccess);
	void OnJamLoadRequestComplete(struct FJamLoadResult& LoadResult);
	void OnJamResolverComplete(class UJamContentResolver* Sender, const class FString& LinkCode, bool bSuccess, bool bWasAlreadyLoaded);
	void OnRep_CurrentPlayParams(struct FJamPlayParams& OldPlayParams);
	void OnScanForSongsCompleted(class UFMJamSongCatalog* Sender, const TArray<class UFMJamSong*>& AddedSongs);
	void OnTerminatingLinkCode(class UJamContentResolver* Sender, const class FString& LinkCode);

	const class UCatalogData* GetCurrentCatalogEntry() const;
	EMusicKey GetCurrentKey() const;
	const class UFMJamLoop* GetCurrentLoop() const;
	int32 GetCurrentLoopInstanceId() const;
	EFMJamLoopType GetCurrentLoopType() const;
	EMusicKeyMode GetCurrentMode() const;
	class APlayerState* GetCurrentPlayerState() const;
	const class UFMJamSong* GetCurrentSong() const;
	class FString GetCurrentSongLinkCode() const;
	class FName GetCurrentSongShortName() const;
	int32 GetCurrentTempo() const;
	bool GetIsAutoJammer() const;
	class UJamPlayspaceComponent_MusicManager* GetMusicManager() const;
	const struct FJamEvent_JamLoopStarted GetParamsAsJamEvent() const;
	const struct FJamPlayParams GetPlayParams() const;
	bool IsInUse() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamMusicSlot">();
	}
	static class UJamMusicSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamMusicSlot>();
	}
};

// Class FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager
// 0x00D0 (0x0170 - 0x00A0)
class UJamPlayspaceComponent_MusicManager final  : public UPlayspaceComponent
{
public:
	FMulticastInlineDelegateProperty_             OnLoopStarted;                                     // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnLoopStopped;                                     // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UJamMusicSlot*>                  MusicSlots;                                        // 0x00C0(0x0010)(Net, ZeroConstructor, RepNotify, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayEventListenerHandle           KeyChangedEventHandle;                             // 0x00D0(0x001C)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayEventListenerHandle           ModeChangedEventHandle;                            // 0x00EC(0x001C)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayEventListenerHandle           TempoChangedEventHandle;                           // 0x0108(0x001C)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C2E[0x24];                                    // 0x0124(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LocalPlayerGainParam;                              // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StandardGainParam;                                 // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C2F[0x20];                                    // 0x0150(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool IsAllowedToJamInSplitscreen(class APlayerState* PlayerStateToCheck);

	void FireGlobalControlsAnalytics(class APlayerState* PlayerState);
	void HandleKeyChangedEvent(struct FSparksPlayspaceEvent_KeyChanged& Payload);
	void HandleModeChangedEvent(struct FSparksPlayspaceEvent_KeyModeChanged& Payload);
	void HandleOnLoopStarted(struct FJamPlayParams& PlayParams, bool bChangedLoop);
	void HandleOnLoopStopped(struct FJamPlayParams& PlayParams, bool bChangedLoop);
	void HandleTempoChangedEvent(struct FSparksPlayspaceEvent_TempoChanged& Payload);
	void OnLicensedAudioTreatmentChanged();
	void OnPlayspaceUserAdded(struct FPlayspaceUser* AddedUser);
	void OnPlayspaceUserRemoved(struct FPlayspaceUser* RemovedUser);
	void OnRep_MusicSlots(TArray<class UJamMusicSlot*>& PreviousMusicSlots);
	void UpdateAllMetasounds(class APlayerState* PlayerToIgnore);

	int32 CountActiveSlots(bool bCountAutoJammers) const;
	TArray<class APlayerState*> GetAllJammers() const;
	TArray<class UJamMusicSlot*> GetAllMusicSlots() const;
	TArray<class UJamMusicSlot*> GetAutoJammersForPlayer(class APlayerState* PlayerState) const;
	EMusicKey GetCurrentKey() const;
	float GetCurrentMidiSeconds() const;
	int32 GetCurrentMidiTick() const;
	EMusicKeyMode GetCurrentMode() const;
	int32 GetCurrentTempo() const;
	float GetDesiredGain(class APlayerState* PlayerState) const;
	class AJamPlayspace* GetJamPlayspace() const;
	class USparksInstrumentAnimations* GetLoadedAnimations() const;
	float GetLocalPlayerGainValue() const;
	class UAudioComponent* GetMetasoundPlayer() const;
	class UJamMusicSlot* GetMusicSlotByLoopInstanceId(int32 LoopInstanceId) const;
	class UJamMusicSlot* GetMusicSlotBySlotIndex(int32 SlotIndex) const;
	class UJamMusicSlot* GetMusicSlotForPlayer(class APlayerState* PlayerState) const;
	int32 GetMusicSlotIndexForLoopInstanceId(int32 LoopInstanceId) const;
	int32 GetMusicSlotIndexForPlayer(class APlayerState* PlayerState) const;
	TArray<class UJamMusicSlot*> GetMusicSlotsForLoopType(EFMJamLoopType LoopType) const;
	TArray<class UJamMusicSlot*> GetMusicSlotsInUse() const;
	float GetStandardGainValue() const;
	int32 SecondsToTick(float Seconds) const;
	bool ShouldPlayLocalSound(class APlayerState* PlayerToIgnore) const;
	float TickToSeconds(int32 Tick) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamPlayspaceComponent_MusicManager">();
	}
	static class UJamPlayspaceComponent_MusicManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamPlayspaceComponent_MusicManager>();
	}
};

// Class FMJamPlayspaceRuntime.JamPlayspaceComponent_ReactiveFX
// 0x0110 (0x01B0 - 0x00A0)
class UJamPlayspaceComponent_ReactiveFX final  : public UPlayspaceComponent
{
public:
	struct FJamReactiveFXState                    ReactiveFXState;                                   // 0x00A0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, DuplicateTransient, NativeAccessSpecifierPublic)
	bool                                          bSetReactivityUpdateRateToTargetFPS;               // 0x00C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C3A[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReactivityUpdateRate;                              // 0x00CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PeakTamerValueReleaseTimeSec;                      // 0x00D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C3B[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FJamLoopReactiveFX>        LoopReactiveFX;                                    // 0x00D8(0x0050)(Edit, Transient, EditConst, DuplicateTransient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C3C[0x88];                                    // 0x0128(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddReactiveNiagaraEffect(int32 LoopInstanceId, class UNiagaraComponent* NiagaraComponent);
	void ClearReactiveEffects(bool bStopEffectsImmediately);
	void ClearReactiveEffectsForLoop(int32 LoopInstanceId, bool bStopEffectsImmediately);
	bool HasReactiveEffectsForLoop(int32 LoopInstanceId);
	bool RemoveReactiveNiagaraEffect(int32 LoopInstanceId, class UNiagaraComponent* NiagaraComponent);

	TArray<class UNiagaraComponent*> GetReactiveNiagaraEffects(int32 LoopInstanceId) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamPlayspaceComponent_ReactiveFX">();
	}
	static class UJamPlayspaceComponent_ReactiveFX* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamPlayspaceComponent_ReactiveFX>();
	}
};

// Class FMJamPlayspaceRuntime.JamPlayspaceVolume
// 0x0000 (0x0330 - 0x0330)
class AJamPlayspaceVolume final  : public AGameplayVolume
{
public:
	void BP_UpdateReactiveFX(float JamAmplitude);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamPlayspaceVolume">();
	}
	static class AJamPlayspaceVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJamPlayspaceVolume>();
	}
};

// Class FMJamPlayspaceRuntime.JamQuickplayPlayerSpawningComponent
// 0x0020 (0x00D0 - 0x00B0)
class UJamQuickplayPlayerSpawningComponent final  : public UPlayspaceComponent_PlayerSpawning
{
public:
	struct FGameplayTagContainer                  PregameSpawnTags;                                  // 0x00B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamQuickplayPlayerSpawningComponent">();
	}
	static class UJamQuickplayPlayerSpawningComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamQuickplayPlayerSpawningComponent>();
	}
};

}

