#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FN_TimedNiagaraNotify

#include "Basic.hpp"

#include "AnimCurveParameterPair_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FN_TimedNiagaraNotify.FN_TimedNiagaraNotify_C
// 0x0020 (0x00A8 - 0x0088)
class UFN_TimedNiagaraNotify_C : public UFortAnimNotifyState_TimedNiagaraEffectVariant
{
public:
	bool                                          Print_Debug;                                       // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Glider_Deploy_Notify;                           // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Set_in_Water_Niagara_Variable;                     // 0x008A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CDB6[0x5];                                     // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAnimCurveParameterPair>        AnimCurveParameterPair;                            // 0x0090(0x0010)(Edit, BlueprintVisible)
	bool                                          IsLargeBodyPawn;                                   // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Absolute_Scale;                                    // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cast_Shadow;                                       // 0x00A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CDB7[0x1];                                     // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Translucency_Sort_Distance_Offset;                 // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime, struct FAnimNotifyEventReference& EventReference, const struct FAnimCurveParameterPair& CuurveParameterPair, class UNiagaraComponent* NiagaraSystem, const struct FVector& WaterSurfaceNormal, const struct FVector& WaterSurfaceLocation, double WaterImmersionDepth, int32 WaveParamTextureOffset, bool bIsInWater, class UFortMovementComp_Character* FortMovementComp, class APlayerPawn_Athena_C* Player_Pawn, bool CallFunc_IsValid_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena, bool K2Node_DynamicCast_bSuccess, class UFXSystemComponent* CallFunc_GetSpawnedEffect_ReturnValue, class UNiagaraComponent* K2Node_DynamicCast_AsNiagara_Particle_System_Component, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue_1, const struct FVector& CallFunc_GetWaterSurfaceNormal_ReturnValue, const struct FVector& CallFunc_GetWaterSurfaceLocation_ReturnValue, float CallFunc_GetWaterImmersionDepth_ReturnValue, bool CallFunc_IsSurfaceSwimming_ReturnValue, class AFortWaterBodyActor* CallFunc_GetCurrentWaterBody_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, class AFortWaterBodyActor* CallFunc_GetCurrentWaterBody_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, class AFortWaterBodyActor* CallFunc_GetCurrentWaterBody_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, class AFortWaterBodyActor* CallFunc_GetCurrentWaterBody_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, int32 CallFunc_Array_Length_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, int32 Temp_int_Array_Index_Variable, const struct FAnimCurveParameterPair& CallFunc_Array_Get_Item, int32 Temp_int_Loop_Counter_Variable, float CallFunc_GetCurveValue_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UFortMovementComp_Character* K2Node_DynamicCast_AsFort_Movement_Comp_Character, bool K2Node_DynamicCast_bSuccess_2, double K2Node_VariableSet_waterImmersionDepth_ImplicitCast, float CallFunc_SetVariableFloat_InValue_ImplicitCast, float CallFunc_SetVariableFloat_InValue_ImplicitCast_1) const;
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, struct FAnimNotifyEventReference& EventReference, class APlayerPawn_Athena_C* PlayerPawn, const struct FAnimCurveParameterPair& CurveNameParameterPair, const struct FParticleSysParam& ParticleParams, class UNiagaraComponent* NiagaraSystem, bool bisFrontEnd, class AActor* CallFunc_GetOwner_ReturnValue, class UFXSystemComponent* CallFunc_GetSpawnedEffect_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsInFrontEndHologram_ReturnValue, class UNiagaraComponent* K2Node_DynamicCast_AsNiagara_Particle_System_Component, bool K2Node_DynamicCast_bSuccess_1, class FName Temp_name_Variable, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_IsCosmeticObjectDisplayedInFrontendContext_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FN_TimedNiagaraNotify_C">();
	}
	static class UFN_TimedNiagaraNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFN_TimedNiagaraNotify_C>();
	}
};

}

