#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortRadioButtonGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortRadioButtonItemStruct_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortRadioButtonGroup.FortRadioButtonGroup_C
// 0x0068 (0x0330 - 0x02C8)
class UFortRadioButtonGroup_C final  : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_Buttons;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Buttons;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FFortRadioButtonItemStruct>     Buttons;                                           // 0x02E0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class UIconTextButton_C*>              CreatedButtons;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             RadioButtonClicked_Event;                          // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        WidthOverride;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonGroupLegacy*               CreatedButtonsGroup;                               // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CommonButtonGroup;                                 // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        HeightOverride;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CenterOnWidget(class UIconTextButton_C* CallFunc_Array_Get_Item);
	void Destruct();
	void ExecuteUbergraph_FortRadioButtonGroup(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, const struct FFortRadioButtonItemStruct& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UIconTextButton_C* CallFunc_Create_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue, class UVerticalBoxSlot* K2Node_DynamicCast_AsVertical_Box_Slot, bool K2Node_DynamicCast_bSuccess, const struct FSlateChildSize& K2Node_MakeStruct_SlateChildSize, class UCommonButtonLegacy* K2Node_CustomEvent_AssociatedButton, int32 K2Node_CustomEvent_ButtonIndex, TDelegate<void(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate, class UCommonButtonGroupLegacy* CallFunc_SpawnObject_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast, float CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast);
	void OnButtonClicked_Bind(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex);
	void RadioButtonClicked_Event__DelegateSignature(int32 SelectedIndex);
	void UpdateButtons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortRadioButtonGroup_C">();
	}
	static class UFortRadioButtonGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRadioButtonGroup_C>();
	}
};

}

