#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_SCMachine_Passive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_SCMachine_Passive.GA_Athena_SCMachine_Passive_C
// 0x0080 (0x0BC8 - 0x0B48)
class UGA_Athena_SCMachine_Passive_C final  : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x0B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnZOffset;                                      // 0x0B58(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BlockChipSpawnTag;                                 // 0x0B70(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B169[0x4];                                     // 0x0B74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DropRebootCards;                                   // 0x0B78(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ShouldAutoCollectCards;                            // 0x0BA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AutoCollectCardsOnOceanKill(class AFortPlayerPawnAthena* Pawn, double ZPos, bool* Hit_Ocean, struct FTransform* Teamate_Transform, class AFortGameStateAthena* CallFunc_GetGameStateAthenaFromContext_ReturnValue, int32 Temp_int_Array_Index_Variable, class AFortPlayerStateAthena* K2Node_DynamicCast_AsFort_Player_State_Athena, bool K2Node_DynamicCast_bSuccess, TArray<class AFortPlayerStateAthena*>& CallFunc_GetSquadMemberPlayerStates_ReturnValue, int32 Temp_int_Loop_Counter_Variable, class AFortPlayerStateAthena* CallFunc_Array_Get_Item, class APawn* CallFunc_GetPawn_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena, bool K2Node_DynamicCast_bSuccess_1, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_IsDead_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class AAsteria_Waterbody_Ocean_Parent_C* CallFunc_GetActorOfClass_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, bool CallFunc_LessEqual_DoubleDouble_ReturnValue);
	bool AutoCollectCardsOverride(bool CallFunc_IsSettingCurveValid_ReturnValue, bool CallFunc_GetValueAsBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void Check_Resurrection_Active(bool* bEnabled, bool PlaylistValid, class FName TestPlaylist, class AGameStateBase* CallFunc_GetGameState_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UFortGameStateComponent_Reboot* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsResurrectionEnabled_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void CheckPlayerChipSpawnEnabled(bool* IsChipSpawnEnabled, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void ExecuteUbergraph_GA_Athena_SCMachine_Passive(int32 EntryPoint, uint8 CallFunc_GetActorTeam_ReturnValue, struct FTransform& CallFunc_GetTransform_ReturnValue, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, bool CallFunc_IsValid_ReturnValue, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, bool CallFunc_AutoCollectCardsOnOceanKill_Hit_Ocean, const struct FTransform& CallFunc_AutoCollectCardsOnOceanKill_Teamate_Transform, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, bool CallFunc_Check_Resurrection_Active_bEnabled, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateZone* K2Node_DynamicCast_AsFort_Game_State_Zone, bool K2Node_DynamicCast_bSuccess, bool CallFunc_CheckPlayerChipSpawnEnabled_IsChipSpawnEnabled, bool CallFunc_BooleanAND_ReturnValue, class AFortPlayerState* K2Node_DynamicCast_AsFort_Player_State, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsRespawningAllowed_ReturnValue, bool CallFunc_GetValueAsBoolWithContext_ReturnValue, struct FGameplayEventData& K2Node_Event_EventData, bool CallFunc_AutoCollectCardsOverride_ReturnValue, bool CallFunc_HasTag_ReturnValue, bool Temp_bool_Variable, const struct FTransform& K2Node_Select_Default, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABGA_Athena_SCMachine_Pickup_C* CallFunc_FinishSpawningActor_ReturnValue);
	void K2_ActivateAbilityFromEvent(struct FGameplayEventData& EventData);
	void SaveOutPlayer(class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess);
	void Spawn();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_SCMachine_Passive_C">();
	}
	static class UGA_Athena_SCMachine_Passive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_SCMachine_Passive_C>();
	}
};

}

