#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NPC_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Enum_NPC_AlertLevel_structs.hpp"
#include "Enum_NPC_ModifyAlertLevelReason_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_NPC_Parent.GA_NPC_Parent_C
// 0x0390 (0x0ED8 - 0x0B48)
class UGA_NPC_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortAIPawn*                            NPC_ActivatingFortAIPawn;                          // 0x0B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EFortMovementUrgency                          NPC_InitialMovementUrgency;                        // 0x0B58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_DebugAbility;                                  // 0x0B59(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E48[0x6];                                     // 0x0B5A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  NPC_IgnoreDamageAndOnlyDoKnockbackIfTheseAbilitiesAreActive; // 0x0B60(0x0020)(Edit, BlueprintVisible)
	bool                                          NPC_DebugFreezeFrameEnabled;                       // 0x0B80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_DebugFreezeFrameOnlyWhenAbilityTargetHit;      // 0x0B81(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_DebugFreezeFrameOnlyWhenWeHaveSomeTarget;      // 0x0B82(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_DamageHitAbilityTargetDuringThisAbilityActivation; // 0x0B83(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E49[0x4];                                     // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         NPC_DamageActorsWeHaveHitDuringThisAbilityActivation; // 0x0B88(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          NPC_CanActivateAbility_AbilityTargetTeamAffiliationCanBeNeutral; // 0x0B98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_CanActivateAbility_AbilityTargetTeamAffiliationCanBeFriendly; // 0x0B99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_CanActivateAbility_AbilityTargetTeamAffiliationCanBeHostile; // 0x0B9A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E4A[0x5];                                     // 0x0B9B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NPC_CanActivateAbility_MaxTargetZDistanceBelow;    // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NPC_CanActivateAbility_MaxTargetZDistanceAbove;    // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NPC_CanActivateAbility_MaxTargetZDistanceAbove_ForIntentionalFailedAttack; // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         BuildingTargetingHitActors;                        // 0x0BB8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FScalableFloat                         NPC_CanBuildMovementFrustrationAtAllHF;            // 0x0BC8(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_CanBuildGoalFrustrationAtAllHF;                // 0x0BF0(0x0028)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  TC_NPC_FrustrationTagsToClearForGoals;             // 0x0C18(0x0020)(Edit, BlueprintVisible)
	Enum_NPC_AlertLevel                           NPC_AlertLevelGoalIsFortPawn;                      // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_NPC_AlertLevel                           NPC_AlertLevelGoalIsOther;                         // 0x0C39(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_NPC_AlertLevel                           NPC_AlertLevelGoalIsNotValid;                      // 0x0C3A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E4B[0x5];                                     // 0x0C3B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         NPC_DamageKnockbackVelocityHF;                     // 0x0C40(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageKnockbackVerticalAngleHF;                // 0x0C68(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageKnockbackMinimumYawValueHF;              // 0x0C90(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageCanAttackDBNOPlayersHF;                  // 0x0CB8(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageKnockbackVelocityVehicleHF;              // 0x0CE0(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageKnockbackVerticalAngleVehicleHF;         // 0x0D08(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageKnockbackMinimumYawValueVehicleHF;       // 0x0D30(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageChanceToEjectFromVehicleHF;              // 0x0D58(0x0028)(Edit, BlueprintVisible)
	struct FGameplayTag                           DestroyBuildingGC;                                 // 0x0D80(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E4C[0x4];                                     // 0x0D84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DestroyBuildingGE;                                 // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_NPC_FrustrationTagsToClearForMovement;          // 0x0D90(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTag                           TC_NPC_FrustrationBuildDueToGoal;                  // 0x0DB0(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TC_NPC_FrustrationBuildDueToMovement;              // 0x0DB4(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      TQ_NPC_RequirementsToBuildFrustrationDueToGoal;    // 0x0DB8(0x0048)(Edit, BlueprintVisible)
	struct FGameplayTagQuery                      TQ_NPC_RequirementsToBuildFrustrationDueToMovement; // 0x0E00(0x0048)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_BodyBumpBuildingsWhenBuildingMovementFrustrationHF; // 0x0E48(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_FrustrationBodyBumpOnlyDestroyPlayerBuildingsHF; // 0x0E70(0x0028)(Edit, BlueprintVisible)
	struct FGameplayTag                           TC_NPC_EffectContainer_BodyBumpBuildingsWhenBuildingMovementFrustration; // 0x0E98(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E4D[0x4];                                     // 0x0E9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       BuildingTargetingTargetData;                       // 0x0EA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           BuildingTargetingApplicationTag;                   // 0x0EC8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TC_BuildingTypePlayer;                             // 0x0ECC(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_NPC_MMR_Scaling_AbilityCooldown;                // 0x0ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BeginDestroyBuildings(const struct FGameplayTag& TargetSelectionApplicationTag, bool DoContinuousTargetSelection);
	void Cancelled_13B12ED64A3570FC1E117FAC4E3F7961(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
