#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HarmonixAudioReactivity

#include "Basic.hpp"

#include "HarmonixDsp_structs.hpp"


namespace SDK
{

// Enum HarmonixAudioReactivity.EHarmonixAudioAnalysisType
// NumValues: 0x0006
enum class EHarmonixAudioAnalysisType : uint8
{
	VUMeter                                  = 0,
	FFT                                      = 1,
	Waveform                                 = 2,
	Arbitrary                                = 3,
	Count                                    = 4,
	EHarmonixAudioAnalysisType_MAX           = 5,
};

// Enum HarmonixAudioReactivity.EHarmonixTextureFilterMode
// NumValues: 0x0005
enum class EHarmonixTextureFilterMode : uint8
{
	Point                                    = 0,
	Linear                                   = 1,
	Count                                    = 2,
	Invalid                                  = 3,
	EHarmonixTextureFilterMode_MAX           = 4,
};

// ScriptStruct HarmonixAudioReactivity.HarmonixAudioAnalyzerResults
// 0x0060 (0x0060 - 0x0000)
struct FHarmonixAudioAnalyzerResults final 
{
public:
	struct FHarmonixVuMeterAnalyzerResults        VuMeterResults;                                    // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FHarmonixFFTAnalyzerResults            FFTResults;                                        // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FHarmonixWaveformAnalyzerResults       WaveformAnalyzerResults;                           // 0x0030(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<float>                                 ArbitraryTextureData;                              // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct HarmonixAudioReactivity.HarmonixAudioAnalyzerSettings
// 0x0050 (0x0050 - 0x0000)
struct FHarmonixAudioAnalyzerSettings final 
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHarmonixVuMeterAnalyzerSettings       VuMeterSettings;                                   // 0x0004(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FHarmonixFFTAnalyzerSettings           FFTAnalyzerSettings;                               // 0x001C(0x0024)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FHarmonixWaveformAnalyzerSettings      WaveformAnalyzerSettings;                          // 0x0040(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

}

