#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoudiniInstanceDataLayout

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct HoudiniInstanceDataLayout.HoudiniInstanceDataLayout
// 0x001C (0x001C - 0x0000)
struct FHoudiniInstanceDataLayout final 
{
public:
	float                                         Px_4_F5C0CE7F4E57E0634EEBA7986A38B75B;             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Py_7_462CEB644FCF8818190E0DA7A4233236;             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pz_8_488530224541EBF7D43F2F99AE2CCEAF;             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Nx_18_51E5EF044A718D85E72395AA9D96475D;            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ny_22_85D94369412DF832716FAD9638F05274;            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Nz_23_267E08D5410B2BAA799B67975DE79784;            // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pscale_24_C1C793994E739F1A41356ABC35528C18;        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

