#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizedPropSpawnerParentRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "ItemizedPropSpawnerParentRuntime_structs.hpp"


namespace SDK
{

// Class ItemizedPropSpawnerParentRuntime.FortGameplayAbility_RangedPropSpawner
// 0x0008 (0x0B90 - 0x0B88)
class UFortGameplayAbility_RangedPropSpawner final  : public UFortGameplayAbility_RangedWeapon
{
public:
	bool                                          bRevertAmmoNumberForRejection;                     // 0x0B88(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_932D[0x7];                                     // 0x0B89(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAbilityRejectedOnClient(class AFortWeapon* SourceWeapon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_RangedPropSpawner">();
	}
	static class UFortGameplayAbility_RangedPropSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_RangedPropSpawner>();
	}
};

// Class ItemizedPropSpawnerParentRuntime.FortWeaponRangedPropSpawner
// 0x0008 (0x1D60 - 0x1D58)
class AFortWeaponRangedPropSpawner final  : public AFortWeaponRanged
{
public:
	bool                                          bForceSyncAmmoForLocalPropSpawnerWeapon;           // 0x1D58(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_932E[0x7];                                     // 0x1D59(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortWeaponRangedPropSpawner">();
	}
	static class AFortWeaponRangedPropSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortWeaponRangedPropSpawner>();
	}
};

// Class ItemizedPropSpawnerParentRuntime.SereneYardAnimInstanceProxy
// 0x0030 (0x13C0 - 0x1390)
class USereneYardAnimInstanceProxy final  : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsUpperBody;                                      // 0x1388(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGrindRail;                                        // 0x1389(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireToSprint;                                // 0x138A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireToIdle;                                  // 0x138B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireFallStart;                               // 0x138C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireFallEnd;                                 // 0x138D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireFullBodyGround;                          // 0x138E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFire;                                        // 0x138F(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIceFireUpperBody;                               // 0x1390(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFromIceFireEndStates;                           // 0x1391(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTrFromFireEndIdle;                              // 0x1392(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTrFromFireEndLoco;                              // 0x1393(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFireExitUnexpectedly;                           // 0x1394(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFireEndExitUnexpectedly;                        // 0x1395(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_932F[0x2];                                     // 0x1396(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               UpperBodyTwistRotator;                             // 0x1398(0x0018)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         TurnEndThreshold;                                  // 0x13B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnEndLocoThreshold;                              // 0x13B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnVelocityZThreshold;                            // 0x13B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterruptibleThreshold;                            // 0x13BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SereneYardAnimInstanceProxy">();
	}
	static class USereneYardAnimInstanceProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<USereneYardAnimInstanceProxy>();
	}
};

// Class ItemizedPropSpawnerParentRuntime.EmeraldGlassIceWallChunk
// 0x0018 (0x0BE8 - 0x0BD0)
class AEmeraldGlassIceWallChunk final  : public ABuildingProp
{
public:
	TWeakObjectPtr<class AEmeraldGlassIceWallChunk> ParentChunk;                                       // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           IceWallActorClassDenyList;                         // 0x0BD8(0x0010)(ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void AttachActors(TArray<class AEmeraldGlassIceWallChunk*>& ChunksInMyWall, TArray<class AActor*>& SupportingActors, class AActor* DirectBase);
	void FindSupportingActors(TArray<class AActor*>& InOutSupportingActors, bool bAllowIceWallsAsSupportingActors, TArray<class AEmeraldGlassIceWallChunk*>& ChunksInMyWall);
	void GetComponentsForOverlapCheck(TArray<class UPrimitiveComponent*>* OutComponents);
	void NativeCheckOverlappedActor(struct FSereneYardOverlappedActorCheckData& CheckData, class AActor* OverlappedActor, TArray<class UCapsuleComponent*>& InOutComponentsSetToIgnoreCollision, bool& bInOutShouldPlayImpulseCue, bool* bOutDestroyOverlappedActor, bool* bOutShouldWaitATick, bool* bOutDestroyProp);
	bool NativeShouldActorBlockSpawn(class AActor* Actor, bool bShouldLaunch, struct FGameplayTag& BlockTag);
	bool NativeShouldDestroyOverlappedActor(class AActor* Actor, struct FGameplayTagContainer& TagsToDestroyOverlappedActor);

	bool IsIceWallAllowedToOverlapActor(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmeraldGlassIceWallChunk">();
	}
	static class AEmeraldGlassIceWallChunk* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEmeraldGlassIceWallChunk>();
	}
};

// Class ItemizedPropSpawnerParentRuntime.FortControllerComponent_SereneYard
// 0x0010 (0x00B0 - 0x00A0)
class UFortControllerComponent_SereneYard final  : public UControllerComponent
{
public:
	TArray<TWeakObjectPtr<class ABuildingGameplayActor>> TrackedInstances;                                  // 0x00A0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void AddTrackedInstance(class ABuildingGameplayActor* TrackedInstance);
	void RemoveOldestTrackedInstance();

	class ABuildingGameplayActor* GetOldestTrackedInstance() const;
	int32 GetTrackedInstanceCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_SereneYard">();
	}
	static class UFortControllerComponent_SereneYard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_SereneYard>();
	}
};

// Class ItemizedPropSpawnerParentRuntime.ItemizedPropSpawnerMultiPropSpawner
// 0x0000 (0x0980 - 0x0980)
class AItemizedPropSpawnerMultiPropSpawner final  : public ABuildingGameplayActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizedPropSpawnerMultiPropSpawner">();
	}
	static class AItemizedPropSpawnerMultiPropSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItemizedPropSpawnerMultiPropSpawner>();
	}
};

// Class ItemizedPropSpawnerParentRuntime.SereneYardFunctionLibraryNative
// 0x0000 (0x0028 - 0x0028)
class USereneYardFunctionLibraryNative final  : public UBlueprintFunctionLibrary
{
public:
	static void BuildPropDataForWeaponData(TArray<struct FNativeItemizedPropSpawner_PropSpawnData>& PropSpawnDataArray, TArray<struct FTransform>* PropRelativeTransforms, TMap<ESereneYardChunkLocation, int32>* ChunkLocationToPropIndexMap);
	static bool NativeCheckSpawnValidity(struct FSereneYardWeaponData& WeaponData, struct FVector& InOutTargetLocation, float CameraYaw, bool bCheckForAllChunks, TArray<bool>* OutValidity, TArray<double>* OutOffsets, TArray<class AActor*>* OutActorsBeingUsedAsBase, ESereneYardTargetingFailedReason* OutFailureReason);
	static bool NativeUpdateTarget(struct FSereneYardWeaponData& WeaponData, struct FVector* OutTargetLocation, ESereneYardTargetingFailedReason* OutFailureReason, TArray<bool>* OutValidity);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SereneYardFunctionLibraryNative">();
	}
	static class USereneYardFunctionLibraryNative* GetDefaultObj()
	{
		return GetDefaultObjImpl<USereneYardFunctionLibraryNative>();
	}
};

}

