#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemAnimLayerInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemAimOffset
// 0x0048 (0x0048 - 0x0000)
struct ItemAnimLayerInterface_C_ItemAimOffset final 
{
public:
	struct FPoseLink                              InPose_AimOffset;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        AimOffsetAlpha;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Yaw;                                               // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Pitch;                                             // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              InPose_UpperLowerPreMeleeAO;                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemAimOffset;                               // 0x0038(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemFallAdditive
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemFallAdditive final 
{
public:
	struct FPoseLink                              InPoseItemFallAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemFallAdditive;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemFallLandAdditive
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemFallLandAdditive final 
{
public:
	struct FPoseLink                              InPoseItemFallLandAdditive;                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemFallLandAdditive;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemFinalPoseOverride
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemFinalPoseOverride final 
{
public:
	struct FPoseLink                              InFinalPose;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemFinalPoseOverride;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemFullBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemFullBodyOverride final 
{
public:
	struct FPoseLink                              InPoseFullBody;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemFullBodyOverride;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemIdleAdditive
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemIdleAdditive final 
{
public:
	struct FPoseLink                              InPoseIdleAdditive;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemIdleAdditive;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJetPackJumpAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJetPackJumpAdditive final 
{
public:
	struct FPoseLink                              Param_ItemJetPackJumpAdditive;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJetPackStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJetPackStartAdditive final 
{
public:
	struct FPoseLink                              Param_ItemJetPackStartAdditive;                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJumpLoopAdditive
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJumpLoopAdditive final 
{
public:
	struct FPoseLink                              InPoseItemJumpLoopAdditive;                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJumpLoopAdditive;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemJumpUpAdditive
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemJumpUpAdditive final 
{
public:
	struct FPoseLink                              InPoseItemJumpUpAdditive;                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJumpUpAdditive;                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemLowerBodyMovement
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemLowerBodyMovement final 
{
public:
	struct FPoseLink                              InPoseLowerBodyMovement;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyMovement;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemPreIK
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemPreIK final 
{
public:
	struct FPoseLink                              InPose_PreIK;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemPreIK;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemRelaxedEntry
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemRelaxedEntry final 
{
public:
	struct FPoseLink                              InPoseRelaxedEntry;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemRelaxedEntry;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemSkeletalControl
// 0x0020 (0x0020 - 0x0000)
struct ItemAnimLayerInterface_C_ItemSkeletalControl final 
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemSkeletalControl;                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemSwimJumpFallLoop
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemSwimJumpFallLoop final 
{
public:
	struct FPoseLink                              Param_ItemSwimJumpFallLoop;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemSwimJumpSurfaceEnd
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemSwimJumpSurfaceEnd final 
{
public:
	struct FPoseLink                              Param_ItemSwimJumpSurfaceEnd;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemSwimJumpSurfaceLoop
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemSwimJumpSurfaceLoop final 
{
public:
	struct FPoseLink                              Param_ItemSwimJumpSurfaceLoop;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemUpperBody
// 0x0288 (0x0288 - 0x0000)
struct ItemAnimLayerInterface_C_ItemUpperBody final 
{
public:
	struct FPoseLink                              InPoseUpperBody;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_AdjustedAim             InputParam;                                        // 0x0010(0x0268)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemUpperBody;                               // 0x0278(0x0010)(Parm, OutParm, NoDestructor)
};

// Function ItemAnimLayerInterface.ItemAnimLayerInterface_C.ItemZipLineStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct ItemAnimLayerInterface_C_ItemZipLineStartAdditive final 
{
public:
	struct FPoseLink                              Param_ItemZipLineStartAdditive;                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

}

