#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizationCoreRuntime

#include "Basic.hpp"

#include "ItemizationCoreRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "McpProfileSys_classes.hpp"
#include "VerseGameplayTags_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class ItemizationCoreRuntime.InventoryCollection
// 0x05A0 (0x0830 - 0x0290)
class AInventoryCollection : public AInfo
{
public:
	FMulticastInlineDelegateProperty_             OnInventoryCollectionLoadStateChanged;             // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UInventory*>                     InventoryList;                                     // 0x02A0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<struct FGuid, class UInventory*>         InventoryMap;                                      // 0x02B0(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<struct FGuid, struct FGuid>              ItemInventoryMap;                                  // 0x0300(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, class UItemInstance*>      ItemInstanceMap;                                   // 0x0350(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UItemComponentStorageManager*           ItemComponentStorageManager;                       // 0x03A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3146[0x468];                                   // 0x03A8(0x0468)(Fixing Size After Last Property [ Dumper-7 ])
	EInventoryCollectionType                      InventoryCollectionType;                           // 0x0810(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3147[0x3];                                     // 0x0811(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  InventoryCollectionID;                             // 0x0814(0x0010)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EInventoryCollectionLoadState                 InventoryCollectionLoadState;                      // 0x0824(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3148[0x3];                                     // 0x0825(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventorySetupData*                    UsedInventorySetupData;                            // 0x0828(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClientOnItemAbilityCooldownUpdated(class UInventory* Inventory, struct FGuid& ItemEntryID, struct FItemAbilityCooldownState& CooldownState);
	void DropItem(struct FGuid& ItemEntryID, int64 AmountToDrop);
	void Server_DropItem(struct FGuid& ItemEntryID, int64 AmountToDrop);
	void Server_MoveItemListToInventory(TArray<struct FGuid>& ItemEntryIDList, class AInventoryCollection* TargetInventoryCollection, struct FGuid& TargetInventoryID);
	void Server_MoveItemsWithDefinitionToInventory(struct FGuid& OwningInventoryID, class UItemDefinitionBase* ItemDefinition, class AInventoryCollection* TargetInventoryCollection, struct FGuid& TargetInventoryID, int64 Amount);
	void Server_MoveItemToInventory(struct FGuid& ItemEntryID, class AInventoryCollection* TargetInventoryCollection, struct FGuid& TargetInventoryID);
	void Server_SetEquippableItemActive(struct FGuid& ItemEntryID);
	void Server_SetEquippableItemInactive(struct FGuid& ItemEntryID);
	void Server_SetItemSlot(struct FGuid& OwningInventoryID, struct FGuid& ItemEntryID, uint16 SlotNumber, EVkInventoryMoveBehaviour MoveBehaviour);
	void Server_SwapItems(struct FGuid& ItemEntryID, class AInventoryCollection* OtherInventoryCollection, struct FGuid& OtherItemEntryID);
	void Server_UseItem(struct FGuid& ItemId, struct FGuid& AdditionalItemID);
	void SetEquippableItemActive(struct FGuid& ItemEntryID);
	void SetEquippableItemInactive(struct FGuid& ItemEntryID);
	int64 SetInventoryMaxStackSizeOverride(struct FGuid& TargetInventoryID, int64 InInventoryMaxStackSizeOverride);
	int64 SetInventoryTotalSlotsOverride(struct FGuid& TargetInventoryID, int64 InInventoryTotalSlotsOverride);
	void UseItem(struct FGuid& ItemId, struct FGuid& AdditionalItemID);

	bool GetAllInventoriesInCollection(TArray<struct FGuid>* OutInventoryIDList) const;
	bool GetAllItemsInInventory(struct FGuid& TargetInventoryID, TArray<struct FGuid>* OutItemEntryIDList) const;
	TArray<struct FGuid> GetInventoriesWithInventoryDefinition(class UInventoryDefinition* InventoryDefinition) const;
	EItemizationInventoryCreationType GetInventoryCreationType(struct FGuid& TargetInventoryID) const;
	const class UInventoryDefinition* GetInventoryDefinition(struct FGuid& TargetInventoryID) const;
	TArray<struct FGuid> GetInventoryListInPickupPriorityForItemDefinition(class UItemDefinitionBase* ItemDefinition) const;
	int64 GetInventoryMaxStackSizeOverride(struct FGuid& TargetInventoryID) const;
	const class FText GetInventoryName(struct FGuid& TargetInventoryID) const;
	int64 GetInventoryTotalSlotsOverride(struct FGuid& TargetInventoryID) const;
	int64 GetItemAmount(class UItemDefinitionBase* ItemDefinition) const;
	int64 GetItemAmountFromEntry(struct FGuid& TargetInventoryID, struct FGuid& ItemEntryID) const;
	int64 GetItemAmountFromInventory(class UItemDefinitionBase* ItemDefinition, struct FGuid& TargetInventoryID) const;
	const class UItemDefinitionBase* GetItemDefinition(struct FGuid& TargetInventoryID, struct FGuid& ItemEntryID) const;
	struct FGuid GetItemEntryIDBySlot(struct FGuid& TargetInventoryID, int32 SlotNumber) const;
	int64 GetItemMaxAmountForEntry(struct FGuid& TargetInventoryID, struct FGuid& ItemEntryID) const;
	int32 GetItemSlotNumber(struct FGuid& TargetInventoryID, struct FGuid& ItemEntryID) const;
	bool IsEquippableItemActive(struct FGuid& ItemEntryID) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InventoryCollection">();
	}
	static class AInventoryCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInventoryCollection>();
	}
};

// Class ItemizationCoreRuntime.Inventory
// 0x04F0 (0x0590 - 0x00A0)
class UInventory : public UActorComponent
{
public:
	class AInventoryCollection*                   OwningInventoryCollection;                         // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryDefinition*                   InventoryDefinition;                               // 0x00A8(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  InventoryID;                                       // 0x00B0(0x0010)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EItemizationInventoryCreationType             InventoryType;                                     // 0x00C0(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_314E[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemEntryList                         ItemEntryData;                                     // 0x00C8(0x0308)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint16                                        InventoryTotalSlotsOverride;                       // 0x03D0(0x0002)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_314F[0x6];                                     // 0x03D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         InventoryMaxStackSizeOverride;                     // 0x03D8(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3150[0x1B0];                                   // 0x03E0(0x01B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_InventoryDefinition();
	void OnRep_InventoryID();
	void OnRep_InventoryMaxStackSizeOverride();
	void OnRep_InventoryTotalSlotsOverride();
	void OnRep_ItemData();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Inventory">();
	}
	static class UInventory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventory>();
	}
};

// Class ItemizationCoreRuntime.EquippableInventory
// 0x0078 (0x0608 - 0x0590)
class UEquippableInventory final  : public UInventory
{
public:
	TArray<struct FGuid>                          ActiveItems;                                       // 0x0590(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          PreviouslyActiveItems;                             // 0x05A0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3151[0x58];                                    // 0x05B0(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_ActiveItems();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EquippableInventory">();
	}
	static class UEquippableInventory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquippableInventory>();
	}
};

// Class ItemizationCoreRuntime.InventoryDefinition
// 0x0048 (0x0078 - 0x0030)
class UInventoryDefinition : public UDataAsset
{
public:
	class FText                                   Name_InventoryDefinition;                          // 0x0030(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   Description;                                       // 0x0040(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint16                                        Slots;                                             // 0x0050(0x0002)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         PickupPriority;                                    // 0x0052(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3152[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemRequirements*                      ItemRequirements;                                  // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableItemStacking;                               // 0x0060(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRequireUniqueItemDefinitionPerStack;              // 0x0061(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3153[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseGameplayTagContainer             VerseGameplayTags;                                 // 0x0068(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InventoryDefinition">();
	}
	static class UInventoryDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryDefinition>();
	}
};

// Class ItemizationCoreRuntime.EquippableInventoryDefinition
// 0x0038 (0x00B0 - 0x0078)
class UEquippableInventoryDefinition : public UInventoryDefinition
{
public:
	TArray<struct FEquipItemRestriction>          EquipRestrictions;                                 // 0x0078(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FEquipItemCondition>            AutoEquipConditions;                               // 0x0088(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UInputAction*>                   SlotBindings;                                      // 0x0098(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowSlotBindings;                                 // 0x00A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3154[0x7];                                     // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EquippableInventoryDefinition">();
	}
	static class UEquippableInventoryDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquippableInventoryDefinition>();
	}
};

// Class ItemizationCoreRuntime.EquipmentSlot
// 0x0000 (0x00B0 - 0x00B0)
class UEquipmentSlot final  : public UEquippableInventoryDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EquipmentSlot">();
	}
	static class UEquipmentSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquipmentSlot>();
	}
};

// Class ItemizationCoreRuntime.EquipmentHotBar
// 0x0000 (0x00B0 - 0x00B0)
class UEquipmentHotBar final  : public UEquippableInventoryDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EquipmentHotBar">();
	}
	static class UEquipmentHotBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquipmentHotBar>();
	}
};

// Class ItemizationCoreRuntime.InventoryCheatManager
// 0x0000 (0x0028 - 0x0028)
class UInventoryCheatManager final  : public UCheatManagerExtension
{
public:
	void InventoryAddToItem(int32 InventoryIndex, int32 ItemIndex, int64 AmountToAdd);
	void InventoryDropItem(int32 InventoryIndex, int32 ItemIndex, int64 AmountToDrop);
	void InventoryMoveAmountOfItem(int32 SourceInventoryIndex, int32 ItemIndex, int32 TargetInventoryIndex, int64 AmountToMove);
	void InventoryMoveItem(int32 SourceInventoryIndex, int32 ItemIndex, int32 TargetInventoryIndex);
	void InventoryRemoveFromItem(int32 InventoryIndex, int32 ItemIndex, int64 AmountToRemove);
	void InventorySetEquippedItemActive(int32 InventoryIndex, int32 ItemIndex, bool bActive);
	void InventorySetItemSlot(int32 InventoryIndex, int32 ItemIndex, uint16 NewSlotIndex);
	void InventoryUseItem(int32 InventoryIndex, int32 ItemIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InventoryCheatManager">();
	}
	static class UInventoryCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryCheatManager>();
	}
};

// Class ItemizationCoreRuntime.InventorySetupData
// 0x00A0 (0x00D0 - 0x0030)
class UInventorySetupData final  : public UDataAsset
{
public:
	TArray<TSoftObjectPtr<class UEquippableInventoryDefinition>> EquipmentSetups;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UInventoryDefinition>> InventoryDefinitions;                              // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FInventoryStartingItem>         StartingItems;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UInputMappingContext>    InputMappingContext;                               // 0x0060(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   InventoryUIWidgetClass;                            // 0x0080(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   InventoryHUDUIWidgetClass;                         // 0x00A0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void SetEquippableInventoryDefinitionList(TArray<TSoftObjectPtr<class UEquippableInventoryDefinition>>& EquipmentInventoryDefinitionList);
	void SetInventoryDefinitionList(TArray<TSoftObjectPtr<class UInventoryDefinition>>& InventoryDefinitionList);

	TArray<class UClass*> GetDisallowedEquipmentInventoryDefinitionAssetClasses() const;
	TArray<class UClass*> GetDisallowedInventoryDefinitionAssetClasses() const;
	TArray<TSoftObjectPtr<class UEquippableInventoryDefinition>> GetEquippableInventoryDefinitionList() const;
	TArray<TSoftObjectPtr<class UInventoryDefinition>> GetInventoryDefinitionList() const;
	TArray<struct FInventoryStartingItem> GetStartingItems() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InventorySetupData">();
	}
	static class UInventorySetupData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventorySetupData>();
	}
};

// Class ItemizationCoreRuntime.ItemAbilityConfigurationAsset
// 0x0028 (0x0058 - 0x0030)
class UItemAbilityConfigurationAsset final  : public UPrimaryDataAsset
{
public:
	TSubclassOf<class UGameplayAbility>           GameplayAbilityClass;                              // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0038(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	void Construct(class UGameplayAbility* Ability) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemAbilityConfigurationAsset">();
	}
	static class UItemAbilityConfigurationAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityConfigurationAsset>();
	}
};

// Class ItemizationCoreRuntime.ItemAbilityEffectAsset
// 0x0008 (0x0038 - 0x0030)
class UItemAbilityEffectAsset final  : public UPrimaryDataAsset
{
public:
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemAbilityEffectAsset">();
	}
	static class UItemAbilityEffectAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityEffectAsset>();
	}
};

// Class ItemizationCoreRuntime.ItemAbilityCost
// 0x0000 (0x0028 - 0x0028)
class UItemAbilityCost : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemAbilityCost">();
	}
	static class UItemAbilityCost* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityCost>();
	}
};

// Class ItemizationCoreRuntime.ItemAbilityCostItem
// 0x0028 (0x0050 - 0x0028)
class UItemAbilityCostItem final  : public UItemAbilityCost
{
public:
	TSoftObjectPtr<class UItemDefinitionBase>     ItemDefinition;                                    // 0x0028(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         NumConsumed;                                       // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemAbilityCostItem">();
	}
	static class UItemAbilityCostItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityCostItem>();
	}
};

// Class ItemizationCoreRuntime.ItemAbilityCooldown
// 0x0008 (0x0030 - 0x0028)
class UItemAbilityCooldown : public UObject
{
public:
	bool                                          bApplyOnStart;                                     // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3158[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemAbilityCooldown">();
	}
	static class UItemAbilityCooldown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityCooldown>();
	}
};

// Class ItemizationCoreRuntime.ItemAbilityCooldownTime
// 0x0008 (0x0038 - 0x0030)
class UItemAbilityCooldownTime final  : public UItemAbilityCooldown
{
public:
	float                                         CoolDownTime;                                      // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3159[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemAbilityCooldownTime">();
	}
	static class UItemAbilityCooldownTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityCooldownTime>();
	}
};

// Class ItemizationCoreRuntime.ItemAbilityCooldownVelocityBased
// 0x0010 (0x0040 - 0x0030)
class UItemAbilityCooldownVelocityBased final  : public UItemAbilityCooldown
{
public:
	float                                         CooldownTimeIfStationary;                          // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CooldownTimeScaleFactorIfMoving;                   // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CooldownTimeIsResetToZeroWhenMoving;               // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_315A[0x7];                                     // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemAbilityCooldownVelocityBased">();
	}
	static class UItemAbilityCooldownVelocityBased* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAbilityCooldownVelocityBased>();
	}
};

// Class ItemizationCoreRuntime.ItemAttachment
// 0x0018 (0x02A8 - 0x0290)
class AItemAttachment final  : public AActor
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UItemAttachmentDefinition*              AttachmentData;                                    // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_315B[0x8];                                     // 0x02A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemAttachment">();
	}
	static class AItemAttachment* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItemAttachment>();
	}
};

// Class ItemizationCoreRuntime.ItemComponentBase
// 0x0000 (0x0028 - 0x0028)
class UItemComponentBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponentBase">();
	}
	static class UItemComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentBase>();
	}
};

// Class ItemizationCoreRuntime.ItemComponentStorageManager
// 0x00A0 (0x00C8 - 0x0028)
class UItemComponentStorageManager final  : public UObject
{
public:
	TMap<class UClass*, struct FItemEntryStorageMap> ClassIndividualStorageMap;                         // 0x0028(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<class UClass*, class UItemComponentSharedLocalStorage*> ClassSharedStorageMap;                             // 0x0078(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponentStorageManager">();
	}
	static class UItemComponentStorageManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentStorageManager>();
	}
};

// Class ItemizationCoreRuntime.ItemComponentLocalStorage
// 0x0010 (0x0038 - 0x0028)
class UItemComponentLocalStorage : public UObject
{
public:
	uint8                                         Pad_315C[0x10];                                    // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponentLocalStorage">();
	}
	static class UItemComponentLocalStorage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentLocalStorage>();
	}
};

// Class ItemizationCoreRuntime.ItemComponentSharedLocalStorage
// 0x0000 (0x0028 - 0x0028)
class UItemComponentSharedLocalStorage : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponentSharedLocalStorage">();
	}
	static class UItemComponentSharedLocalStorage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentSharedLocalStorage>();
	}
};

// Class ItemizationCoreRuntime.ItemComponent_Ability
// 0x0010 (0x0038 - 0x0028)
class UItemComponent_Ability final  : public UItemComponentBase
{
public:
	TArray<struct FItemAbilityBinding>            AbilityList;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponent_Ability">();
	}
	static class UItemComponent_Ability* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponent_Ability>();
	}
};

// Class ItemizationCoreRuntime.ItemComponentStorage_Ability
// 0x0028 (0x0060 - 0x0038)
class UItemComponentStorage_Ability final  : public UItemComponentLocalStorage
{
public:
	TArray<bool>                                  AbilityIsAvailableList;                            // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UItemComponent_Ability*                 SourceData;                                        // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_315D[0x8];                                     // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponentStorage_Ability">();
	}
	static class UItemComponentStorage_Ability* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentStorage_Ability>();
	}
};

// Class ItemizationCoreRuntime.ItemComponentStorage_AbilityShared
// 0x0050 (0x0078 - 0x0028)
class UItemComponentStorage_AbilityShared final  : public UItemComponentSharedLocalStorage
{
public:
	TMap<uint32, struct FItemAbilityRuntimeData>  RefCountedAbilityRuntimeData;                      // 0x0028(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponentStorage_AbilityShared">();
	}
	static class UItemComponentStorage_AbilityShared* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentStorage_AbilityShared>();
	}
};

// Class ItemizationCoreRuntime.ItemAttachmentDefinition
// 0x0008 (0x0030 - 0x0028)
class UItemAttachmentDefinition : public UObject
{
public:
	EItemStateFilter                              AttachmentVisibility;                              // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_315E[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemAttachmentDefinition">();
	}
	static class UItemAttachmentDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemAttachmentDefinition>();
	}
};

// Class ItemizationCoreRuntime.ItemMeshAttachmentDefinition
// 0x0050 (0x0080 - 0x0030)
class UItemMeshAttachmentDefinition : public UItemAttachmentDefinition
{
public:
	class FName                                   AttachToSocketName;                                // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_315F[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OffsetLocation;                                    // 0x0038(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OffsetRotation;                                    // 0x0050(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                MeshScale;                                         // 0x0068(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemMeshAttachmentDefinition">();
	}
	static class UItemMeshAttachmentDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemMeshAttachmentDefinition>();
	}
};

// Class ItemizationCoreRuntime.ItemStaticMeshAttachmentDefinition
// 0x0020 (0x00A0 - 0x0080)
class UItemStaticMeshAttachmentDefinition final  : public UItemMeshAttachmentDefinition
{
public:
	TSoftObjectPtr<class UStaticMesh>             Mesh;                                              // 0x0080(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemStaticMeshAttachmentDefinition">();
	}
	static class UItemStaticMeshAttachmentDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemStaticMeshAttachmentDefinition>();
	}
};

// Class ItemizationCoreRuntime.ItemSkeletalMeshAttachmentDefinition
// 0x0040 (0x00C0 - 0x0080)
class UItemSkeletalMeshAttachmentDefinition final  : public UItemMeshAttachmentDefinition
{
public:
	TSoftObjectPtr<class USkeletalMesh>           Mesh;                                              // 0x0080(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           Animation;                                         // 0x00A0(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemSkeletalMeshAttachmentDefinition">();
	}
	static class UItemSkeletalMeshAttachmentDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemSkeletalMeshAttachmentDefinition>();
	}
};

// Class ItemizationCoreRuntime.ItemComponent_Attach
// 0x0010 (0x0038 - 0x0028)
class UItemComponent_Attach final  : public UItemComponentBase
{
public:
	TArray<class UItemAttachmentDefinition*>      Attachments;                                       // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponent_Attach">();
	}
	static class UItemComponent_Attach* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponent_Attach>();
	}
};

// Class ItemizationCoreRuntime.ItemComponentStorage_Attach
// 0x0020 (0x0058 - 0x0038)
class UItemComponentStorage_Attach final  : public UItemComponentLocalStorage
{
public:
	TArray<TWeakObjectPtr<class AItemAttachment>> ActorAttachments;                                  // 0x0038(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_3160[0x10];                                    // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnOwnerTransformUpdated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponentStorage_Attach">();
	}
	static class UItemComponentStorage_Attach* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentStorage_Attach>();
	}
};

// Class ItemizationCoreRuntime.ItemComponent_Core
// 0x0020 (0x0048 - 0x0028)
class UItemComponent_Core final  : public UItemComponentBase
{
public:
	class UItemType*                              ItemType;                                          // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UItemRarity*                            ItemRarity;                                        // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVerseGameplayTagContainer             ItemTags;                                          // 0x0038(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	class UItemRarity* GetItemRarity() const;
	class UItemType* GetItemType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponent_Core">();
	}
	static class UItemComponent_Core* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponent_Core>();
	}
};

// Class ItemizationCoreRuntime.ItemComponent_DisplayUI
// 0x0040 (0x0068 - 0x0028)
class UItemComponent_DisplayUI final  : public UItemComponentBase
{
public:
	TSoftObjectPtr<class UTexture2D>              ItemIcon;                                          // 0x0028(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>              SmallItemIcon;                                     // 0x0048(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	const TSoftObjectPtr<class UTexture2D> GetItemIcon() const;
	const TSoftObjectPtr<class UTexture2D> GetSmallItemIcon() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponent_DisplayUI">();
	}
	static class UItemComponent_DisplayUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponent_DisplayUI>();
	}
};

// Class ItemizationCoreRuntime.ItemOwnerPoseAsset
// 0x0008 (0x0038 - 0x0030)
class UItemOwnerPoseAsset final  : public UPrimaryDataAsset
{
public:
	class UProxyTable*                            ProxyTable;                                        // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemOwnerPoseAsset">();
	}
	static class UItemOwnerPoseAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemOwnerPoseAsset>();
	}
};

// Class ItemizationCoreRuntime.ItemComponent_OwnerPose
// 0x0018 (0x0040 - 0x0028)
class UItemComponent_OwnerPose final  : public UItemComponentBase
{
public:
	EItemStateFilter                              ApplyPoseState;                                    // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3162[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemOwnerPoseAsset*                    PoseAsset;                                         // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PosePriority;                                      // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3163[0x4];                                     // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponent_OwnerPose">();
	}
	static class UItemComponent_OwnerPose* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponent_OwnerPose>();
	}
};

// Class ItemizationCoreRuntime.ItemComponentStorage_OwnerPose
// 0x0008 (0x0040 - 0x0038)
class UItemComponentStorage_OwnerPose final  : public UItemComponentLocalStorage
{
public:
	bool                                          bHasAppliedProceduralLayer;                        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3164[0x7];                                     // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponentStorage_OwnerPose">();
	}
	static class UItemComponentStorage_OwnerPose* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentStorage_OwnerPose>();
	}
};

// Class ItemizationCoreRuntime.ItemComponentStorage_OwnerPoseShared
// 0x0010 (0x0038 - 0x0028)
class UItemComponentStorage_OwnerPoseShared final  : public UItemComponentSharedLocalStorage
{
public:
	TArray<class UItemComponent_OwnerPose*>       ActiveProceduralLayers;                            // 0x0028(0x0010)(ExportObject, ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponentStorage_OwnerPoseShared">();
	}
	static class UItemComponentStorage_OwnerPoseShared* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponentStorage_OwnerPoseShared>();
	}
};

// Class ItemizationCoreRuntime.ItemComponent_Stackable
// 0x0010 (0x0038 - 0x0028)
class UItemComponent_Stackable final  : public UItemComponentBase
{
public:
	int64                                         MaxStackSize;                                      // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          AllowMultipleStacks;                               // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          DestroyEmptyStacks;                                // 0x0031(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3165[0x6];                                     // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemComponent_Stackable">();
	}
	static class UItemComponent_Stackable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemComponent_Stackable>();
	}
};

// Class ItemizationCoreRuntime.ItemDefinitionBase
// 0x00A0 (0x00D0 - 0x0030)
class UItemDefinitionBase : public UMcpItemDefinitionBase
{
public:
	uint8                                         Pad_3166[0x10];                                    // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ItemName;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   ItemDescription;                                   // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   ItemShortDescription;                              // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FItemComponentContainer                ComponentContainer;                                // 0x0070(0x0010)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3167[0x50];                                    // 0x0080(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class UClass*> GetDisallowedComponents() const;
	class FText GetDisplayName() const;
	const class UItemComponentBase* GetItemComponentByClass(TSubclassOf<class UItemComponentBase> ItemComponentClass) const;
	class FText GetItemDescription() const;
	class FText GetItemShortDescription() const;
	bool HasItemComponentByClass(TSubclassOf<class UItemComponentBase> ItemComponentClass) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemDefinitionBase">();
	}
	static class UItemDefinitionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemDefinitionBase>();
	}
};

// Class ItemizationCoreRuntime.ItemInputAction
// 0x0000 (0x0078 - 0x0078)
class UItemInputAction final  : public UInputAction
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemInputAction">();
	}
	static class UItemInputAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInputAction>();
	}
};

// Class ItemizationCoreRuntime.ItemInputMappingContext
// 0x0000 (0x0050 - 0x0050)
class UItemInputMappingContext final  : public UInputMappingContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemInputMappingContext">();
	}
	static class UItemInputMappingContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInputMappingContext>();
	}
};

// Class ItemizationCoreRuntime.ItemInstance
// 0x0018 (0x0040 - 0x0028)
class UItemInstance final  : public UObject
{
public:
	struct FGuid                                  ItemEntryID;                                       // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3169[0x8];                                     // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemInstance">();
	}
	static class UItemInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInstance>();
	}
};

// Class ItemizationCoreRuntime.ItemizationCoreSubsystem
// 0x0018 (0x0048 - 0x0030)
class UItemizationCoreSubsystem final  : public UEngineSubsystem
{
public:
	struct FItemInstanceClassOverride             ItemInstanceClassOverride;                         // 0x0030(0x0018)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationCoreSubsystem">();
	}
	static class UItemizationCoreSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationCoreSubsystem>();
	}
};

// Class ItemizationCoreRuntime.ItemizationFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UItemizationFunctionLibrary final  : public UBlueprintFunctionLibrary
{
public:
	static class FString DescribeInventoryID(struct FGuid& InventoryID);
	static class FString DescribeItemEntryID(struct FGuid& ItemEntryID);
	static const class UItemDefinitionBase* GetItemDataDefinition(struct FItemAggregatedData& ItemData);
	static struct FGuid GetItemDataItemEntryID(struct FItemAggregatedData& ItemData);
	static int32 GetItemDataSlot(struct FItemAggregatedData& ItemData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationFunctionLibrary">();
	}
	static class UItemizationFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationFunctionLibrary>();
	}
};

// Class ItemizationCoreRuntime.ItemizationLootCountCalculator
// 0x0000 (0x0028 - 0x0028)
class UItemizationLootCountCalculator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationLootCountCalculator">();
	}
	static class UItemizationLootCountCalculator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationLootCountCalculator>();
	}
};

// Class ItemizationCoreRuntime.ItemizationLootCountCalculator_Value
// 0x0028 (0x0050 - 0x0028)
class UItemizationLootCountCalculator_Value final  : public UItemizationLootCountCalculator
{
public:
	struct FScalableFloat                         Value;                                             // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationLootCountCalculator_Value">();
	}
	static class UItemizationLootCountCalculator_Value* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationLootCountCalculator_Value>();
	}
};

// Class ItemizationCoreRuntime.ItemizationLootCountCalculator_Range
// 0x0050 (0x0078 - 0x0028)
class UItemizationLootCountCalculator_Range final  : public UItemizationLootCountCalculator
{
public:
	struct FScalableFloat                         Min;                                               // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         Max;                                               // 0x0050(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationLootCountCalculator_Range">();
	}
	static class UItemizationLootCountCalculator_Range* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationLootCountCalculator_Range>();
	}
};

// Class ItemizationCoreRuntime.ItemizationLootPoolAsset
// 0x0058 (0x0088 - 0x0030)
class UItemizationLootPoolAsset final  : public UDataAsset
{
public:
	class FText                                   LootTableName;                                     // 0x0030(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   LootTableDescription;                              // 0x0040(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UItemizationLootPoolProcessor*>  LootPoolPostProcessorList;                         // 0x0050(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FItemizationLootEntry_Guaranteed> GuaranteedLoot;                                    // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UItemizationLootCountCalculator*        SelectionCount;                                    // 0x0070(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FItemizationLootEntry_Chance>   ChanceLoot;                                        // 0x0078(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	TArray<class UClass*> GetAllowedLootPoolItemClasses() const;
	TArray<class UClass*> GetDisallowedLootPoolItemClasses() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationLootPoolAsset">();
	}
	static class UItemizationLootPoolAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationLootPoolAsset>();
	}
};

// Class ItemizationCoreRuntime.ItemizationLootPoolProcessor
// 0x0000 (0x0028 - 0x0028)
class UItemizationLootPoolProcessor final  : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationLootPoolProcessor">();
	}
	static class UItemizationLootPoolProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationLootPoolProcessor>();
	}
};

// Class ItemizationCoreRuntime.ItemizationLootWeightCalculator
// 0x0000 (0x0028 - 0x0028)
class UItemizationLootWeightCalculator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationLootWeightCalculator">();
	}
	static class UItemizationLootWeightCalculator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationLootWeightCalculator>();
	}
};

// Class ItemizationCoreRuntime.ItemizationLootWeightCalculator_Value
// 0x0028 (0x0050 - 0x0028)
class UItemizationLootWeightCalculator_Value final  : public UItemizationLootWeightCalculator
{
public:
	struct FScalableFloat                         Value;                                             // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationLootWeightCalculator_Value">();
	}
	static class UItemizationLootWeightCalculator_Value* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationLootWeightCalculator_Value>();
	}
};

// Class ItemizationCoreRuntime.ItemizationLootWeightCalculator_Range
// 0x0050 (0x0078 - 0x0028)
class UItemizationLootWeightCalculator_Range final  : public UItemizationLootWeightCalculator
{
public:
	struct FScalableFloat                         Min;                                               // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         Max;                                               // 0x0050(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationLootWeightCalculator_Range">();
	}
	static class UItemizationLootWeightCalculator_Range* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationLootWeightCalculator_Range>();
	}
};

// Class ItemizationCoreRuntime.ItemizationPersistenceManagerBase
// 0x0000 (0x0028 - 0x0028)
class UItemizationPersistenceManagerBase final  : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationPersistenceManagerBase">();
	}
	static class UItemizationPersistenceManagerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationPersistenceManagerBase>();
	}
};

// Class ItemizationCoreRuntime.ItemizationWorldSubsystem
// 0x00A8 (0x00D8 - 0x0030)
class UItemizationWorldSubsystem final  : public UWorldSubsystem
{
public:
	uint8                                         Pad_316B[0xA0];                                    // 0x0030(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemizationPersistenceManagerBase*     ItemizationPersistenceManager;                     // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnInventoryComponentDestroyed(class UInventoryComponent* InventoryComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemizationWorldSubsystem">();
	}
	static class UItemizationWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemizationWorldSubsystem>();
	}
};

// Class ItemizationCoreRuntime.ItemRarity
// 0x0048 (0x0078 - 0x0030)
class UItemRarity final  : public UDataAsset
{
public:
	class FText                                   Name_ItemRarity;                                   // 0x0030(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   Description;                                       // 0x0040(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FLinearColor                           Color;                                             // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Tier;                                              // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_316C[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseGameplayTagContainer             Tags;                                              // 0x0068(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	const struct FLinearColor GetColor() const;
	const class FText GetDescription() const;
	const class FText GetName() const;
	float GetTier() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemRarity">();
	}
	static class UItemRarity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemRarity>();
	}
};

// Class ItemizationCoreRuntime.ItemRarityTable
// 0x0030 (0x0060 - 0x0030)
class UItemRarityTable final  : public UDataAsset
{
public:
	class FText                                   RarityTableName;                                   // 0x0030(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   RarityTableDescription;                            // 0x0040(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FVkRarityEntry>                 RarityList;                                        // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemRarityTable">();
	}
	static class UItemRarityTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemRarityTable>();
	}
};

// Class ItemizationCoreRuntime.ItemRequirements
// 0x00A0 (0x00D0 - 0x0030)
class UItemRequirements final  : public UDataAsset
{
public:
	class FText                                   Name_ItemRequirements;                             // 0x0030(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   Description;                                       // 0x0040(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSet<class UItemType*>                        ItemTypes;                                         // 0x0050(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FItemTagContainer                      TagContainer;                                      // 0x00A0(0x0030)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemRequirements">();
	}
	static class UItemRequirements* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemRequirements>();
	}
};

// Class ItemizationCoreRuntime.ItemType
// 0x0038 (0x0068 - 0x0030)
class UItemType final  : public UDataAsset
{
public:
	class FText                                   Name_ItemType;                                     // 0x0030(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   Description;                                       // 0x0040(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UItemType*                              ParentType;                                        // 0x0050(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVerseGameplayTagContainer             Tags;                                              // 0x0058(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	const class FText GetDescription() const;
	const class FText GetName() const;
	const class UItemType* GetParentType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemType">();
	}
	static class UItemType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemType>();
	}
};

// Class ItemizationCoreRuntime.ItemVariant
// 0x0008 (0x00D8 - 0x00D0)
class UItemVariant final  : public UItemDefinitionBase
{
public:
	class UItemDefinitionBase*                    Original;                                          // 0x00D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemVariant">();
	}
	static class UItemVariant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemVariant>();
	}
};

// Class ItemizationCoreRuntime.InventoryComponent
// 0x0050 (0x00F0 - 0x00A0)
class UInventoryComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnInventoryComponentDestroyed;                     // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
