#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeepScoreRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class KeepScoreRuntime.FortWeaponKeepScore
// 0x0090 (0x1DE8 - 0x1D58)
class AFortWeaponKeepScore final  : public AFortWeaponRanged
{
public:
	FMulticastInlineDelegateProperty_             OnFireFailed;                                      // 0x1D58(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bCurrentAttackOffhand;                             // 0x1D68(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9342[0x1B];                                    // 0x1D69(0x001B)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BulletPatternNumber;                               // 0x1D84(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGateFireCall;                                     // 0x1D88(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9343[0x3];                                     // 0x1D89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           IsFiringGameplayTag;                               // 0x1D8C(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                MuzzleLocationOffset;                              // 0x1D90(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ReloadingTag;                                      // 0x1DA8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ReloadAbilityEventTag;                             // 0x1DAC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           FireAbilityEventTag;                               // 0x1DB0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9344[0x4];                                     // 0x1DB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bAllowAutoReload;                                  // 0x1DB8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_9345[0x8];                                     // 0x1DE0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActualFireSingle();
	void HandleIsFiringTagChange(struct FGameplayTag& Tag, int32 NewCount);
	void HandleWeaponFired(class UFortGameplayAbility* GameplayAbility, const struct FGameplayTagContainer& AbilityTags);
	void OnFireFailed__DelegateSignature();
	void ReloadAmmo();
	void TryCorrectAmmo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortWeaponKeepScore">();
	}
	static class AFortWeaponKeepScore* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortWeaponKeepScore>();
	}
};

// Class KeepScoreRuntime.TiredPanda_PlayerAnimInstance
// 0x0010 (0x13A0 - 0x1390)
class UTiredPanda_PlayerAnimInstance final  : public UFortPlayerAnimInstanceProxy
{
public:
	float                                         AimPoseAlpha;                                      // 0x1388(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SquatAdditiveAlpha;                                // 0x138C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaterReloadBlendAlpha;                             // 0x1390(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsWaterReload : 1;                                // 0x1394(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsSquatAdditive : 1;                              // 0x1394(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsLeftHandAttack : 1;                             // 0x1394(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9346[0xB];                                     // 0x1395(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TiredPanda_PlayerAnimInstance">();
	}
	static class UTiredPanda_PlayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTiredPanda_PlayerAnimInstance>();
	}
};

}

