#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Patches_Axe_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GravityOverrideParamsStruct_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Patches_Axe_AnimBP.M_MED_Patches_Axe_AnimBP_C
// 0x08C0 (0x0FE0 - 0x0720)
class UM_MED_Patches_Axe_AnimBP_C final  : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0728(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0730(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0738(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x07E8(0x0020)()
	struct FGravityOverrideParamsStruct           Gravity_Override_Params;                           // 0x0808(0x07B8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GravityOverride;                                   // 0x0FC0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_Patches_Axe_AnimBP(int32 EntryPoint, const struct FRBANParamsStruct& Temp_struct_Variable, float K2Node_Event_DeltaTimeX, double CallFunc_GetGameTimeInSeconds_ReturnValue, const struct FVector& CallFunc_Gravity_Override_State_Function_GravityOverride, const class FString& CallFunc_Gravity_Override_State_Function_CurrentStateOut, const struct FGravityOverrideSettingStruct& CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut, const struct FRBANSettingStruct& CallFunc_Gravity_Override_State_Function_RBAN_SettingsOut);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Patches_Axe_AnimBP_C">();
	}
	static class UM_MED_Patches_Axe_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Patches_Axe_AnimBP_C>();
	}
};

}

