#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchObjectivesUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "DynamicUI_classes.hpp"
#include "MatchObjectivesUI_structs.hpp"


namespace SDK
{

// Class MatchObjectivesUI.FortMobileButtonBehaviorComponent_MatchObjectivePicker
// 0x0010 (0x0140 - 0x0130)
class UFortMobileButtonBehaviorComponent_MatchObjectivePicker final  : public UFortMobileActionButtonBehavior
{
public:
	class UFortControllerComponent_SkydiveFeedback* SkydiveFeedbackComp;                               // 0x0130(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9392[0x8];                                     // 0x0138(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSkydiveModeChanged(ESkydiveFeedbackPhase Phase);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileButtonBehaviorComponent_MatchObjectivePicker">();
	}
	static class UFortMobileButtonBehaviorComponent_MatchObjectivePicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_MatchObjectivePicker>();
	}
};

// Class MatchObjectivesUI.FortMobileHUDElement_ObjectiveSelectorWrapper
// 0x0018 (0x0378 - 0x0360)
class UFortMobileHUDElement_ObjectiveSelectorWrapper final  : public UFortMobileHUDElement
{
public:
	class UFortPlayerStateComponent_MatchQuests*  MatchQuestsComponent;                              // 0x0360(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_WrapperContents;                           // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9393[0x8];                                     // 0x0370(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleSkydiveFromBusAndLandingCompleted(bool bSkydivedFromBusAndLanded);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileHUDElement_ObjectiveSelectorWrapper">();
	}
	static class UFortMobileHUDElement_ObjectiveSelectorWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileHUDElement_ObjectiveSelectorWrapper>();
	}
};

// Class MatchObjectivesUI.MatchObjectivesOptionEntryWidget
// 0x0038 (0x0300 - 0x02C8)
class UMatchObjectivesOptionEntryWidget final  : public UUserWidget
{
public:
	bool                                          bIsOptionSelected;                                 // 0x02C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOptionFocused;                                  // 0x02C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9394[0x16];                                    // 0x02CA(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_TapSelect;                                  // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9395[0x18];                                    // 0x02E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMatchObjectiveEntrySetup(struct FUrgentQuestData& UrgentQuestData, struct FFortItemQuantityPair& VisibleReward, int32 ObjectiveCount);
	void OnOptionFocusedStateChanged(bool bIsFocused);
	void OnOptionSelectedStateChanged(bool bIsSelected);
	void OnTeammateSelectionUpdated(TArray<class AFortPlayerState*>& PlayersThatHaveSelectedThis);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchObjectivesOptionEntryWidget">();
	}
	static class UMatchObjectivesOptionEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchObjectivesOptionEntryWidget>();
	}
};

// Class MatchObjectivesUI.MatchObjectivesSocialAvatar
// 0x0008 (0x02D0 - 0x02C8)
class UMatchObjectivesSocialAvatar final  : public UUserWidget
{
public:
	class UFortSocialAvatarIcon*                  Icon_SocialAvatar;                                 // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetSocialAvatar(class AFortPlayerState* PlayerState);
	void SetSocialAvatarTexture(TSoftObjectPtr<class UTexture2D>& AvatarTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchObjectivesSocialAvatar">();
	}
	static class UMatchObjectivesSocialAvatar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchObjectivesSocialAvatar>();
	}
};

// Class MatchObjectivesUI.MatchObjectivesUIDirectorBase
// 0x0018 (0x02C8 - 0x02B0)
class AMatchObjectivesUIDirectorBase final  : public ADynamicUIDirectorBase
{
public:
	uint8                                         Pad_9396[0x18];                                    // 0x02B0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckQuestOffering();
	void HandleSkydiveModeChanged(ESkydiveFeedbackPhase Phase);
	void OnFinishSkydiving();
	void OnQuestOfferingAvailable();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchObjectivesUIDirectorBase">();
	}
	static class AMatchObjectivesUIDirectorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMatchObjectivesUIDirectorBase>();
	}
};

// Class MatchObjectivesUI.MatchObjectivesSelectorWidget
// 0x0028 (0x0358 - 0x0330)
class UMatchObjectivesSelectorWidget final  : public UFortHUDElementWidget
{
public:
	class UDynamicEntryBox*                       DynamicEntryBox_OptionEntries;                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMatchQuestsSelectorState                     WidgetSelectorState;                               // 0x0338(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9397[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        MatchObjectivesInputComponent;                     // 0x0340(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_HeaderToggle;                               // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9398[0x8];                                     // 0x0350(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetDailyChallengesFromMCP();
	void OnQuestEntrySelected(class UUserWidget* SelectedEntry);
	void OnSelectorOpenStateChanged();
	void PopulateChallengeEntries(TArray<TScriptInterface<class IQuestDefinitionInterface>>& QuestOffering);
	void SetSelectorState(EMatchQuestsSelectorState State);
	void UpdateKeybindings();

	bool IsOpenByDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchObjectivesSelectorWidget">();
	}
	static class UMatchObjectivesSelectorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchObjectivesSelectorWidget>();
	}
};

}

