#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchObjectivesUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "MatchObjectivesUI_structs.hpp"


namespace SDK::Params
{

// Function MatchObjectivesUI.FortMobileButtonBehaviorComponent_MatchObjectivePicker.HandleSkydiveModeChanged
// 0x0001 (0x0001 - 0x0000)
struct FortMobileButtonBehaviorComponent_MatchObjectivePicker_HandleSkydiveModeChanged final 
{
public:
	ESkydiveFeedbackPhase                         Phase;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.FortMobileHUDElement_ObjectiveSelectorWrapper.HandleSkydiveFromBusAndLandingCompleted
// 0x0001 (0x0001 - 0x0000)
struct FortMobileHUDElement_ObjectiveSelectorWrapper_HandleSkydiveFromBusAndLandingCompleted final 
{
public:
	bool                                          bSkydivedFromBusAndLanded;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.MatchObjectivesOptionEntryWidget.OnMatchObjectiveEntrySetup
// 0x0178 (0x0178 - 0x0000)
struct MatchObjectivesOptionEntryWidget_OnMatchObjectiveEntrySetup final 
{
public:
	struct FUrgentQuestData                       UrgentQuestData;                                   // 0x0000(0x0168)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FFortItemQuantityPair                  VisibleReward;                                     // 0x0168(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ObjectiveCount;                                    // 0x0174(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.MatchObjectivesOptionEntryWidget.OnOptionFocusedStateChanged
// 0x0001 (0x0001 - 0x0000)
struct MatchObjectivesOptionEntryWidget_OnOptionFocusedStateChanged final 
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.MatchObjectivesOptionEntryWidget.OnOptionSelectedStateChanged
// 0x0001 (0x0001 - 0x0000)
struct MatchObjectivesOptionEntryWidget_OnOptionSelectedStateChanged final 
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.MatchObjectivesOptionEntryWidget.OnTeammateSelectionUpdated
// 0x0010 (0x0010 - 0x0000)
struct MatchObjectivesOptionEntryWidget_OnTeammateSelectionUpdated final 
{
public:
	TArray<class AFortPlayerState*>               PlayersThatHaveSelectedThis;                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.MatchObjectivesSocialAvatar.SetSocialAvatar
// 0x0008 (0x0008 - 0x0000)
struct MatchObjectivesSocialAvatar_SetSocialAvatar final 
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.MatchObjectivesSocialAvatar.SetSocialAvatarTexture
// 0x0020 (0x0020 - 0x0000)
struct MatchObjectivesSocialAvatar_SetSocialAvatarTexture final 
{
public:
	TSoftObjectPtr<class UTexture2D>              AvatarTexture;                                     // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.MatchObjectivesUIDirectorBase.HandleSkydiveModeChanged
// 0x0001 (0x0001 - 0x0000)
struct MatchObjectivesUIDirectorBase_HandleSkydiveModeChanged final 
{
public:
	ESkydiveFeedbackPhase                         Phase;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.MatchObjectivesSelectorWidget.OnQuestEntrySelected
// 0x0008 (0x0008 - 0x0000)
struct MatchObjectivesSelectorWidget_OnQuestEntrySelected final 
{
public:
	class UUserWidget*                            SelectedEntry;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.MatchObjectivesSelectorWidget.PopulateChallengeEntries
// 0x0010 (0x0010 - 0x0000)
struct MatchObjectivesSelectorWidget_PopulateChallengeEntries final 
{
public:
	TArray<TScriptInterface<class IQuestDefinitionInterface>> QuestOffering;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.MatchObjectivesSelectorWidget.SetSelectorState
// 0x0001 (0x0001 - 0x0000)
struct MatchObjectivesSelectorWidget_SetSelectorState final 
{
public:
	EMatchQuestsSelectorState                     State;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MatchObjectivesUI.MatchObjectivesSelectorWidget.IsOpenByDefault
// 0x0001 (0x0001 - 0x0000)
struct MatchObjectivesSelectorWidget_IsOpenByDefault final 
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

