#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanUEFNRuntime

#include "Basic.hpp"


namespace SDK
{

// Enum MetaHumanUEFNRuntime.EMetaHumanBodyType
// NumValues: 0x0014
enum class EMetaHumanBodyType : uint8
{
	F_med_nrw                                = 0,
	F_med_ovw                                = 1,
	F_med_unw                                = 2,
	F_srt_nrw                                = 3,
	F_srt_ovw                                = 4,
	F_srt_unw                                = 5,
	F_tal_nrw                                = 6,
	F_tal_ovw                                = 7,
	F_tal_unw                                = 8,
	M_med_nrw                                = 9,
	M_med_ovw                                = 10,
	M_med_unw                                = 11,
	M_srt_nrw                                = 12,
	M_srt_ovw                                = 13,
	M_srt_unw                                = 14,
	M_tal_nrw                                = 15,
	M_tal_ovw                                = 16,
	M_tal_unw                                = 17,
	Count                                    = 18,
	EMetaHumanBodyType_MAX                   = 19,
};

// Enum MetaHumanUEFNRuntime.EMetaHumanBodyBodyPartIndex
// NumValues: 0x0007
enum class EMetaHumanBodyBodyPartIndex : uint8
{
	Body                                     = 0,
	Face                                     = 1,
	Torso                                    = 2,
	Legs                                     = 3,
	Feet                                     = 4,
	Count                                    = 5,
	EMetaHumanBodyBodyPartIndex_MAX          = 6,
};

// ScriptStruct MetaHumanUEFNRuntime.MetaHumanCustomizableBodyPart
// 0x0028 (0x0028 - 0x0000)
struct FMetaHumanCustomizableBodyPart final 
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UControlRig>                ControlRigClass;                                   // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ControlRigLODThreshold;                            // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AAA7[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0018(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RigidBodyLODThreshold;                             // 0x0020(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AAA8[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

