#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotherGameplayUI

#include "Basic.hpp"

#include "GameplayMessages_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class MotherGameplayUI.AvocadoEaterHealthBarWidget
// 0x00A0 (0x03D0 - 0x0330)
class UAvocadoEaterHealthBarWidget final  : public UFortHUDElementWidget
{
public:
	struct FEventMessageTag                       AttachedMessageTag;                                // 0x0330(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9ACA[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          AttachedMessageType;                               // 0x0338(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FEventMessageTag                       DetachedMessageTag;                                // 0x0340(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9ACB[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          DetachedMessageType;                               // 0x0348(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FEventMessageTag                       SetMarkerPositionMessageTag;                       // 0x0350(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9ACC[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          SetMarkerPositionMessageType;                      // 0x0358(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SetMarkerPositionMessagePropertyName;              // 0x0360(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FEventMessageTag                       TargetDamagedMessageTag;                           // 0x0364(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScriptStruct*                          TargetDamagedMessageType;                          // 0x0368(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9ACD[0x60];                                    // 0x0370(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnParasiteAttached();
	void OnParasiteDetached();
	void OnSetMarkerPosition(float MarkerPosition);
	void OnTargetDamaged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AvocadoEaterHealthBarWidget">();
	}
	static class UAvocadoEaterHealthBarWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvocadoEaterHealthBarWidget>();
	}
};

// Class MotherGameplayUI.FortGravyGoblinReticleExtensionWidget
// 0x0020 (0x0388 - 0x0368)
class UFortGravyGoblinReticleExtensionWidget final  : public UFortWeaponReticleExtensionWidgetBase
{
public:
	uint8                                         Pad_9ACE[0x20];                                    // 0x0368(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnItemActivatable();
	void OnItemInactivatable();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGravyGoblinReticleExtensionWidget">();
	}
	static class UFortGravyGoblinReticleExtensionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGravyGoblinReticleExtensionWidget>();
	}
};

// Class MotherGameplayUI.FortLlamaRoasterReticleExtensionWidget
// 0x0000 (0x0368 - 0x0368)
class UFortLlamaRoasterReticleExtensionWidget final  : public UFortWeaponReticleExtensionWidgetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortLlamaRoasterReticleExtensionWidget">();
	}
	static class UFortLlamaRoasterReticleExtensionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortLlamaRoasterReticleExtensionWidget>();
	}
};

// Class MotherGameplayUI.FortPaddleGingerReticleExtensionWidget
// 0x0060 (0x03C8 - 0x0368)
class UFortPaddleGingerReticleExtensionWidget final  : public UFortWeaponReticleExtensionWidgetBase
{
public:
	class UFortKeybindWidget*                     Keybind_ActivateAction;                            // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     Keybind_CycleCategoryAction;                       // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     Keybind_CyclePropAction;                           // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9ACF[0x48];                                    // 0x0380(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPropActivationChanged(bool Activated);
	void OnPropIndexChanged(class FText& CategoryText, int32 PropIndex, int32 MaxPropCount, int32 CategoryIndex, int32 MaxCategoryCount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPaddleGingerReticleExtensionWidget">();
	}
	static class UFortPaddleGingerReticleExtensionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPaddleGingerReticleExtensionWidget>();
	}
};

// Class MotherGameplayUI.FortReactorGradeReticleExtensionWidget
// 0x0000 (0x0368 - 0x0368)
class UFortReactorGradeReticleExtensionWidget final  : public UFortWeaponReticleExtensionWidgetBase
{
public:
	void OnMinimumChargeReached();
	void OnUpdateChargeToAutoDischarge(float ChargePercent);
	void OnUpdateChargeToMin(float ChargePercent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortReactorGradeReticleExtensionWidget">();
	}
	static class UFortReactorGradeReticleExtensionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortReactorGradeReticleExtensionWidget>();
	}
};

// Class MotherGameplayUI.FortMobileActionBBE_GravyGoblinRotate
// 0x0028 (0x00A8 - 0x0080)
class UFortMobileActionBBE_GravyGoblinRotate final  : public UFortMobileActionButtonBehaviorExtension
{
public:
	struct FGameplayTag                           GravyGoblinTag;                                    // 0x0080(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9AD0[0x24];                                    // 0x0084(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionBBE_GravyGoblinRotate">();
	}
	static class UFortMobileActionBBE_GravyGoblinRotate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionBBE_GravyGoblinRotate>();
	}
};

}

