#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MPItemShop_VaultWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VaultWorld_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MPItemShop_VaultWorld.MPItemShop_VaultWorld_C
// 0x0058 (0x03A8 - 0x0350)
class AMPItemShop_VaultWorld_C final  : public AVaultWorld_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MPItemShop_VaultWorld_C;            // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Floor;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FloorVisibility_FloorMask_33DB417F4F318DD14C0CDB92ED647F56; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FloorVisibility__Direction_33DB417F4F318DD14C0CDB92ED647F56; // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CDD3[0x3];                                     // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FloorVisibility;                                   // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_FX_Transition_Fade_A94F40F44CC1E033CF6C509AB9A33280; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionForward_Forward_A94F40F44CC1E033CF6C509AB9A33280; // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionForward__Direction_A94F40F44CC1E033CF6C509AB9A33280; // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CDD4[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TransitionForward;                                 // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DefaultBackgroundMaterial;                         // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DefaultFloorMaterial;                              // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Background;                                        // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          IsMaterialBackground;                              // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void TransitionForward__UpdateFunc();
	void TransitionForward__FinishedFunc();
	void TransitionBackgroundForward(double Forward, double FXTransitionFade, class UMaterialInstanceDynamic* Mid, double CallFunc_Lerp_ReturnValue, double CallFunc_Lerp_ReturnValue_1, float CallFunc_SetScalarParameterValue_Value_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast_1);
	void TransitionBackgroundBackward(double Backward, double FXTransitionFade, class UMaterialInstanceDynamic* Mid, double CallFunc_Lerp_ReturnValue, double CallFunc_Lerp_ReturnValue_1, float CallFunc_SetScalarParameterValue_Value_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast_1);
	void StopTransitions();
	void SetupBackgroundMaterial(class UTexture2D*& TextureBackground, class UMaterialInstanceDynamic* Mid, bool IsFloor, bool FirstTimeSetup, bool Temp_bool_Variable, class FName Temp_name_Variable, class FName Temp_name_Variable_1, bool Temp_bool_Variable_1, class FName Temp_name_Variable_2, class FName Temp_name_Variable_3, bool Temp_bool_Variable_2, class FName Temp_name_Variable_4, class FName Temp_name_Variable_5, bool Temp_bool_Variable_3, float Temp_real_Variable, float Temp_real_Variable_1, class FName Temp_name_Variable_6, float K2Node_Select_Default, bool CallFunc_Not_PreBool_ReturnValue, class FName K2Node_Select_Default_1, bool CallFunc_IsValid_ReturnValue, class FName Temp_name_Variable_7, class FName K2Node_Select_Default_2, class FName K2Node_Select_Default_3, bool Temp_bool_Variable_4, class FName K2Node_Select_Default_4, bool CallFunc_IsValid_ReturnValue_1);
	void Set_Background_from_Child_Actor(class AFortStaticMeshActor* K2Node_DynamicCast_AsFort_Static_Mesh_Actor, bool K2Node_DynamicCast_bSuccess);
	void ReceiveBeginPlay();
	void OnUpdateDisplay(bool bShowFloor, bool bShowEffects);
	void OnTransitionBackground(bool bPlayForward, EBackgroundIntensityLevel IntensityTransition);
	void OnSetupTextureBackground(class UTexture2D* LoadedBackgroundTexture, struct FVaultWorldBackgroundData& BackgroundInfo);
	void OnSetupMaterialBackground(class UMaterialInterface* LoadedBackgroundMaterial, struct FVaultWorldBackgroundData& BackgroundInfo);
	void OnNewSceneBackgroundChildActor(class AFortStaticMeshActor* NewActor);
	void OnInitialBackgroundTransition();
	void HandleTextureBackground(class UTexture2D*& TextureBackground);
	void HandleMaterialBackground(class UMaterialInterface* MaterialBackground, class UTexture2D* Temp_object_Variable, class UTexture2D* Temp_object_Variable_1);
	void FloorVisibility__UpdateFunc();
	void FloorVisibility__FinishedFunc();
	void ExecuteUbergraph_MPItemShop_VaultWorld(int32 EntryPoint, class AFortStaticMeshActor* K2Node_Event_NewActor, bool K2Node_Event_bPlayForward, EBackgroundIntensityLevel K2Node_Event_IntensityTransition, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, class UTexture2D* K2Node_Event_LoadedBackgroundTexture, struct FVaultWorldBackgroundData& K2Node_Event_BackgroundInfo_1, class UMaterialInterface* K2Node_Event_LoadedBackgroundMaterial, struct FVaultWorldBackgroundData& K2Node_Event_BackgroundInfo, bool K2Node_Event_bShowFloor, bool K2Node_Event_bShowEffects, double CallFunc_TransitionBackgroundForward_FXTransitionFade_ImplicitCast, double CallFunc_TransitionBackgroundForward_FXTransitionFade_ImplicitCast_1, double CallFunc_TransitionBackgroundForward_Forward_ImplicitCast, double CallFunc_TransitionBackgroundForward_Forward_ImplicitCast_1);
	void AssignFloorMaterial(class UMaterialInterface* SourceMaterial, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue);
	void AssignBackgroundMaterial(class UMaterialInterface* SourceMaterial, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MPItemShop_VaultWorld_C">();
	}
	static class AMPItemShop_VaultWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMPItemShop_VaultWorld_C>();
	}
};

}

