#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NevadaUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "NevadaRuntime_structs.hpp"


namespace SDK
{

// Class NevadaUI.FortNevadaVehicleReticle
// 0x00A8 (0x05E0 - 0x0538)
class UFortNevadaVehicleReticle final  : public UFortAthenaVehicleDashboardWidget
{
public:
	TSubclassOf<class UNevadaTargetIndicator>     NevadaTargetIndicatorClass;                        // 0x0538(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNevadaTargetIndicator*                 TargetIndicator;                                   // 0x0540(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortNevadaVehicle*                     OwningNevadaVehicle;                               // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A5F6[0x8];                                     // 0x0550(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserWidgetPool                        IndicatorPool;                                     // 0x0558(0x0088)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void OnBatteryChanged(float BatteryLevel);
	void OnEnergyCannonEnabledChanged(bool bEnabled);
	void OnEnergyCanonFired(float Cooldown);
	void OnTractorBeamActivated();
	void OnTractorBeamAttached();
	void OnTractorBeamChargeStarted();
	void OnTractorBeamDeactivated(float Cooldown);
	void OnTractorBeamDetached();
	void OnTractorBeamEnabledChanged(bool bEnabled);
	void OnVehicleStateChanged(ENevadaFlightStates VehicleState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortNevadaVehicleReticle">();
	}
	static class UFortNevadaVehicleReticle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNevadaVehicleReticle>();
	}
};

// Class NevadaUI.NevadaTargetIndicator
// 0x0000 (0x03D8 - 0x03D8)
class UNevadaTargetIndicator final  : public UFortActorIndicatorWidget
{
public:
	void OnTractorBeamActivated(bool bActivated);
	void OnTractorBeamAttached(bool bAttached);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NevadaTargetIndicator">();
	}
	static class UNevadaTargetIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNevadaTargetIndicator>();
	}
};

}

