#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_VoiceComponent

#include "Basic.hpp"

#include "FortniteAI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_VoiceComponent.NPC_VoiceComponent_C
// 0x0030 (0x00D8 - 0x00A8)
class UNPC_VoiceComponent_C final  : public UFortAIComponent_Voice
{
public:
	class UFortTaggedSoundBank*                   DeprecatedBPSoundBank;                             // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachComponent;                                   // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        TriggerTimeThreshold;                              // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastTriggerTime;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Component;                                   // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundEffectSourcePresetChain*          SourceChainToApply;                                // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Deprecated_Set_Sound_Bank(class UFortTaggedSoundBank* SoundBank);
	void Internal_Get_Voice_Sound_Bank(class UFortTaggedSoundBank** Sound_Bank, class UFortTaggedSoundBank* CallFunc_GetVoiceSoundBank_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void PlaySoundCue(class USoundCue* SoundToPlay, class UAudioComponent* AudioComponent, bool* Success, bool CallFunc_IsValid_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void PlayVoiceLine(struct FGameplayTag& Gameplay_Tag, class UAudioComponent* AudioComponent, bool* Success, class USoundBase* SoundToPlay, const struct FGameplayTag& CurrentVOTag, class UFortTaggedSoundBank* SoundBankToUse, class AActor* CallFunc_GetOwner_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UFortTaggedSoundBank* CallFunc_Internal_Get_Voice_Sound_Bank_Sound_Bank, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsGameplayTagValid_ReturnValue, double CallFunc_GetTimeSeconds_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FGameplayTagContainer& CallFunc_MakeGameplayTagContainerFromTag_ReturnValue, double CallFunc_GetTimeSeconds_ReturnValue_1, class USoundBase* CallFunc_GetSoundToPlay_ReturnValue);
	void SetSourceEffectChainToApply(class USoundEffectSourcePresetChain* SourceEffectChain);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_VoiceComponent_C">();
	}
	static class UNPC_VoiceComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_VoiceComponent_C>();
	}
};

}

