#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhysicsControl

#include "Basic.hpp"

#include "PhysicsControl_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PhysicsControl.PhysicsControlBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UPhysicsControlBPLibrary final  : public UBlueprintFunctionLibrary
{
public:
	static void AddControlParameters(struct FPhysicsControlControlAndModifierParameters& InParameters, struct FPhysicsControlControlAndModifierParameters* OutParameters, class FName Param_Name, struct FPhysicsControlSparseData& ControlData);
	static void AddModifierParameters(struct FPhysicsControlControlAndModifierParameters& InParameters, struct FPhysicsControlControlAndModifierParameters* OutParameters, class FName Param_Name, struct FPhysicsControlModifierSparseData& ModifierData);
	static void AddMultipleControlParameters(struct FPhysicsControlControlAndModifierParameters& InParameters, struct FPhysicsControlControlAndModifierParameters* OutParameters, TArray<class FName>& Names, struct FPhysicsControlSparseData& ControlData);
	static void AddMultipleModifierParameters(struct FPhysicsControlControlAndModifierParameters& InParameters, struct FPhysicsControlControlAndModifierParameters* OutParameters, TArray<class FName>& Names, struct FPhysicsControlModifierSparseData& ModifierData);
	static void BlendControlParametersThroughSet(struct FPhysicsControlControlAndModifierParameters& InParameters, struct FPhysicsControlNamedControlParameters& InStartControlParameters, struct FPhysicsControlNamedControlParameters& InEndControlParameters, TArray<class FName>& ControlNames, struct FPhysicsControlControlAndModifierParameters* OutParameters);
	static void BlendModifierParametersThroughSet(struct FPhysicsControlControlAndModifierParameters& InParameters, struct FPhysicsControlNamedModifierParameters& InStartModifierParameters, struct FPhysicsControlNamedModifierParameters& InEndModifierParameters, TArray<class FName>& ModifierNames, struct FPhysicsControlControlAndModifierParameters* OutParameters);
	static void BlendParameters(struct FPhysicsControlControlAndModifierParameters& InParametersA, struct FPhysicsControlControlAndModifierParameters& InParametersB, float InInterpolationWeight, struct FPhysicsControlControlAndModifierParameters* OutParameters);
	static struct FRigidBodyWithControlReference ConvertToRigidBodyWithControl(struct FAnimNodeReference& Node, EAnimNodeReferenceConversionResult* Result);
	static void ConvertToRigidBodyWithControlPure(struct FAnimNodeReference& Node, struct FRigidBodyWithControlReference* RigidBodyWithControl, bool* Result);
	static TArray<class FName> GetBodyModifierNamesInSet(struct FRigidBodyWithControlReference& RigidBodyWithControl, class FName SetName);
	static TArray<class FName> GetControlNamesInSet(struct FRigidBodyWithControlReference& RigidBodyWithControl, class FName SetName);
	static struct FRigidBodyWithControlReference SetOverridePhysicsAsset(struct FRigidBodyWithControlReference& Node, class UPhysicsAsset* PhysicsAsset);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsControlBPLibrary">();
	}
	static class UPhysicsControlBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlBPLibrary>();
	}
};

// Class PhysicsControl.PhysicsControlComponent
// 0x0250 (0x0470 - 0x0220)
class UPhysicsControlComponent final  : public USceneComponent
{
public:
	TSoftObjectPtr<class UPhysicsControlProfileAsset> PhysicsControlProfileAsset;                        // 0x0220(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TeleportDistanceThreshold;                         // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TeleportRotationThreshold;                         // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebugVisualization;                           // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_897E[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VisualizationSizeScale;                            // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebugControlList;                             // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_897F[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugControlDetailFilter;                          // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebugBodyModifierList;                        // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8980[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugBodyModifierDetailFilter;                     // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityPredictionTime;                            // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumControlsOrModifiersPerName;                  // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarnAboutInvalidNames;                            // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8981[0x1E7];                                   // 0x0289(0x01E7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddBodyModifiersToSet(struct FPhysicsControlNames* NewSet, TArray<class FName>& BodyModifiers, class FName Set);
	void AddBodyModifierToSet(struct FPhysicsControlNames* NewSet, class FName BodyModifier, class FName Set);
	void AddControlsToSet(struct FPhysicsControlNames* NewSet, TArray<class FName>& Controls, class FName Set);
	void AddControlToSet(struct FPhysicsControlNames* NewSet, class FName Control, class FName Set);
	class FName CreateBodyModifier(class UMeshComponent* MeshComponent, class FName BoneName, class FName Set, struct FPhysicsControlModifierData& BodyModifierData);
	TMap<class FName, struct FPhysicsControlNames> CreateBodyModifiersFromLimbBones(struct FPhysicsControlNames* AllBodyModifiers, TMap<class FName, struct FPhysicsControlLimbBones>& LimbBones, struct FPhysicsControlModifierData& BodyModifierData);
	TArray<class FName> CreateBodyModifiersFromSkeletalMeshBelow(class USkeletalMeshComponent* SkeletalMeshComponent, class FName BoneName, bool bIncludeSelf, class FName Set, struct FPhysicsControlModifierData& BodyModifierData);
	class FName CreateControl(class UMeshComponent* ParentMeshComponent, class FName ParentBoneName, class UMeshComponent* ChildMeshComponent, class FName ChildBoneName, struct FPhysicsControlData& ControlData, struct FPhysicsControlTarget& ControlTarget, class FName Set, const class FString& NamePrefix);
	void CreateControlsAndBodyModifiersFromControlProfileAsset(class USkeletalMeshComponent* SkeletalMeshComponent, class UMeshComponent* WorldComponent, class FName WorldBoneName);
	void CreateControlsAndBodyModifiersFromLimbBones(struct FPhysicsControlNames* AllWorldSpaceControls, TMap<class FName, struct FPhysicsControlNames>* LimbWorldSpaceControls, struct FPhysicsControlNames* AllParentSpaceControls, TMap<class FName, struct FPhysicsControlNames>* LimbParentSpaceControls, struct FPhysicsControlNames* AllBodyModifiers, TMap<class FName, struct FPhysicsControlNames>* LimbBodyModifiers, class USkeletalMeshComponent* SkeletalMeshComponent, TArray<struct FPhysicsControlLimbSetupData>& LimbSetupData, struct FPhysicsControlData& WorldSpaceControlData, struct FPhysicsControlData& ParentSpaceControlData, struct FPhysicsControlModifierData& BodyModifierData, class UMeshComponent* WorldComponent, class FName WorldBoneName);
	TMap<class FName, struct FPhysicsControlNames> CreateControlsFromLimbBones(struct FPhysicsControlNames* AllControls, TMap<class FName, struct FPhysicsControlLimbBones>& LimbBones, EPhysicsControlType ControlType, struct FPhysicsControlData& ControlData, class UMeshComponent* WorldComponent, class FName WorldBoneName, const class FString& NamePrefix);
	TMap<class FName, struct FPhysicsControlNames> CreateControlsFromLimbBonesAndConstraintProfile(struct FPhysicsControlNames* AllControls, TMap<class FName, struct FPhysicsControlLimbBones>& LimbBones, class FName ConstraintProfile, bool bEnabled);
	TArray<class FName> CreateControlsFromSkeletalMesh(class USkeletalMeshComponent* SkeletalMeshComponent, TArray<class FName>& BoneNames, EPhysicsControlType ControlType, struct FPhysicsControlData& ControlData, class FName Set);
	TArray<class FName> CreateControlsFromSkeletalMeshAndConstraintProfile(class USkeletalMeshComponent* SkeletalMeshComponent, TArray<class FName>& BoneNames, class FName ConstraintProfile, class FName Set, bool bEnabled);
	TArray<class FName> CreateControlsFromSkeletalMeshAndConstraintProfileBelow(class USkeletalMeshComponent* SkeletalMeshComponent, class FName BoneName, bool bIncludeSelf, class FName ConstraintProfile, class FName Set, bool bEnabled);
	TArray<class FName> CreateControlsFromSkeletalMeshBelow(class USkeletalMeshComponent* SkeletalMeshComponent, class FName BoneName, bool bIncludeSelf, EPhysicsControlType ControlType, struct FPhysicsControlData& ControlData, class FName Set);
	bool CreateNamedBodyModifier(class FName Param_Name, class UMeshComponent* MeshComponent, class FName BoneName, class FName Set, struct FPhysicsControlModifierData& BodyModifierData);
	bool CreateNamedControl(class FName Param_Name, class UMeshComponent* ParentMeshComponent, class FName ParentBoneName, class UMeshComponent* ChildMeshComponent, class FName ChildBoneName, struct FPhysicsControlData& ControlData, struct FPhysicsControlTarget& ControlTarget, class FName Set);
	bool DestroyBodyModifier(class FName Param_Name);
	void DestroyBodyModifiers(TArray<class FName>& Names);
	void DestroyBodyModifiersInSet(class FName Set);
	bool DestroyControl(class FName Param_Name);
	void DestroyControls(TArray<class FName>& Names);
	void DestroyControlsInSet(class FName Set);
	TArray<struct FVector> GetCachedBoneAngularVelocities(class USkeletalMeshComponent* SkeletalMeshComponent, TArray<class FName>& BoneNames);
	struct FVector GetCachedBoneAngularVelocity(class USkeletalMeshComponent* SkeletalMeshComponent, class FName BoneName);
	struct FRotator GetCachedBoneOrientation(class USkeletalMeshComponent* SkeletalMeshComponent, class FName BoneName);
	TArray<struct FRotator> GetCachedBoneOrientations(class USkeletalMeshComponent* SkeletalMeshComponent, TArray<class FName>& BoneNames);
	struct FVector GetCachedBonePosition(class USkeletalMeshComponent* SkeletalMeshComponent, class FName BoneName);
	TArray<struct FVector> GetCachedBonePositions(class USkeletalMeshComponent* SkeletalMeshComponent, TArray<class FName>& BoneNames);
	struct FTransform GetCachedBoneTransform(class USkeletalMeshComponent* SkeletalMeshComponent, class FName BoneName);
	TArray<struct FTransform> GetCachedBoneTransforms(class USkeletalMeshComponent* SkeletalMeshComponent, TArray<class FName>& BoneNames);
	TArray<struct FVector> GetCachedBoneVelocities(class USkeletalMeshComponent* SkeletalMeshComponent, TArray<class FName>& BoneNames);
	struct FVector GetCachedBoneVelocity(class USkeletalMeshComponent* SkeletalMeshComponent, class FName BoneName);
	void InvokeControlProfile(class FName ProfileName);
	void ResetBodyModifiersInSetToCachedBoneTransforms(class FName SetName, EResetToCachedTargetBehavior Behavior);
	void ResetBodyModifiersToCachedBoneTransforms(TArray<class FName>& Names, EResetToCachedTargetBehavior Behavior);
	bool ResetBodyModifierToCachedBoneTransform(class FName Param_Name, EResetToCachedTargetBehavior Behavior);
	bool ResetControlPoint(class FName Param_Name);
	bool SetBodyModifierCollisionType(class FName Param_Name, ECollisionEnabled CollisionType);
	bool SetBodyModifierData(class FName Param_Name, struct FPhysicsControlModifierData& ModifierData);
	void SetBodyModifierDatas(TArray<class FName>& Names, struct FPhysicsControlModifierData& ModifierData);
	void SetBodyModifierDatasInSet(class FName Set, struct FPhysicsControlModifierData& ModifierData);
	bool SetBodyModifierGravityMultiplier(class FName Param_Name, float GravityMultiplier);
	bool SetBodyModifierKinematicTarget(class FName Param_Name, struct FVector& KinematicTargetPosition, struct FRotator& KinematicTargetOrienation, bool bMakeKinematic);
	bool SetBodyModifierMovementType(class FName Param_Name, EPhysicsMovementType MovementType);
	bool SetBodyModifierPhysicsBlendWeight(class FName Param_Name, float PhysicsBlendWeight);
	void SetBodyModifiersCollisionType(TArray<class FName>& Names, ECollisionEnabled CollisionType);
	void SetBodyModifiersGravityMultiplier(TArray<class FName>& Names, float GravityMultiplier);
	void SetBodyModifiersInSetCollisionType(class FName Set, ECollisionEnabled CollisionType);
	void SetBodyModifiersInSetGravityMultiplier(class FName Set, float GravityMultiplier);
	void SetBodyModifiersInSetMovementType(class FName Set, EPhysicsMovementType MovementType);
	void SetBodyModifiersInSetPhysicsBlendWeight(class FName Set, float PhysicsBlendWeight);
	void SetBodyModifiersInSetUpdateKinematicFromSimulation(class FName Set, bool bUpdateKinematicFromSimulation);
	void SetBodyModifiersInSetUseSkeletalAnimation(class FName Set, bool bUseSkeletalAnimation);
	void SetBodyModifiersMovementType(TArray<class FName>& Names, EPhysicsMovementType MovementType);
	bool SetBodyModifierSparseData(class FName Param_Name, struct FPhysicsControlModifierSparseData& ModifierData);
	void SetBodyModifierSparseDatas(TArray<class FName>& Names, struct FPhysicsControlModifierSparseData& ModifierData);
	void SetBodyModifierSparseDatasInSet(class FName Set, struct FPhysicsControlModifierSparseData& ModifierData);
	void SetBodyModifiersPhysicsBlendWeight(TArray<class FName>& Names, float PhysicsBlendWeight);
	void SetBodyModifiersUpdateKinematicFromSimulation(TArray<class FName>& Names, bool bUpdateKinematicFromSimulation);
	void SetBodyModifiersUseSkeletalAnimation(TArray<class FName>& Names, bool bUseSkeletalAnimation);
	bool SetBodyModifierUpdateKinematicFromSimulation(class FName Param_Name, bool bUpdateKinematicFromSimulation);
	bool SetBodyModifierUseSkeletalAnimation(class FName Param_Name, bool bUseSkeletalAnimation);
	bool SetCachedBoneData(class USkeletalMeshComponent* SkeletalMeshComponent, class FName BoneName, struct FTransform& TM, struct FVector& Velocity, struct FVector& AngularVelocity);
	bool SetControlAngularData(class FName Param_Name, float Strength, float DampingRatio, float ExtraDamping, float MaxTorque, bool bEnableControl);
	bool SetControlData(class FName Param_Name, struct FPhysicsControlData& ControlData);
	void SetControlDatas(TArray<class FName>& Names, struct FPhysicsControlData& ControlData);
	void SetControlDatasInSet(class FName Set, struct FPhysicsControlData& ControlData);
	bool SetControlDisableCollision(class FName Param_Name, bool bDisableCollision);
	bool SetControlEnabled(class FName Param_Name, bool bEnable);
	bool SetControlLinearData(class FName Param_Name, float Strength, float DampingRatio, float ExtraDamping, float MaxForce, bool bEnableControl);
	bool SetControlMultiplier(class FName Param_Name, struct FPhysicsControlMultiplier& ControlMultiplier, bool bEnableControl);
	void SetControlMultipliers(TArray<class FName>& Names, struct FPhysicsControlMultiplier& ControlMultiplier, bool bEnableControl);
	void SetControlMultipliersInSet(class FName Set, struct FPhysicsControlMultiplier& ControlMultiplier, bool bEnableControl);
	bool SetControlParent(class FName Param_Name, class UMeshComponent* ParentMeshComponent, class FName ParentBoneName);
	void SetControlParents(TArray<class FName>& Names, class UMeshComponent* ParentMeshComponent, class FName ParentBoneName);
	void SetControlParentsInSet(class FName Set, class UMeshComponent* ParentMeshComponent, class FName ParentBoneName);
	bool SetControlPoint(class FName Param_Name, struct FVector& Position);
	void SetControlsDisableCollision(TArray<class FName>& Names, bool bDisableCollision);
	void SetControlsEnabled(TArray<class FName>& Names, bool bEnable);
	void SetControlsInSetDisableCollision(class FName Set, bool bDisableCollision);
	void SetControlsInSetEnabled(class FName Set, bool bEnable);
	void SetControlsInSetUseSkeletalAnimation(class FName Set, bool bUseSkeletalAnimation, float SkeletalAnimationVelocityMultiplier);
	bool SetControlSparseData(class FName Param_Name, struct FPhysicsControlSparseData& ControlData);
	void SetControlSparseDatas(TArray<class FName>& Names, struct FPhysicsControlSparseData& ControlData);
	void SetControlSparseDatasInSet(class FName Set, struct FPhysicsControlSparseData& ControlData);
	bool SetControlSparseMultiplier(class FName Param_Name, struct FPhysicsControlSparseMultiplier& ControlMultiplier, bool bEnableControl);
	void SetControlSparseMultipliers(TArray<class FName>& Names, struct FPhysicsControlSparseMultiplier& ControlMultiplier, bool bEnableControl);
	void SetControlSparseMultipliersInSet(class FName Set, struct FPhysicsControlSparseMultiplier& ControlMultiplier, bool bEnableControl);
	void SetControlsUseSkeletalAnimation(TArray<class FName>& Names, bool bUseSkeletalAnimation, float SkeletalAnimationVelocityMultiplier);
	bool SetControlTarget(class FName Param_Name, struct FPhysicsControlTarget& ControlTarget, bool bEnableControl);
	bool SetControlTargetOrientation(class FName Param_Name, struct FRotator& Orientation, float AngularVelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	void SetControlTargetOrientations(TArray<class FName>& Names, struct FRotator& Orientation, float AngularVelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	bool SetControlTargetOrientationsFromArray(TArray<class FName>& Names, TArray<struct FRotator>& Orientations, float VelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	void SetControlTargetOrientationsInSet(class FName SetName, struct FRotator& Orientation, float AngularVelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	bool SetControlTargetPoses(class FName Param_Name, struct FVector& ParentPosition, struct FRotator& ParentOrientation, struct FVector& ChildPosition, struct FRotator& ChildOrientation, float VelocityDeltaTime, bool bEnableControl);
	bool SetControlTargetPosition(class FName Param_Name, struct FVector& Position, float VelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	bool SetControlTargetPositionAndOrientation(class FName Param_Name, struct FVector& Position, struct FRotator& Orientation, float VelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	void SetControlTargetPositions(TArray<class FName>& Names, struct FVector& Position, float VelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	void SetControlTargetPositionsAndOrientations(TArray<class FName>& Names, struct FVector& Position, struct FRotator& Orientation, float VelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	bool SetControlTargetPositionsAndOrientationsFromArray(TArray<class FName>& Names, TArray<struct FVector>& Positions, TArray<struct FRotator>& Orientations, float VelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	void SetControlTargetPositionsAndOrientationsInSet(class FName SetName, struct FVector& Position, struct FRotator& Orientation, float VelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	bool SetControlTargetPositionsFromArray(TArray<class FName>& Names, TArray<struct FVector>& Positions, float VelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	void SetControlTargetPositionsInSet(class FName SetName, struct FVector& Position, float VelocityDeltaTime, bool bEnableControl, bool bApplyControlPointToTarget);
	void SetControlTargets(TArray<class FName>& Names, struct FPhysicsControlTarget& ControlTarget, bool bEnableControl);
	void SetControlTargetsInSet(class FName Set, struct FPhysicsControlTarget& ControlTarget, bool bEnableControl);
	bool SetControlUseSkeletalAnimation(class FName Param_Name, bool bUseSkeletalAnimation, float SkeletalAnimationVelocityMultiplier);
	void UpdateControls(float DeltaTime);
	void UpdateTargetCaches(float DeltaTime);

	const TArray<class FName> GetAllBodyModifierNames() const;
	const TArray<class FName> GetAllControlNames() const;
	bool GetBodyModifierExists(class FName Param_Name) const;
	const TArray<class FName> GetBodyModifierNamesInSet(class FName Set) const;
	bool GetControlData(class FName Param_Name, struct FPhysicsControlData* ControlData) const;
	bool GetControlEnabled(class FName Param_Name) const;
	bool GetControlExists(class FName Param_Name) const;
	bool GetControlMultiplier(class FName Param_Name, struct FPhysicsControlMultiplier* ControlMultiplier) const;
	const TArray<class FName> GetControlNamesInSet(class FName Set) const;
	bool GetControlTarget(class FName Param_Name, struct FPhysicsControlTarget* ControlTarget) const;
	TMap<class FName, struct FPhysicsControlLimbBones> GetLimbBonesFromSkeletalMesh(class USkeletalMeshComponent* SkeletalMeshComponent, TArray<struct FPhysicsControlLimbSetupData>& LimbSetupData) const;
	TArray<class FName> GetSetsContainingBodyModifier(class FName Control) const;
	TArray<class FName> GetSetsContainingControl(class FName Control) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsControlComponent">();
	}
	static class UPhysicsControlComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlComponent>();
	}
};

// Class PhysicsControl.PhysicsControlProfileAsset
// 0x01E8 (0x0210 - 0x0028)
class UPhysicsControlProfileAsset final  : public UObject
{
public:
	uint8                                         Pad_8A07[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlCharacterSetupData      CharacterSetupData;                                // 0x0030(0x00C0)(NativeAccessSpecifierPublic)
	struct FPhysicsControlAndBodyModifierCreationDatas AdditionalControlsAndModifiers;                    // 0x00F0(0x00A0)(NativeAccessSpecifierPublic)
	struct FPhysicsControlSetUpdates              AdditionalSets;                                    // 0x0190(0x0020)(NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlControlAndModifierUpdates> InitialControlAndModifierUpdates;                  // 0x01B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlControlAndModifierUpdates> Profiles;                                          // 0x01C0(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsControlProfileAsset">();
	}
	static class UPhysicsControlProfileAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlProfileAsset>();
	}
};

// Class PhysicsControl.PhysicsControlInitializerComponent
// 0x0180 (0x03A0 - 0x0220)
class UPhysicsControlInitializerComponent final  : public USceneComponent
{
public:
	struct FInitialCharacterControls              InitialCharacterControls;                          // 0x0220(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FInitialPhysicsControl> InitialControls;                                   // 0x02F0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FInitialBodyModifier> InitialBodyModifiers;                              // 0x0340(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bCreateControlsAtBeginPlay;                        // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A08[0xF];                                     // 0x0391(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateControls(class UPhysicsControlComponent* PhysicsControlComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsControlInitializerComponent">();
	}
	static class UPhysicsControlInitializerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlInitializerComponent>();
	}
};

// Class PhysicsControl.PhysicsControlActor
// 0x0010 (0x02A0 - 0x0290)
class APhysicsControlActor final  : public AActor
{
public:
	class UPhysicsControlComponent*               ControlComponent;                                  // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPhysicsControlInitializerComponent*    ControlInitializerComponent;                       // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsControlActor">();
	}
	static class APhysicsControlActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APhysicsControlActor>();
	}
};

}

