#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_FullBodyAimOffsets_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Player_FullBodyAimOffsets_AnimBP_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_FullBodyAimOffsets_AnimBP.Player_FullBodyAimOffsets_AnimBP_C
// 0x2370 (0x3700 - 0x1390)
class UPlayer_FullBodyAimOffsets_AnimBP_C final  : public UFortPlayerAnimInstanceProxy
{
public:
	uint8                                         Pad_C013[0x8];                                     // 0x1388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Player_FullBodyAimOffsets_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x1398(0x0018)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x13B0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x13B8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x13C0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_30;                  // 0x13E0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x1490(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_29;                  // 0x14B0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x1560(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_28;                  // 0x1580(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x1630(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_27;                  // 0x1650(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x1700(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_26;                  // 0x1720(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x17D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_25;                  // 0x17F0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x18A0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_24;                  // 0x18C0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x1970(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x1990(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x19B0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x19D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_23;                  // 0x19F0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x1AA0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_22;                  // 0x1AC0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x1B70(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x1B90(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x1BB0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x1BD0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_21;                  // 0x1BF0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1CA0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_20;                  // 0x1CC0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_19;                  // 0x1D70(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x1E20(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x1E40(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x1EF0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x1F10(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1FC0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x1FE0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x2090(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x2140(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x2160(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x2210(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x2230(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x22E0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x2300(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x23B0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x23D0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x2480(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x24A0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x2550(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x2600(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x2620(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x26D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x26F0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x27A0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x2850(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x2870(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x2920(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x29D0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x2A80(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x2AA0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x2B50(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x2B70(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x2C88(0x0118)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x2DA0(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x2E60(0x0078)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x2ED8(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x2F88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x2FB0(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2FD8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x2FF8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x3020(0x0078)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x3098(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x3160(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x3228(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x3250(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x3278(0x0028)()
	struct FAnimNode_ResetRoot                    AnimGraphNode_ResetRoot;                           // 0x32A0(0x00D8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3378(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x3398(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x33B8(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3430(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3458(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x34A0(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x34C8(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x3590(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3640(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x36B8(0x0028)()
	double                                        __CustomProperty_Pitch_61C65E4944F5DB18DC8B6496B9622A88; // 0x36E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Yaw_61C65E4944F5DB18DC8B6496B9622A88; // 0x36E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_AimOffsetAlpha_61C65E4944F5DB18DC8B6496B9622A88; // 0x36F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_Player_FullBodyAimOffsets_AnimBP(int32 EntryPoint);
	void FullBodyAimingOffsetsLayer(const struct FPoseLink& InFullBodyAimOffsetsBasePose, struct FPoseLink* Param_FullBodyAimingOffsetsLayer);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, double AimOffsetAlpha, double Yaw, double Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* Param_ItemAimOffset);
	void ItemFallAdditive(const struct FPoseLink& InPoseItemFallAdditive, struct FPoseLink* Param_ItemFallAdditive);
	void ItemFallLandAdditive(const struct FPoseLink& InPoseItemFallLandAdditive, struct FPoseLink* Param_ItemFallLandAdditive);
	void ItemFinalPoseOverride(const struct FPoseLink& InFinalPose, struct FPoseLink* Param_ItemFinalPoseOverride);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* Param_ItemFullBodyOverride);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* Param_ItemIdleAdditive);
	void ItemJetPackJumpAdditive(struct FPoseLink* Param_ItemJetPackJumpAdditive);
	void ItemJetPackStartAdditive(struct FPoseLink* Param_ItemJetPackStartAdditive);
	void ItemJumpLoopAdditive(const struct FPoseLink& InPoseItemJumpLoopAdditive, struct FPoseLink* Param_ItemJumpLoopAdditive);
	void ItemJumpUpAdditive(const struct FPoseLink& InPoseItemJumpUpAdditive, struct FPoseLink* Param_ItemJumpUpAdditive);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* Param_ItemLowerBodyMovement);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* Param_ItemPreIK);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* Param_ItemRelaxedEntry);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* Param_ItemSkeletalControl);
	void ItemSwimJumpFallLoop(struct FPoseLink* Param_ItemSwimJumpFallLoop);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* Param_ItemSwimJumpSurfaceEnd);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* Param_ItemSwimJumpSurfaceLoop);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* Param_ItemUpperBody);
	void ItemZipLineStartAdditive(struct FPoseLink* Param_ItemZipLineStartAdditive);
	void MovementMode_AimOffset(const struct FPoseLink& InAimOffsetsPose, const struct FPoseLink& InSourcePosePreAimOffsets, struct FPoseLink* Param_MovementMode_AimOffset);
	void MovementMode_FinalPoseOverride(const struct FPoseLink& InFinalPose, struct FPoseLink* Param_MovementMode_FinalPoseOverride);
	void MovementMode_FullBodyOverride(const struct FPoseLink& InputPoseFullBody, struct FPoseLink* Param_MovementMode_FullBodyOverride);
	void MovementMode_LocomotionAdditives(const struct FPoseLink& InLocomotionAdditivesPose, struct FPoseLink* Param_MovementMode_LocomotionAdditives);
	void MovementMode_LowerBodyOverride(const struct FPoseLink& InLowerBodyPose, const struct FPoseLink& InSourcePose, struct FPoseLink* Param_MovementMode_LowerBodyOverride);
	void MovementMode_SourcePose(const struct FPoseLink& InSourcePoseBase, struct FPoseLink* Param_MovementMode_SourcePose);
	void VehicleFinalPoseOverride(const struct FPoseLink& InFinalPose, struct FPoseLink* Param_VehicleFinalPoseOverride);
	void VehicleFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* Param_VehicleFullBodyOverride);
	void VehicleLowerBodyOverride(const struct FPoseLink& InPoseLowerBodyDefault, const struct FPoseLink& InPoseUpperBody, struct FPoseLink* Param_VehicleLowerBodyOverride);
	void VehicleSplitBodyOverride(const struct FPoseLink& InPoseSplitBody, const struct FPoseLink& InPoseUpperAndLowerBody, const struct FPoseLink& InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink* Param_VehicleSplitBodyOverride);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_FullBodyAimOffsets_AnimBP_C">();
	}
	static class UPlayer_FullBodyAimOffsets_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_FullBodyAimOffsets_AnimBP_C>();
	}
};

}

