#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_SourcePose_AnimBP

#include "Basic.hpp"

#include "Player_SourcePose_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_SourcePose_AnimBP.Player_SourcePose_AnimBP_C
// 0x04E0 (0x1870 - 0x1390)
class UPlayer_SourcePose_AnimBP_C final  : public UFortPlayerAnimInstanceProxy
{
public:
	uint8                                         Pad_B764[0x8];                                     // 0x1388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Player_SourcePose_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x1398(0x0088)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1420(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x1428(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x14D0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x14D8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x14F8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x1540(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x1588(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x15C8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x1608(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1648(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1690(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x16D8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1718(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x1760(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x17A0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x17E0(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1820(0x0048)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_Player_SourcePose_AnimBP(int32 EntryPoint);
	void ResetBlendListNode(struct FAnimUpdateContext& Context, struct FAnimNodeReference& Node, EAnimNodeReferenceConversionResult CallFunc_ConvertToBlendListBase_Result, const struct FBlendListBaseReference& CallFunc_ConvertToBlendListBase_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_SourcePose_AnimBP_C">();
	}
	static class UPlayer_SourcePose_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_SourcePose_AnimBP_C>();
	}
};

}

