#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_LocomotionAdditives_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_AnimGraph final 
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ExecuteUbergraph_Player_LocomotionAdditives_AnimBP
// 0x0004 (0x0004 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ExecuteUbergraph_Player_LocomotionAdditives_AnimBP final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.IdleAdditiveLayer
// 0x0010 (0x0010 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_IdleAdditiveLayer final 
{
public:
	struct FPoseLink                              Param_IdleAdditiveLayer;                           // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemAimOffset
// 0x0048 (0x0048 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemAimOffset final 
{
public:
	struct FPoseLink                              InPose_AimOffset;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        AimOffsetAlpha;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Yaw;                                               // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Pitch;                                             // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              InPose_UpperLowerPreMeleeAO;                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemAimOffset;                               // 0x0038(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemFallAdditive
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemFallAdditive final 
{
public:
	struct FPoseLink                              InPoseItemFallAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemFallAdditive;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemFallLandAdditive
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemFallLandAdditive final 
{
public:
	struct FPoseLink                              InPoseItemFallLandAdditive;                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemFallLandAdditive;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemFinalPoseOverride
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemFinalPoseOverride final 
{
public:
	struct FPoseLink                              InFinalPose;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemFinalPoseOverride;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemFullBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemFullBodyOverride final 
{
public:
	struct FPoseLink                              InPoseFullBody;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemFullBodyOverride;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemIdleAdditive
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemIdleAdditive final 
{
public:
	struct FPoseLink                              InPoseIdleAdditive;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemIdleAdditive;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemJetPackJumpAdditive
// 0x0010 (0x0010 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemJetPackJumpAdditive final 
{
public:
	struct FPoseLink                              Param_ItemJetPackJumpAdditive;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemJetPackStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemJetPackStartAdditive final 
{
public:
	struct FPoseLink                              Param_ItemJetPackStartAdditive;                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemJumpLoopAdditive
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemJumpLoopAdditive final 
{
public:
	struct FPoseLink                              InPoseItemJumpLoopAdditive;                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJumpLoopAdditive;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemJumpUpAdditive
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemJumpUpAdditive final 
{
public:
	struct FPoseLink                              InPoseItemJumpUpAdditive;                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemJumpUpAdditive;                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemLowerBodyMovement
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemLowerBodyMovement final 
{
public:
	struct FPoseLink                              InPoseLowerBodyMovement;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemLowerBodyMovement;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemPreIK
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemPreIK final 
{
public:
	struct FPoseLink                              InPose_PreIK;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemPreIK;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemRelaxedEntry
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemRelaxedEntry final 
{
public:
	struct FPoseLink                              InPoseRelaxedEntry;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemRelaxedEntry;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemSkeletalControl
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemSkeletalControl final 
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemSkeletalControl;                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemSwimJumpFallLoop
// 0x0010 (0x0010 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemSwimJumpFallLoop final 
{
public:
	struct FPoseLink                              Param_ItemSwimJumpFallLoop;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemSwimJumpSurfaceEnd
// 0x0010 (0x0010 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemSwimJumpSurfaceEnd final 
{
public:
	struct FPoseLink                              Param_ItemSwimJumpSurfaceEnd;                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemSwimJumpSurfaceLoop
// 0x0010 (0x0010 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemSwimJumpSurfaceLoop final 
{
public:
	struct FPoseLink                              Param_ItemSwimJumpSurfaceLoop;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemUpperBody
// 0x0288 (0x0288 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemUpperBody final 
{
public:
	struct FPoseLink                              InPoseUpperBody;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_AdjustedAim             InputParam;                                        // 0x0010(0x0268)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ItemUpperBody;                               // 0x0278(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.ItemZipLineStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_ItemZipLineStartAdditive final 
{
public:
	struct FPoseLink                              Param_ItemZipLineStartAdditive;                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_AimOffset
// 0x0030 (0x0030 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_MovementMode_AimOffset final 
{
public:
	struct FPoseLink                              InAimOffsetsPose;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InSourcePosePreAimOffsets;                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_MovementMode_AimOffset;                      // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_FinalPoseOverride
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_MovementMode_FinalPoseOverride final 
{
public:
	struct FPoseLink                              InFinalPose;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_MovementMode_FinalPoseOverride;              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_FullBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_MovementMode_FullBodyOverride final 
{
public:
	struct FPoseLink                              InputPoseFullBody;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_MovementMode_FullBodyOverride;               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_LocomotionAdditives
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_MovementMode_LocomotionAdditives final 
{
public:
	struct FPoseLink                              InLocomotionAdditivesPose;                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_MovementMode_LocomotionAdditives;            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_LowerBodyOverride
// 0x0030 (0x0030 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_MovementMode_LowerBodyOverride final 
{
public:
	struct FPoseLink                              InLowerBodyPose;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InSourcePose;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_MovementMode_LowerBodyOverride;              // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Player_LocomotionAdditives_AnimBP.Player_LocomotionAdditives_AnimBP_C.MovementMode_SourcePose
// 0x0020 (0x0020 - 0x0000)
struct Player_LocomotionAdditives_AnimBP_C_MovementMode_SourcePose final 
{
public:
	struct FPoseLink                              InSourcePoseBase;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_MovementMode_SourcePose;                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

}

