#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmartObjectsModule

#include "Basic.hpp"

#include "SmartObjectsModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"
#include "StructUtils_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "WorldConditions_classes.hpp"


namespace SDK
{

// Class SmartObjectsModule.EnvQueryGenerator_SmartObjects
// 0x0100 (0x0150 - 0x0050)
class UEnvQueryGenerator_SmartObjects final  : public UEnvQueryGenerator
{
public:
	TSubclassOf<class UEnvQueryContext>           QueryOriginContext;                                // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2BFC[0x8];                                     // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectRequestFilter              SmartObjectRequestFilter;                          // 0x0060(0x00D0)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FVector                                QueryBoxExtent;                                    // 0x0130(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOnlyClaimable;                                    // 0x0148(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2BFD[0x7];                                     // 0x0149(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryGenerator_SmartObjects">();
	}
	static class UEnvQueryGenerator_SmartObjects* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_SmartObjects>();
	}
};

// Class SmartObjectsModule.EnvQueryItemType_SmartObject
// 0x0000 (0x0030 - 0x0030)
class UEnvQueryItemType_SmartObject final  : public UEnvQueryItemType_VectorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryItemType_SmartObject">();
	}
	static class UEnvQueryItemType_SmartObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryItemType_SmartObject>();
	}
};

// Class SmartObjectsModule.SmartObjectSettings
// 0x0018 (0x0048 - 0x0030)
class USmartObjectSettings final  : public UDeveloperSettings
{
public:
	ESmartObjectTagFilteringPolicy                DefaultUserTagsFilteringPolicy;                    // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESmartObjectTagMergingPolicy                  DefaultActivityTagsMergingPolicy;                  // 0x0031(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BFE[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USmartObjectWorldConditionSchema> DefaultWorldConditionSchemaClass;                  // 0x0038(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldExcludePreConditionsOnDedicatedClient;      // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BFF[0x7];                                     // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectSettings">();
	}
	static class USmartObjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectSettings>();
	}
};

// Class SmartObjectsModule.BlackboardKeyType_SOClaimHandle
// 0x0020 (0x0050 - 0x0030)
class UBlackboardKeyType_SOClaimHandle final  : public UBlackboardKeyType
{
public:
	struct FSmartObjectClaimHandle                Handle;                                            // 0x0030(0x0020)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlackboardKeyType_SOClaimHandle">();
	}
	static class UBlackboardKeyType_SOClaimHandle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlackboardKeyType_SOClaimHandle>();
	}
};

// Class SmartObjectsModule.GenericSmartObject
// 0x0008 (0x0298 - 0x0290)
class AGenericSmartObject final  : public AActor
{
public:
	class USmartObjectComponent*                  SOComponent;                                       // 0x0290(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GenericSmartObject">();
	}
	static class AGenericSmartObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGenericSmartObject>();
	}
};

// Class SmartObjectsModule.SmartObjectTest
// 0x0008 (0x0030 - 0x0028)
class USmartObjectTest : public UObject
{
public:
	class ASmartObjectTestingActor*               SmartObjectTestingActor;                           // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectTest">();
	}
	static class USmartObjectTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectTest>();
	}
};

// Class SmartObjectsModule.SmartObjectBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class USmartObjectBlueprintFunctionLibrary final  : public UBlueprintFunctionLibrary
{
public:
	static bool AddMultipleSmartObjects(TArray<class AActor*>& SmartObjectActors);
	static bool AddOrRemoveMultipleSmartObjects(TArray<class AActor*>& SmartObjectActors, bool bAdd);
	static bool AddOrRemoveSmartObject(class AActor* SmartObject, bool bEnabled);
	static bool AddSmartObject(class AActor* SmartObjectActor);
	static class FString Conv_SmartObjectClaimHandleToString(struct FSmartObjectClaimHandle& Result);
	static class FString Conv_SmartObjectDefinitionToString(class USmartObjectDefinition* Definition);
	static class FString Conv_SmartObjectHandleToString(struct FSmartObjectHandle& Handle);
	static class FString Conv_SmartObjectRequestResultToString(struct FSmartObjectRequestResult& Result);
	static class FString Conv_SmartObjectSlotHandleToString(struct FSmartObjectSlotHandle& Handle);
	static bool Equal_SmartObjectHandleSmartObjectHandle(struct FSmartObjectHandle& A, struct FSmartObjectHandle& B);
	static bool Equal_SmartObjectSlotHandleSmartObjectSlotHandle(struct FSmartObjectSlotHandle& A, struct FSmartObjectSlotHandle& B);
	static bool FindSmartObjectsInActor(struct FSmartObjectRequestFilter& Filter, class AActor* SearchActor, TArray<struct FSmartObjectRequestResult>* OutResults, class AActor* UserActor);
	static bool FindSmartObjectsInComponent(struct FSmartObjectRequestFilter& Filter, class USmartObjectComponent* SmartObjectComponent, TArray<struct FSmartObjectRequestResult>* OutResults, class AActor* UserActor);
	static bool FindSmartObjectsInList(class UObject* WorldContextObject, struct FSmartObjectRequestFilter& Filter, TArray<class AActor*>& ActorList, TArray<struct FSmartObjectRequestResult>* OutResults, class AActor* UserActor);
	static bool FindSmartObjectsInTargetingRequest(class UObject* WorldContextObject, struct FSmartObjectRequestFilter& Filter, struct FTargetingRequestHandle& TargetingHandle, TArray<struct FSmartObjectRequestResult>* OutResults, class AActor* UserActor);
	static struct FSmartObjectClaimHandle GetBlackboardValueAsSOClaimHandle(class UBTNode* NodeOwner, struct FBlackboardKeySelector& Key);
	static struct FSmartObjectClaimHandle GetValueAsSOClaimHandle(class UBlackboardComponent* BlackboardComponent, class FName& KeyName);
	static bool IsValidSmartObjectClaimHandle(struct FSmartObjectClaimHandle& Handle);
	static bool IsValidSmartObjectHandle(struct FSmartObjectHandle& Handle);
	static bool IsValidSmartObjectSlotHandle(struct FSmartObjectSlotHandle& Handle);
	static struct FSmartObjectClaimHandle MarkSmartObjectSlotAsClaimed(class UObject* WorldContextObject, struct FSmartObjectSlotHandle& SlotHandle, class AActor* UserActor, ESmartObjectClaimPriority ClaimPriority);
	static bool MarkSmartObjectSlotAsFree(class UObject* WorldContextObject, struct FSmartObjectClaimHandle& ClaimHandle);
	static const class USmartObjectBehaviorDefinition* MarkSmartObjectSlotAsOccupied(class UObject* WorldContextObject, struct FSmartObjectClaimHandle& ClaimHandle, TSubclassOf<class USmartObjectBehaviorDefinition> DefinitionClass);
	static bool NotEqual_SmartObjectHandleSmartObjectHandle(struct FSmartObjectHandle& A, struct FSmartObjectHandle& B);
	static bool NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle(struct FSmartObjectSlotHandle& A, struct FSmartObjectSlotHandle& B);
	static bool RemoveMultipleSmartObjects(TArray<class AActor*>& SmartObjectActors);
	static bool RemoveSmartObject(class AActor* SmartObjectActor);
	static void SetBlackboardValueAsSOClaimHandle(class UBTNode* NodeOwner, struct FBlackboardKeySelector& Key, struct FSmartObjectClaimHandle& Value);
	static bool SetMultipleSmartObjectsEnabled(TArray<class AActor*>& SmartObjectActors, bool bEnabled);
	static bool SetSmartObjectEnabled(class AActor* SmartObjectActor, bool bEnabled);
	static void SetValueAsSOClaimHandle(class UBlackboardComponent* BlackboardComponent, class FName& KeyName, const struct FSmartObjectClaimHandle& Value);
	static struct FSmartObjectClaimHandle SmartObjectClaimHandle_Invalid();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectBlueprintFunctionLibrary">();
	}
	static class USmartObjectBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectBlueprintFunctionLibrary>();
	}
};

// Class SmartObjectsModule.SmartObjectCollection
// 0x00B0 (0x0340 - 0x0290)
class ASmartObjectCollection final  : public AActor
{
public:
	struct FBox                                   Bounds;                                            // 0x0290(0x0038)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSmartObjectCollectionEntry>    CollectionEntries;                                 // 0x02C8(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TMap<struct FSmartObjectHandle, struct FSoftObjectPath> RegisteredIdToObjectMap;                           // 0x02D8(0x0050)(Protected, NativeAccessSpecifierProtected)
	TArray<class USmartObjectDefinition*>         Definitions;                                       // 0x0328(0x0010)(Edit, ZeroConstructor, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C1A[0x8];                                     // 0x0338(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectCollection">();
	}
	static class ASmartObjectCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASmartObjectCollection>();
	}
};

// Class SmartObjectsModule.SmartObjectSpacePartition
// 0x0000 (0x0028 - 0x0028)
class USmartObjectSpacePartition : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectSpacePartition">();
	}
	static class USmartObjectSpacePartition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectSpacePartition>();
	}
};

// Class SmartObjectsModule.SmartObjectOctree
// 0x00C8 (0x00F0 - 0x0028)
class USmartObjectOctree final  : public USmartObjectSpacePartition
{
public:
	uint8                                         Pad_2C1B[0xC8];                                    // 0x0028(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectOctree">();
	}
	static class USmartObjectOctree* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectOctree>();
	}
};

// Class SmartObjectsModule.SmartObjectComponent
// 0x0080 (0x02A0 - 0x0220)
class USmartObjectComponent : public USceneComponent
{
public:
	FMulticastInlineDelegateProperty_             OnSmartObjectEvent;                                // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C1C[0x18];                                    // 0x0230(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectDefinitionReference        DefinitionRef;                                     // 0x0248(0x0028)(Edit, Net, Protected, NativeAccessSpecifierProtected)
	struct FSmartObjectHandle                     RegisteredHandle;                                  // 0x0270(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C1D[0x10];                                    // 0x0278(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanBePartOfCollection;                            // 0x0288(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C1E[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectDefinition*                 CachedDefinitionAssetVariation;                    // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C1F[0x8];                                     // 0x0298(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveOnEvent(struct FSmartObjectEventData& EventData, class AActor* Interactor);
	void SetDefinition(class USmartObjectDefinition* DefinitionAsset);

	const class USmartObjectDefinition* GetDefinition() const;
	bool IsBoundToSimulation() const;
	bool IsSmartObjectEnabled() const;
	bool IsSmartObjectEnabledForReason(const struct FGameplayTag& ReasonTag) const;
	bool SetSmartObjectEnabled(bool bEnable) const;
	bool SetSmartObjectEnabledForReason(const struct FGameplayTag& ReasonTag, bool bEnabled) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectComponent">();
	}
	static class USmartObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectComponent>();
	}
};

// Class SmartObjectsModule.SmartObjectContainerRenderingComponent
// 0x0000 (0x0500 - 0x0500)
class USmartObjectContainerRenderingComponent final  : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectContainerRenderingComponent">();
	}
	static class USmartObjectContainerRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectContainerRenderingComponent>();
	}
};

// Class SmartObjectsModule.SmartObjectDebugRenderingComponent
// 0x0000 (0x0550 - 0x0550)
class USmartObjectDebugRenderingComponent : public UDebugDrawComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectDebugRenderingComponent">();
	}
	static class USmartObjectDebugRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectDebugRenderingComponent>();
	}
};

// Class SmartObjectsModule.SmartObjectBehaviorDefinition
// 0x0000 (0x0028 - 0x0028)
class USmartObjectBehaviorDefinition : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectBehaviorDefinition">();
	}
	static class USmartObjectBehaviorDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectBehaviorDefinition>();
	}
};

// Class SmartObjectsModule.SmartObjectSubsystemRenderingComponent
// 0x0000 (0x0550 - 0x0550)
class USmartObjectSubsystemRenderingComponent final  : public USmartObjectDebugRenderingComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectSubsystemRenderingComponent">();
	}
	static class USmartObjectSubsystemRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectSubsystemRenderingComponent>();
	}
};

// Class SmartObjectsModule.SmartObjectDefinition
// 0x0110 (0x0140 - 0x0030)
class USmartObjectDefinition final  : public UDataAsset
{
public:
	uint8                                         Pad_2C22[0x10];                                    // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedPropertyBag                  Parameters;                                        // 0x0040(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGuid                                  ParametersID;                                      // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  RootID;                                            // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FSmartObjectDefinitionPropertyBinding> PropertyBindings;                                  // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FSmartObjectSlotDefinition>     Slots;                                             // 0x0080(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class USmartObjectBehaviorDefinition*> DefaultBehaviorDefinitions;                        // 0x0090(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      UserTagFilter;                                     // 0x00A0(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FWorldConditionQueryDefinition         Preconditions;                                     // 0x00E8(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  ActivityTags;                                      // 0x0100(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FSmartObjectDefinitionDataProxy> DefinitionData;                                    // 0x0120(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class USmartObjectWorldConditionSchema> WorldConditionSchemaClass;                         // 0x0130(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESmartObjectTagMergingPolicy                  ActivityTagsMergingPolicy;                         // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESmartObjectTagFilteringPolicy                UserTagsFilteringPolicy;                           // 0x0139(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C23[0x6];                                     // 0x013A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FSmartObjectSlotDefinition GetMutableSlot(int32 Param_Index);
	void SetUserTagFilter(struct FGameplayTagQuery& InUserTagFilter);

	const struct FGameplayTagContainer GetActivityTags() const;
	struct FBox GetBounds() const;
	void GetSlotActivityTags(int32 SlotIndex, struct FGameplayTagContainer* OutActivityTags) const;
	struct FTransform GetSlotWorldTransform(int32 SlotIndex, struct FTransform& OwnerTransform) const;
	const struct FGameplayTagQuery GetUserTagFilter() const;
	ESmartObjectTagFilteringPolicy GetUserTagsFilteringPolicy() const;
	bool IsValidSlotIndex(int32 SlotIndex) const;
	const TArray<struct FSmartObjectSlotDefinition> K2_GetSlots() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectDefinition">();
	}
	static class USmartObjectDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectDefinition>();
	}
};

// Class SmartObjectsModule.SmartObjectHashGrid
// 0x00A8 (0x00D0 - 0x0028)
class USmartObjectHashGrid final  : public USmartObjectSpacePartition
{
public:
	uint8                                         Pad_2C28[0xA8];                                    // 0x0028(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectHashGrid">();
	}
	static class USmartObjectHashGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectHashGrid>();
	}
};

// Class SmartObjectsModule.SmartObjectPersistentCollection
// 0x00B8 (0x0348 - 0x0290)
class ASmartObjectPersistentCollection final  : public AActor
{
public:
	struct FSmartObjectContainer                  SmartObjectContainer;                              // 0x0290(0x00B0)(Edit, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C29[0x8];                                     // 0x0340(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectPersistentCollection">();
	}
	static class ASmartObjectPersistentCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASmartObjectPersistentCollection>();
	}
};

// Class SmartObjectsModule.SmartObjectRenderingComponent
// 0x0000 (0x0500 - 0x0500)
class USmartObjectRenderingComponent final  : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectRenderingComponent">();
	}
	static class USmartObjectRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectRenderingComponent>();
	}
};

// Class SmartObjectsModule.SmartObjectSubsystem
// 0x0168 (0x0198 - 0x0030)
class USmartObjectSubsystem final  : public UWorldSubsystem
{
public:
	struct FSoftClassPath                         SpacePartitionClassName;                           // 0x0030(0x0018)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USmartObjectSpacePartition> SpacePartitionClass;                               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USmartObjectSpacePartition*             SpacePartition;                                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASmartObjectSubsystemRenderingActor*    RenderingActor;                                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSmartObjectContainer                  SmartObjectContainer;                              // 0x0060(0x00B0)(Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C2A[0x10];                                    // 0x0110(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSmartObjectHandle, struct FSmartObjectRuntime> RuntimeSmartObjects;                               // 0x0120(0x0050)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class USmartObjectComponent*>          RegisteredSOComponents;                            // 0x0170(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class USmartObjectComponent*>          PendingSmartObjectRegistration;                    // 0x0180(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C2B[0x8];                                     // 0x0190(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddTagToInstance(struct FSmartObjectHandle& Handle, struct FGameplayTag& Tag);
	void AddTagToSlot(struct FSmartObjectSlotHandle& SlotHandle, struct FGameplayTag& Tag);
	const class USmartObjectBehaviorDefinition* GetBehaviorDefinition(struct FSmartObjectClaimHandle& ClaimHandle, TSubclassOf<class USmartObjectBehaviorDefinition> DefinitionClass);
	const class USmartObjectBehaviorDefinition* GetBehaviorDefinitionByRequestResult(struct FSmartObjectRequestResult& RequestResult, TSubclassOf<class USmartObjectBehaviorDefinition> DefinitionClass);
	bool Release(struct FSmartObjectClaimHandle& ClaimHandle);
	void RemoveTagFromInstance(struct FSmartObjectHandle& Handle, struct FGameplayTag& Tag);
	bool RemoveTagFromSlot(struct FSmartObjectSlotHandle& SlotHandle, struct FGameplayTag& Tag);
	bool SetEnabled(struct FSmartObjectHandle& Handle, bool bEnabled);
	bool SetEnabledForReason(struct FSmartObjectHandle& Handle, const struct FGameplayTag& ReasonTag, bool bEnabled);
	bool SetSlotEnabled(struct FSmartObjectSlotHandle& SlotHandle, bool bEnabled);

	struct FSmartObjectRequestResult FindSmartObject(struct FSmartObjectRequest& Request, class AActor* UserActor) const;
	bool FindSmartObjects(struct FSmartObjectRequest& Request, TArray<struct FSmartObjectRequestResult>* OutResults, class AActor* UserActor) const;
	bool FindSmartObjects_BP(struct FSmartObjectRequest& Request, TArray<struct FSmartObjectRequestResult>* OutResults, class AActor* UserActor) const;
	void GetAllSlots(struct FSmartObjectHandle& Handle, TArray<struct FSmartObjectSlotHandle>* OutSlots) const;
	const struct FGameplayTagContainer GetInstanceTags(struct FSmartObjectHandle& Handle) const;
	bool GetSlotLocation(struct FSmartObjectClaimHandle& ClaimHandle, struct FVector* OutSlotLocation) const;
	ESmartObjectSlotState GetSlotState(struct FSmartObjectSlotHandle& SlotHandle) const;
	const struct FGameplayTagContainer GetSlotTags(struct FSmartObjectSlotHandle& SlotHandle) const;
	bool GetSlotTransform(struct FSmartObjectClaimHandle& ClaimHandle, struct FTransform* OutSlotTransform) const;
	bool GetSlotTransformFromRequestResult(struct FSmartObjectRequestResult& RequestResult, struct FTransform* OutSlotTransform) const;
	class USmartObjectComponent* GetSmartObjectComponent(struct FSmartObjectClaimHandle& ClaimHandle, ETrySpawnActorIfDehydrated TrySpawnActorIfDehydrated) const;
	class USmartObjectComponent* GetSmartObjectComponentByRequestResult(struct FSmartObjectRequestResult& Result, ETrySpawnActorIfDehydrated TrySpawnActorIfDehydrated) const;
	bool IsEnabled(struct FSmartObjectHandle& Handle) const;
	bool IsEnabledForReason(struct FSmartObjectHandle& Handle, const struct FGameplayTag& ReasonTag) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectSubsystem">();
	}
	static class USmartObjectSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectSubsystem>();
	}
};

// Class SmartObjectsModule.SmartObjectSubsystemRenderingActor
// 0x0008 (0x0298 - 0x0290)
class ASmartObjectSubsystemRenderingActor final  : public AActor
{
public:
	class USmartObjectSubsystemRenderingComponent* RenderingComponent;                                // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectSubsystemRenderingActor">();
	}
	static class ASmartObjectSubsystemRenderingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASmartObjectSubsystemRenderingActor>();
	}
};

// Class SmartObjectsModule.SmartObjectSimpleQueryTest
// 0x0120 (0x0150 - 0x0030)
class USmartObjectSimpleQueryTest final  : public USmartObjectTest
{
public:
	struct FSmartObjectRequest                    Request;                                           // 0x0030(0x0110)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSmartObjectRequestResult>      Results;                                           // 0x0140(0x0010)(Edit, ZeroConstructor, Transient, EditConst, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectSimpleQueryTest">();
	}
	static class USmartObjectSimpleQueryTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectSimpleQueryTest>();
	}
};

// Class SmartObjectsModule.SmartObjectTestRenderingComponent
// 0x0000 (0x0550 - 0x0550)
class USmartObjectTestRenderingComponent final  : public USmartObjectDebugRenderingComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectTestRenderingComponent">();
	}
	static class USmartObjectTestRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectTestRenderingComponent>();
	}
};

// Class SmartObjectsModule.SmartObjectTestingActor
// 0x0028 (0x02B8 - 0x0290)
class ASmartObjectTestingActor final  : public AActor
{
public:
	TArray<class USmartObjectTest*>               Tests;                                             // 0x0290(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class USmartObjectTestRenderingComponent*     RenderingComponent;                                // 0x02A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USmartObjectSubsystem*                  SmartObjectSubsystem;                              // 0x02A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRunTestsEachFrame;                                // 0x02B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C3F[0x7];                                     // 0x02B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ResetTests();
	void RunTests();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectTestingActor">();
	}
	static class ASmartObjectTestingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASmartObjectTestingActor>();
	}
};

// Class SmartObjectsModule.SmartObjectSlotValidationFilter
// 0x00E8 (0x0110 - 0x0028)
class USmartObjectSlotValidationFilter final  : public UObject
{
public:
	struct FSmartObjectSlotValidationParams       EntryParameters;                                   // 0x0028(0x0070)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseEntryParametersForExit;                        // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C40[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectSlotValidationParams       ExitParameters;                                    // 0x00A0(0x0070)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectSlotValidationFilter">();
	}
	static class USmartObjectSlotValidationFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectSlotValidationFilter>();
	}
};

// Class SmartObjectsModule.SmartObjectUserComponent
// 0x0008 (0x00A8 - 0x00A0)
class USmartObjectUserComponent : public UActorComponent
{
public:
	TSubclassOf<class USmartObjectSlotValidationFilter> ValidationFilter;                                  // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectUserComponent">();
	}
	static class USmartObjectUserComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectUserComponent>();
	}
};

// Class SmartObjectsModule.SmartObjectWorldConditionSchema
// 0x0028 (0x0060 - 0x0038)
class USmartObjectWorldConditionSchema final  : public UWorldConditionSchema
{
public:
	uint8                                         Pad_2C41[0x28];                                    // 0x0038(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectWorldConditionSchema">();
	}
	static class USmartObjectWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectWorldConditionSchema>();
	}
};

}

