#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpaceFeline_Axe_AnimBP

#include "Basic.hpp"

#include "RBANParamsStruct_structs.hpp"
#include "Engine_structs.hpp"
#include "GravityOverrideSettingStruct_structs.hpp"
#include "RBANSettingStruct_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SpaceFeline_Axe_AnimBP.SpaceFeline_Axe_AnimBP_C.ExecuteUbergraph_SpaceFeline_Axe_AnimBP
// 0x0C78 (0x0C78 - 0x0000)
struct SpaceFeline_Axe_AnimBP_C_ExecuteUbergraph_SpaceFeline_Axe_AnimBP final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C077[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBANParamsStruct                      Temp_struct_Variable;                              // 0x0008(0x0B40)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0B48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C078[0x4];                                     // 0x0B4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0B50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Gravity_Override_State_Function_GravityOverride; // 0x0B58(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Gravity_Override_State_Function_CurrentStateOut; // 0x0B70(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut; // 0x0B80(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBANSettingStruct                     CallFunc_Gravity_Override_State_Function_RBAN_SettingsOut; // 0x0BE8(0x0090)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SpaceFeline_Axe_AnimBP.SpaceFeline_Axe_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct SpaceFeline_Axe_AnimBP_C_BlueprintUpdateAnimation final 
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function SpaceFeline_Axe_AnimBP.SpaceFeline_Axe_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SpaceFeline_Axe_AnimBP_C_AnimGraph final 
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

}

