#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCommonRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SparksCommonRuntime_structs.hpp"


namespace SDK
{

// Class SparksCommonRuntime.SparksCommonUtilities
// 0x0008 (0x00A8 - 0x00A0)
class USparksCommonUtilities final  : public UGameStateComponent
{
public:
	bool                                          bSparksToolIsVisible;                              // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8EE1[0x7];                                     // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USparksCommonUtilities* GetSparksCommonUtilities(class UObject* WorldContextObject);

	void ShowSparksCaptureTool(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksCommonUtilities">();
	}
	static class USparksCommonUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksCommonUtilities>();
	}
};

// Class SparksCommonRuntime.SparksCrowdSpawner
// 0x0110 (0x0330 - 0x0220)
class USparksCrowdSpawner final  : public USceneComponent
{
public:
	TMap<class UInstancedStaticMeshComponent*, int32> MeshWeights;                                       // 0x0220(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	int32                                         TotalMeshWeight;                                   // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8EE2[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Area;                                              // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FIntPoint                              CrowdSize;                                         // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              PositionRandomness;                                // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                LookAt;                                            // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LookAtRandomness;                                  // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8EE3[0x4];                                     // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               AdditionalRotation;                                // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector2D                              ScaleVariance;                                     // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         BatchSize;                                         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8EE4[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCrowdMemberToSpawn>            CrowdMembersToSpawn;                               // 0x02F8(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UCurveFloat*                            ParamTransitionCurve;                              // 0x0308(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           TransitionTickTimerHandle;                         // 0x0310(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CurrentTransitionParamIndex;                       // 0x0318(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ParamValueAtStartOfTransition;                     // 0x031C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentParamValue;                                 // 0x0320(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentTransitionTarget;                           // 0x0324(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentTransitionDuration;                         // 0x0328(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimeElapsedInCurrentTransition;                    // 0x032C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	bool SpawnCrowd(const struct FVector& InArea, const struct FIntPoint& InCrowdSize, const struct FVector2D& InPositionRandomness, const struct FVector2D& InScaleVariance, const struct FVector& InLookAt, float InLookAtRandomeness, const struct FRotator& InAdditionalRotation, int32 InBatchSize, TMap<class UInstancedStaticMeshComponent*, int32>& InMeshWeights);
	bool SpawnCrowdNow(const struct FVector& InArea, const struct FIntPoint& InCrowdSize, const struct FVector2D& InPositionRandomness, const struct FVector2D& InScaleVariance, const struct FVector& InLookAt, float InLookAtRandomeness, const struct FRotator& InAdditionalRotation, TMap<class UInstancedStaticMeshComponent*, int32>& InMeshWeights);
	void TransitionCrowdToTargetParamValue(int32 DataIndex, float TargetValue, float TimeToTransition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksCrowdSpawner">();
	}
	static class USparksCrowdSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksCrowdSpawner>();
	}
};

// Class SparksCommonRuntime.SparksMapDataLayerController
// 0x0000 (0x0290 - 0x0290)
class ASparksMapDataLayerController final  : public AActor
{
public:
	void OnSparksActivationChange(const class FString& ActivationString);

	class FString GetCurrentSparksActivation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksMapDataLayerController">();
	}
	static class ASparksMapDataLayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASparksMapDataLayerController>();
	}
};

}

