#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksMidiParser

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "SparksMidiParser_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SparksCoreRuntime_structs.hpp"


namespace SDK
{

// Class SparksMidiParser.AsyncAction_ListenForMidiEventBase
// 0x0030 (0x0060 - 0x0030)
class UAsyncAction_ListenForMidiEventBase : public UCancellableAsyncAction
{
public:
	FMulticastInlineDelegateProperty_             OnFinished;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AAB[0x20];                                    // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFinished__DelegateSignature(bool bCanceled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_ListenForMidiEventBase">();
	}
	static class UAsyncAction_ListenForMidiEventBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ListenForMidiEventBase>();
	}
};

// Class SparksMidiParser.AsyncAction_ListenForMidiNoteEvent
// 0x0040 (0x00A0 - 0x0060)
class UAsyncAction_ListenForMidiNoteEvent final  : public UAsyncAction_ListenForMidiEventBase
{
public:
	FMulticastInlineDelegateProperty_             OnMidiEventStart;                                  // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnMidiEventEnd;                                    // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AAC[0x20];                                    // 0x0080(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_ListenForMidiNoteEvent* ListenForMidiNoteEvent(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver, class FName MidiTrackName, uint8 EventNote, float SecondsBeforeEventStart, float SecondsBeforeEventEnd, EMidiEventListenerInitBroadcast InitBroadcast);
	static class UAsyncAction_ListenForMidiNoteEvent* ListenForMidiNoteEvents(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver, class FName MidiTrackName, TArray<uint8>& EventNotes, float SecondsBeforeEventStart, float SecondsBeforeEventEnd, EMidiEventListenerInitBroadcast InitBroadcast);
	static class UAsyncAction_ListenForMidiNoteEvent* ListenForMidiNoteEvents_WithParams(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver, struct FMidiNoteEventListenerParams& Params_0);

	void OnMidiNoteEventDelegate__DelegateSignature(uint8 MidiEventNote, struct FParsedMidiNoteEvent& MidiEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_ListenForMidiNoteEvent">();
	}
	static class UAsyncAction_ListenForMidiNoteEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ListenForMidiNoteEvent>();
	}
};

// Class SparksMidiParser.AsyncAction_ListenForMidiTextEvent
// 0x0030 (0x0090 - 0x0060)
class UAsyncAction_ListenForMidiTextEvent final  : public UAsyncAction_ListenForMidiEventBase
{
public:
	FMulticastInlineDelegateProperty_             OnMidiEventStart;                                  // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AB2[0x20];                                    // 0x0070(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_ListenForMidiTextEvent* ListenForMidiTextEvent(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver, class FName MidiTrackName, const class FString& EventString, float SecondsBeforeEventStart, EMidiEventListenerInitBroadcast InitBroadcast);
	static class UAsyncAction_ListenForMidiTextEvent* ListenForMidiTextEvents(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver, class FName MidiTrackName, TArray<class FString>& EventStrings, float SecondsBeforeEventStart, EMidiEventListenerInitBroadcast InitBroadcast);
	static class UAsyncAction_ListenForMidiTextEvent* ListenForMidiTextEvents_WithParams(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver, struct FMidiTextEventListenerParams& Params_0);

	void OnMidiTextEventDelegate__DelegateSignature(const class FString& MidiEventText, struct FParsedMidiTextEvent& MidiEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_ListenForMidiTextEvent">();
	}
	static class UAsyncAction_ListenForMidiTextEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ListenForMidiTextEvent>();
	}
};

// Class SparksMidiParser.AsyncAction_ListenForMidiNoteEventPools
// 0x0048 (0x00A8 - 0x0060)
class UAsyncAction_ListenForMidiNoteEventPools final  : public UAsyncAction_ListenForMidiEventBase
{
public:
	FMulticastInlineDelegateProperty_             OnMidiNoteStart;                                   // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AB7[0x38];                                    // 0x0070(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_ListenForMidiNoteEventPools* ListenForMidiNoteEventPools(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver, class FName MidiTrackName, uint8 EventNote, TArray<uint8>& WatchNotes, TArray<struct FMidiNoteEvent_DelayPool>& DelayPools, EMidiEventListenerInitBroadcast InitBroadcast);
	static class UAsyncAction_ListenForMidiNoteEventPools* ListenForMidiNoteEventsPools(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver, class FName MidiTrackName, TArray<uint8>& EventNotes, TArray<uint8>& WatchNotes, TArray<struct FMidiNoteEvent_DelayPool>& DelayPools, EMidiEventListenerInitBroadcast InitBroadcast);
	static class UAsyncAction_ListenForMidiNoteEventPools* ListenForMidiNoteEventsPools_WithParams(TScriptInterface<class IMidiEventDriverInterface> MidiEventDriver, struct FMidiNotePoolEventListenerParams& Params_0);

	void OnMidiNotePoolEventDelegate__DelegateSignature(uint8 MidiNote, struct FParsedMidiNoteEvent& MidiNoteData, class FName WaitPoolID, float ActualDelay, float MaxDelayShortenedBy);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_ListenForMidiNoteEventPools">();
	}
	static class UAsyncAction_ListenForMidiNoteEventPools* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ListenForMidiNoteEventPools>();
	}
};

// Class SparksMidiParser.MidiEventDriverInterface
// 0x0000 (0x0028 - 0x0028)
class IMidiEventDriverInterface final  : public IInterface
{
public:
	float GetCurrentMidiSeconds() const;
	int32 GetCurrentMidiTick() const;
	struct FMidiPlaybackState GetMidiPlaybackState() const;
	class FName GetMidiTrackNameFromSparksInstrument(ESparksInstrumentType InstrumentType) const;
	class UParsedMidiEventData* GetParsedMidiEventData() const;
	ESparksInstrumentType GetSparksInstrumentFromMidiTrackName(class FName TrackName) const;
	bool IsPlaybackEnded() const;
	int32 SecondsToTick(float Seconds) const;
	float TickToSeconds(int32 Tick) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidiEventDriverInterface">();
	}
	static class IMidiEventDriverInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMidiEventDriverInterface>();
	}
};

// Class SparksMidiParser.MidiEventListenerSubsystem
// 0x0018 (0x0058 - 0x0040)
class UMidiEventListenerSubsystem final  : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_2ABF[0x18];                                    // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelAllListenersForDriver(TScriptInterface<class IMidiEventDriverInterface>& Driver);
	void CancelListener(struct FMidiEventListenerHandle& Handle);
	bool IsListenerActive(struct FMidiEventListenerHandle& Handle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MidiEventListenerSubsystem">();
	}
	static class UMidiEventListenerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidiEventListenerSubsystem>();
	}
};

// Class SparksMidiParser.ParsedMidiEventData
// 0x00A8 (0x00D0 - 0x0028)
class UParsedMidiEventData : public UObject
{
public:
	TMap<class FName, struct FMidiNoteEventList>  MidiNoteEvents;                                    // 0x0028(0x0050)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FMidiTextEventList>  MidiTextEvents;                                    // 0x0078(0x0050)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	class UMidiFile*                              MidiFilePtr;                                       // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	const TMap<class FName, struct FMidiNoteEventList> GetAllMidiNoteEvents() const;
	const TMap<class FName, struct FMidiTextEventList> GetAllMidiTextEvents() const;
	const class UMidiFile* GetMidiFile() const;
	const TArray<struct FParsedMidiNoteEvent> GetMidiNoteEvents(class FName TrackName) const;
	void GetMidiNoteEventsWithInts(class FName TrackName, TArray<uint8>& MidiEventInts, TArray<struct FParsedMidiNoteEvent>* OutArray) const;
	const TArray<struct FParsedMidiTextEvent> GetMidiTextEvents(class FName TrackName) const;
	void GetMidiTextEventsWithStrings(class FName TrackName, TArray<class FString>& MidiEventStrings, TArray<struct FParsedMidiTextEvent>* OutArray) const;
	void GetPreviousMidiNoteEventsWithInts(class FName TrackName, TArray<uint8>& MidiEventInts, int32 UpToMidiTick, TArray<struct FMidiNoteEventList>* OutResults) const;
	void GetPreviousMidiTextEventsWithStrings(class FName TrackName, TArray<class FString>& MidiEventStrings, int32 UpToMidiTick, TArray<struct FMidiTextEventList>* OutResults) const;
	bool GetRecentOrFirstMidiNoteEvent(class FName TrackName, TArray<uint8>& MidiEventInts, int32 UpToMidiTick, struct FParsedMidiNoteEvent* OutResult) const;
	bool GetRecentOrFirstMidiTextEvent(class FName TrackName, TArray<class FString>& MidiEventStrings, int32 UpToMidiTick, struct FParsedMidiTextEvent* OutResult) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ParsedMidiEventData">();
	}
	static class UParsedMidiEventData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParsedMidiEventData>();
	}
};

}

