#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Speed_CameraShakeLocationPerlin_Sliding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayCameras_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Speed_CameraShakeLocationPerlin_Sliding.Speed_CameraShakeLocationPerlin_Sliding_C
// 0x0030 (0x0220 - 0x01F0)
class USpeed_CameraShakeLocationPerlin_Sliding_C final  : public ULegacyCameraShake
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        OscillatorAmplitudeX;                              // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OscillatorAmplitudeY;                              // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OscillatorAmplitudeZ;                              // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinShakeScalar;                                    // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintUpdateCameraShake(float DeltaTime, float Alpha, struct FMinimalViewInfo& POV, struct FMinimalViewInfo* ModifiedPOV, double FOVScale, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, class AFortPlayerController* CallFunc_GetFirstLocalFortPlayerController_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, float CallFunc_GetFOVAngle_ReturnValue, double CallFunc_MapRangeClamped_ReturnValue, const struct FFOscillator& K2Node_MakeStruct_FOscillator, const struct FFOscillator& K2Node_MakeStruct_FOscillator_1, const struct FFOscillator& K2Node_MakeStruct_FOscillator_2, const struct FVOscillator& K2Node_MakeStruct_VOscillator, float K2Node_MakeStruct_Amplitude_ImplicitCast, float K2Node_MakeStruct_Amplitude_ImplicitCast_1, float K2Node_MakeStruct_Amplitude_ImplicitCast_2, double CallFunc_MapRangeClamped_InRangeB_ImplicitCast, double CallFunc_MapRangeClamped_Value_ImplicitCast);
	void ExecuteUbergraph_Speed_CameraShakeLocationPerlin_Sliding(int32 EntryPoint, float CallFunc_GetNumericCVar_OutValue, bool CallFunc_GetNumericCVar_ReturnValue, double CallFunc_FMin_ReturnValue, float K2Node_Event_Scale, double CallFunc_FMin_A_ImplicitCast, double K2Node_VariableSet_OscillatorAmplitudeZ_ImplicitCast, double K2Node_VariableSet_OscillatorAmplitudeY_ImplicitCast, double K2Node_VariableSet_OscillatorAmplitudeX_ImplicitCast);
	void ReceivePlayShake(float Scale);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Speed_CameraShakeLocationPerlin_Sliding_C">();
	}
	static class USpeed_CameraShakeLocationPerlin_Sliding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpeed_CameraShakeLocationPerlin_Sliding_C>();
	}
};

}

