#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplashScreenWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SplashScreenWidget.SplashScreenWidget_C
// 0x0048 (0x0598 - 0x0550)
class USplashScreenWidget_C final  : public UFortSplashScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UIKit_Button_Loud_C*               Button_PressToStart;                               // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       I_Fortnite;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   GamepadText;                                       // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MouseText;                                         // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MobileText;                                        // 0x0588(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnInputMethodChanged(ECommonInputType InputType);
	void OnInitialized();
	void ExecuteUbergraph_SplashScreenWidget(int32 EntryPoint, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ECommonInputType K2Node_Event_InputType, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue, bool Temp_bool_Variable_1, bool CallFunc_IsMobileApp_ReturnValue, class UMusicEventSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, class UAudioComponent* CallFunc_AddEvent_ReturnValue, bool CallFunc_ShouldHideLogo_ReturnValue, bool CallFunc_IsTouchInputPlatform_ReturnValue, ESlateVisibility K2Node_Select_Default, bool CallFunc_BooleanOR_ReturnValue, class FText K2Node_Select_Default_1);
	void BP_OnActivated();
	void BndEvt__SplashScreenWidget_Button_PressToStart_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SplashScreenWidget_C">();
	}
	static class USplashScreenWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplashScreenWidget_C>();
	}
};

}

