#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SunRoseZeusGameplayRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class SunRoseZeusGameplayRuntime.SunRose_Zeus_Player_LayerAnimInstance
// 0x0000 (0x1390 - 0x1390)
class USunRose_Zeus_Player_LayerAnimInstance final  : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsThrowActive;                                    // 0x1388(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_87AC[0x3];                                     // 0x1389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           LightningAbilityActiveTag;                         // 0x138C(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SunRose_Zeus_Player_LayerAnimInstance">();
	}
	static class USunRose_Zeus_Player_LayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USunRose_Zeus_Player_LayerAnimInstance>();
	}
};

// Class SunRoseZeusGameplayRuntime.SunRose_Zeus_Weapon_Hand_AnimInstance
// 0x0010 (0x0480 - 0x0470)
class USunRose_Zeus_Weapon_Hand_AnimInstance final  : public UFortWeaponAnimInstance
{
public:
	bool                                          bIsThrow;                                          // 0x0468(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_87AD[0x7];                                     // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LightningThrowMontageName;                         // 0x0470(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SunRose_Zeus_Weapon_Hand_AnimInstance">();
	}
	static class USunRose_Zeus_Weapon_Hand_AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USunRose_Zeus_Weapon_Hand_AnimInstance>();
	}
};

// Class SunRoseZeusGameplayRuntime.BuildingGameplayActorZeusThunderstorm
// 0x0070 (0x09F0 - 0x0980)
class alignas(0x10) ABuildingGameplayActorZeusThunderstorm final  : public ABuildingGameplayActor
{
public:
	struct FScalableFloat                         Row_TelegraphDuration;                             // 0x0980(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         Row_LightningStrikeFXDelay;                        // 0x09A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_87AE[0x20];                                    // 0x09D0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetStrikeTargetingLocation(struct FTargetingRequestHandle& TargetingHandle);
	void K2_OnLightningStrike(struct FVector& Location);
	void K2_OnLightningStrikeFX(struct FVector& Location, float BoltHeight);
	void K2_OnTelegraphEnd();
	void K2_OnTelegraphStart(struct FVector& Location);
	void OnTelegraphEnd();
	void OnTelegraphStart(struct FVector& Location);
	void SetStrikeTargetingLocation(struct FTargetingRequestHandle& TargetingHandle, struct FVector& Location);
	void StartLightningFX();
	void StartLightningStrike(struct FVector& Location, float BoltHeight);
	void StrikeLightning(struct FVector& Location);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuildingGameplayActorZeusThunderstorm">();
	}
	static class ABuildingGameplayActorZeusThunderstorm* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuildingGameplayActorZeusThunderstorm>();
	}
};

// Class SunRoseZeusGameplayRuntime.FortProjectileSunRoseLightning
// 0x0310 (0x0DC8 - 0x0AB8)
class AFortProjectileSunRoseLightning final  : public AFortProjectileBase
{
public:
	TArray<TSubclassOf<class UGameplayEffect>>    ExplosionDamageGEs;                                // 0x0AB8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	float                                         ExplosionGELevel;                                  // 0x0AC8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionChannel                             ExplosionTraceChannel;                             // 0x0ACC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_87B3[0x3];                                     // 0x0ACD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxHitsPerFrame;                                   // 0x0AD0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_87B4[0x2C8];                                   // 0x0AF8(0x02C8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetingRequestHandle                ExplosionAsyncLOSTargetingHandle;                  // 0x0DC0(0x0004)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_87B5[0x4];                                     // 0x0DC4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DoExplosionAsyncLOS();
	void OnExplosionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortProjectileSunRoseLightning">();
	}
	static class AFortProjectileSunRoseLightning* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortProjectileSunRoseLightning>();
	}
};

}

