#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TacticalSprintRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "TacticalSprintRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class TacticalSprintRuntime.FortMovementMode_ELTacSprint
// 0x02D0 (0x03F0 - 0x0120)
class UFortMovementMode_ELTacSprint : public UFortMovementMode_BaseExtLogic
{
public:
	uint8                                         Pad_8737[0x8];                                     // 0x0120(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TacticalSprintFail;                                // 0x0128(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TacticalSprintFailLowEnergy;                       // 0x0148(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinEnergyToActivate;                               // 0x0168(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinEnergyToActivateCreative;                       // 0x0190(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GCEnergyDrain;                                     // 0x01B8(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           GCSpeedLines;                                      // 0x01BC(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           GCCameraShake;                                     // 0x01C0(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           GCSprintEnd;                                       // 0x01C4(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxSpeedMultiplier;                                // 0x01C8(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AccelerationMultiplier;                            // 0x01F0(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RampUpSpeed;                                       // 0x0218(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RampDownSpeed;                                     // 0x0240(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         JumpHeightMultiplier;                              // 0x0268(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_8738[0x4];                                     // 0x0290(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TutorialGameplayTag;                               // 0x0294(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TutorialAdditionalSourceTag;                       // 0x0298(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TutorialTargetTag;                                 // 0x02B8(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class USoundBase*                             OnEnergyFullyDrainedSound;                         // 0x02D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TacticalBehaviorTag;                               // 0x02E0(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsCancelledBySliding : 1;                         // 0x02E4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShouldHolsterWeapon : 1;                          // 0x02E4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_8739[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TagPreventWeaponHolster;                           // 0x02E8(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinSpeedForHolster;                                // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HolsterTimeAttemptDelay;                           // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         MaxTryHolsterAttempt;                              // 0x02F4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_873A[0x13];                                    // 0x02F5(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortComponent_Energy>      EnergyComponentClass;                              // 0x0308(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HF_EnergyCostOnStart;                              // 0x0310(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HF_EnergyCostPerSecond;                            // 0x0338(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HF_EnergyCostOnJump;                               // 0x0360(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           IgnoreJumpCostTag;                                 // 0x0388(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TacticalSprintTag;                                 // 0x038C(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           EnergyUseIdentifier;                               // 0x0390(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_873B[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              SprintStartedSoundMix;                             // 0x0398(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             SprintStartedSound2D;                              // 0x03A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_873C[0x8];                                     // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         HF_TacSprintEnabled;                               // 0x03B0(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_873D[0x8];                                     // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCameraMode>            CameraMode;                                        // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CameraModeTag;                                     // 0x03E8(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_873E[0x4];                                     // 0x03EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleFailedToSprint();
	void HandleMovementModeChanged(class ACharacter* Character, EMovementMode PreviousMovementMode, uint8 PreviousCustomMode);
	void HandleOnEnergyDrained(class UFortComponent_Energy* EnergyComp);
	void HandleOnEnterAircraft();
	void HandleOnEnteredEditMode();
	void HandleOnPawnJump();
	void HandleOnPlayerWeaponChanged(class AFortPawn* InPawn, class AFortWeapon* InNewWeapon, class AFortWeapon* InPlayerWeapon);
	void HandleOnReloadCanceling();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ELTacSprint">();
	}
	static class UFortMovementMode_ELTacSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ELTacSprint>();
	}
};

// Class TacticalSprintRuntime.FortPlayerControllerComponent_TacticalSprint
// 0x0158 (0x01F8 - 0x00A0)
class UFortPlayerControllerComponent_TacticalSprint final  : public UControllerComponent
{
public:
	uint8                                         Pad_8740[0x18];                                    // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnFailedToSprint;                                  // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMovementMode_BaseExtLogic> MovementModeExtension;                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerPawn*                        CurrentBoundPlayerPawn;                            // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bTacticalSprintEnabled : 1;                        // 0x00D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bWantsToTacticalSprint : 1;                        // 0x00D8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bHandlingMoveForward : 1;                          // 0x00D8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsSprinting : 1;                                  // 0x00D8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bWasInBuildMode : 1;                               // 0x00D8(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bFireAnalyticsEventOnEndPlay : 1;                  // 0x00D8(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_8741[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TacticalSprintAbilityGameplayTag;                  // 0x00DC(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           DisableTacticalSprintAbilityGameplayTag;           // 0x00E0(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8742[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         TacticalSprintEnabled;                             // 0x00E8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TacticalSprintToggleGracePeriod;                   // 0x0110(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             OnTacticalSprintStarted;                           // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             OnTacticalSprintEnded;                             // 0x0148(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	bool                                          bUseMovementModeExtension;                         // 0x0158(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8743[0xF];                                     // 0x0159(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           StopWantingToSprintTimerReceipt;                   // 0x0168(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8744[0x68];                                    // 0x0170(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        InputComponent;                                    // 0x01D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8745[0x18];                                    // 0x01E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddCustomSprintMMEClass(TSubclassOf<class UFortMovementMode_ELTacSprint>& SprintMMEClassToAdd);
	void LogAndVisualLog(class UObject* LoggingSource, ESprintLoggingVerbosityLevel Verbosity, class FString& LogString);
	void OnAutoRunChanged(bool bAutoRunIsOn);
	void OnMovementModeChanged(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnMutatorUpdated();
	void OnPawnChanged(class AFortPawn* InPawn);
	void OnPlayerStatePawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void OnWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PreviousWeapon);
	void RegisterMutatorUpdatedDelegate();
	void RemoveCustomSprintMMEClass(TSubclassOf<class UFortMovementMode_ELTacSprint>& SprintMMEClassToRemove);
	void SetIsSprinting(bool bNewIsSprinting);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerControllerComponent_TacticalSprint">();
	}
	static class UFortPlayerControllerComponent_TacticalSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerControllerComponent_TacticalSprint>();
	}
};

}

