#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TankUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Class TankUI.FortGameSettingRegistryExtension_Tank
// 0x0000 (0x0028 - 0x0028)
class UFortGameSettingRegistryExtension_Tank final  : public UFortGameSettingRegistryExtension
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameSettingRegistryExtension_Tank">();
	}
	static class UFortGameSettingRegistryExtension_Tank* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameSettingRegistryExtension_Tank>();
	}
};

// Class TankUI.TankVehicleReticle
// 0x0020 (0x0558 - 0x0538)
class UTankVehicleReticle final  : public UFortAthenaVehicleDashboardWidget
{
public:
	class AFortTankVehicle*                       OwningTankVehicle;                                 // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinTurretPitch;                                    // 0x0540(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxTurretPitch;                                    // 0x0544(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDistanceMeterEnabled;                             // 0x0548(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTankOrientationEventsEnabled;                     // 0x0549(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_97BB[0xE];                                     // 0x054A(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnDamageablePartHealthChanged(struct FVehicleDamageablePartConfig& PartConfig, struct FVehicleDamageablePart& Part, bool bNewlyDisabled, bool bNewlyEnabled);
	void HandleOnEquipMountedWeapon(class AFortWeaponRanged* EquippedMountedWeapon);
	void OnCannonFired(float RateTime);
	void OnTankDistanceUpdate(float Distance, float DistancePercent);
	void OnTankEngineHealthChanged(float EngineHealth, float EngineHealthMax, bool bNewlyDisabled, bool bNewlyEnabled);
	void OnTankHatchHealthChanged(float HatchHealth, float HatchHealthMax, bool bNewlyDisabled, bool bNewlyEnabled);
	void OnTankRotationValueChanged(float TankValue, float TurretValue);
	void OnTankTargetingPressed();
	void OnTankTargetingReleased();
	void OnTankTurretAimPitchValueChanged(float Pitch, float PitchPercent);
	void OnTankTurretAimYawValueChanged(float Value);
	void OnTreadEnabledChanged(bool bEnabled, ETreadSide Side);
	void SetupVehicleFromBP(class AActor* NewVehicle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TankVehicleReticle">();
	}
	static class UTankVehicleReticle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTankVehicleReticle>();
	}
};

}

