#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrainRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function TrainRuntime.FortTrainCheatManager.SetTrainMoveInPositiveRailDirection
// 0x0001 (0x0001 - 0x0000)
struct FortTrainCheatManager_SetTrainMoveInPositiveRailDirection final 
{
public:
	bool                                          bMoveInPositiveRailDirection;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TrainRuntime.TrainCar.OnActorTargetedForImpulse
// 0x0008 (0x0008 - 0x0000)
struct TrainCar_OnActorTargetedForImpulse final 
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TrainRuntime.TrainCar.OnPawnBasedOnTrainCar
// 0x0008 (0x0008 - 0x0000)
struct TrainCar_OnPawnBasedOnTrainCar final 
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TrainRuntime.TrainCar.OnPawnDebasedTrainCar
// 0x0010 (0x0010 - 0x0000)
struct TrainCar_OnPawnDebasedTrainCar final 
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewBase;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TrainRuntime.TrainCar.GetCarIndex
// 0x0004 (0x0004 - 0x0000)
struct TrainCar_GetCarIndex final 
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TrainRuntime.TrainCar.GetTrainManager
// 0x0008 (0x0008 - 0x0000)
struct TrainCar_GetTrainManager final 
{
public:
	class UFortTrainManager*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TrainRuntime.TrainCar.GetTransformAtServerTime
// 0x0070 (0x0070 - 0x0000)
struct TrainCar_GetTransformAtServerTime final 
{
public:
	float                                         ServerTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9667[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TrainRuntime.FortTrainManager.MoveAlongRail
// 0x0008 (0x0008 - 0x0000)
struct FortTrainManager_MoveAlongRail final 
{
public:
	float                                         DeltaDistance;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateReplicatedMovementData;                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_966D[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TrainRuntime.FortTrainManager.MoveToPositionOnRail
// 0x0008 (0x0008 - 0x0000)
struct FortTrainManager_MoveToPositionOnRail final 
{
public:
	float                                         RailDistance;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateReplicatedMovementData;                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_966E[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TrainRuntime.FortTrainManager.MoveToPositionOnRailAtCurrentServerTime
// 0x0001 (0x0001 - 0x0000)
struct FortTrainManager_MoveToPositionOnRailAtCurrentServerTime final 
{
public:
	bool                                          bUpdateReplicatedMovementData;                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TrainRuntime.FortTrainManager.MoveToTimeAlongRail
// 0x0008 (0x0008 - 0x0000)
struct FortTrainManager_MoveToTimeAlongRail final 
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateReplicatedMovementData;                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_966F[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function TrainRuntime.FortTrainManager.GetWorldLocationAtServerTime
// 0x0020 (0x0020 - 0x0000)
struct FortTrainManager_GetWorldLocationAtServerTime final 
{
public:
	float                                         ServerTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9670[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TrainRuntime.FortTrainRail.GetTimeFromNextTrainArrival
// 0x0008 (0x0008 - 0x0000)
struct FortTrainRail_GetTimeFromNextTrainArrival final 
{
public:
	struct FGameplayTag                           StationIdentifierTag;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function TrainRuntime.FortTrainMovingPlatformComponent.FindOrGetTrainManager
// 0x0008 (0x0008 - 0x0000)
struct FortTrainMovingPlatformComponent_FindOrGetTrainManager final 
{
public:
	class UFortTrainManager*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

