#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleAudioRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "VehicleAudioRuntime_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AudioMotorSim_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Class VehicleAudioRuntime.FortMotorSimComponent_PatternPlayer
// 0x00C0 (0x0170 - 0x00B0)
class UFortMotorSimComponent_PatternPlayer final  : public UAudioMotorSimComponent
{
public:
	float                                         PatternResetCooldown;                              // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83DA[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMotorSimPatternState              DriftState;                                        // 0x00B8(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FFortMotorSimPatternState              AirState;                                          // 0x00E8(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FFortMotorSimPatternState              StartlineState;                                    // 0x0118(0x0030)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_83DB[0x20];                                    // 0x0148(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           CurrentCurve;                                      // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMotorSimComponent_PatternPlayer">();
	}
	static class UFortMotorSimComponent_PatternPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMotorSimComponent_PatternPlayer>();
	}
};

// Class VehicleAudioRuntime.FortMotorSimComponent_SurfaceModifier
// 0x0070 (0x0120 - 0x00B0)
class UFortMotorSimComponent_SurfaceModifier final  : public UAudioMotorSimComponent
{
public:
	TMap<class FName, class UCurveFloat*>         Surfaces;                                          // 0x00B0(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FVector2f                              ThrottleRange;                                     // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         OnsetInterpTime;                                   // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_83DC[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CurrentCurve;                                      // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_83DD[0x8];                                     // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetSurface(class FName NewSurface);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMotorSimComponent_SurfaceModifier">();
	}
	static class UFortMotorSimComponent_SurfaceModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMotorSimComponent_SurfaceModifier>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioControllerInterface
// 0x0000 (0x0028 - 0x0028)
class IFortVehicleAudioControllerInterface final  : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioControllerInterface">();
	}
	static class IFortVehicleAudioControllerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortVehicleAudioControllerInterface>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioControllerSubsystem
// 0x00C8 (0x00F8 - 0x0030)
class UFortVehicleAudioControllerSubsystem final  : public UWorldSubsystem
{
public:
	uint8                                         Pad_83DE[0x28];                                    // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FFortVehicleAudioControllerUpdateGroup> RegisteredUpdateGroups;                            // 0x0058(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UObject>, struct FGameplayTag> ControllerClassToUpdateGroupMappings;              // 0x00A8(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioControllerSubsystem">();
	}
	static class UFortVehicleAudioControllerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAudioControllerSubsystem>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioControllerUpdater
// 0x0000 (0x0028 - 0x0028)
class UFortVehicleAudioControllerUpdater : public UObject
{
public:
	void UpdateControllers(float DeltaTime, TArray<TScriptInterface<class IFortVehicleAudioControllerInterface>>* ControllersToUpdate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioControllerUpdater">();
	}
	static class UFortVehicleAudioControllerUpdater* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAudioControllerUpdater>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioControllerUpdater_UpdateAll
// 0x0000 (0x0028 - 0x0028)
class UFortVehicleAudioControllerUpdater_UpdateAll final  : public UFortVehicleAudioControllerUpdater
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioControllerUpdater_UpdateAll">();
	}
	static class UFortVehicleAudioControllerUpdater_UpdateAll* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAudioControllerUpdater_UpdateAll>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioControllerUpdater_Proximity
// 0x0018 (0x0040 - 0x0028)
class UFortVehicleAudioControllerUpdater_Proximity final  : public UFortVehicleAudioControllerUpdater
{
public:
	float                                         UpdateRadius;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UpdateCap;                                         // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83E0[0x10];                                    // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioControllerUpdater_Proximity">();
	}
	static class UFortVehicleAudioControllerUpdater_Proximity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAudioControllerUpdater_Proximity>();
	}
};

// Class VehicleAudioRuntime.GameFeatureAction_RegisterVehicleAudioClassMappings
// 0x0060 (0x0088 - 0x0028)
class UGameFeatureAction_RegisterVehicleAudioClassMappings final  : public UGameFeatureAction
{
public:
	TMap<struct FSoftClassPath, struct FGameplayTag> ClassMappings;                                     // 0x0028(0x0050)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_83E1[0x10];                                    // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_RegisterVehicleAudioClassMappings">();
	}
	static class UGameFeatureAction_RegisterVehicleAudioClassMappings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_RegisterVehicleAudioClassMappings>();
	}
};

// Class VehicleAudioRuntime.GameFeatureAction_RegisterVehicleAudioControllerGroup
// 0x0060 (0x0088 - 0x0028)
class UGameFeatureAction_RegisterVehicleAudioControllerGroup final  : public UGameFeatureAction
{
public:
	TMap<struct FGameplayTag, class UFortVehicleAudioControllerUpdater*> GroupsToRegister;                                  // 0x0028(0x0050)(Edit, ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_83E2[0x10];                                    // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_RegisterVehicleAudioControllerGroup">();
	}
	static class UGameFeatureAction_RegisterVehicleAudioControllerGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_RegisterVehicleAudioControllerGroup>();
	}
};

// Class VehicleAudioRuntime.VehicleAudioLifecycleInterface
// 0x0000 (0x0028 - 0x0028)
class IVehicleAudioLifecycleInterface final  : public IInterface
{
public:
	void OnInit();
	void OnShutdown();
	void OnUpdate(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleAudioLifecycleInterface">();
	}
	static class IVehicleAudioLifecycleInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IVehicleAudioLifecycleInterface>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioController
// 0x0098 (0x0328 - 0x0290)
class AFortVehicleAudioController : public AActor
{
public:
	uint8                                         Pad_83E3[0x10];                                    // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortVehicleSoundData*                  VehicleSoundData;                                  // 0x02A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83E4[0x4];                                     // 0x02A8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSignificance;                               // 0x02AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bListenerInRange;                                  // 0x02B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceUpdatePastListenerRange;                     // 0x02B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRedlineAllowed;                                   // 0x02B2(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_83E5[0x1];                                     // 0x02B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JitterTime;                                        // 0x02B4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaVehicle*                     VehicleBase;                                       // 0x02B8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortPhysicsVehicleConfigs*             PhysicsVehicleConfigs;                             // 0x02C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLayeredAudioComponent*             LayeredAudioComponent;                             // 0x02C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioParameterComponent*               AudioParameterComponent;                           // 0x02D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioMotorModelComponent*              AudioMotorModelComponent;                          // 0x02D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UREVComponent*                          REVComponent;                                      // 0x02E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioComponent*                        EngineComponent;                                   // 0x02E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFortVehicleSoundComponent*>     VehicleSoundComponents;                            // 0x02F0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_83E6[0x28];                                    // 0x0300(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CacheJitterTime();
	void SetLayeredAudioComponent(class UFortLayeredAudioComponent* InComponent);
	void SetRedlineActive(bool bEnabled);
	void SetVehicle(class AFortAthenaVehicle* InVehicle);
	void UpdateMotorModelNative(float DeltaSeconds);

	class UAudioMotorModelComponent* GetAudioMotorModelComponent() const;
	class UAudioParameterComponent* GetAudioParameterComponent() const;
	float GetBrakingNative() const;
	class UAudioComponent* GetEngineAudioComponent() const;
	float GetJitterTime() const;
	class UFortLayeredAudioComponent* GetLayeredAudioComponent() const;
	const class UFortPhysicsVehicleConfigs* GetPhysicsVehicleConfigs() const;
	bool GetRedlineActive() const;
	class UREVComponent* GetREVComponent() const;
	bool GetShouldUpdate() const;
	float GetThrottleNative() const;
	class AFortAthenaVehicle* GetVehicleActor() const;
	bool IsNativizationEnabled() const;
	bool UseMetasounds() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioController">();
	}
	static class AFortVehicleAudioController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortVehicleAudioController>();
	}
};

// Class VehicleAudioRuntime.FortVehicleSoundComponent
// 0x0010 (0x00B0 - 0x00A0)
class UFortVehicleSoundComponent : public UActorComponent
{
public:
	uint8                                         Pad_83E7[0x8];                                     // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AFortVehicleAudioController> AudioController;                                   // 0x00A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Init();
	void Shutdown();
	void Update(float DeltaSeconds);

	class AFortVehicleAudioController* GetAudioController() const;
	class UAudioParameterComponent* GetAudioParameterComponent() const;
	class UAudioComponent* GetEngineAudioComponent() const;
	class UFortLayeredAudioComponent* GetLayeredAudioComponent() const;
	class UAudioMotorModelComponent* GetMotorModelComponent() const;
	const class UFortPhysicsVehicleConfigs* GetPhysicsVehicleConfigs() const;
	class UREVComponent* GetREVComponent() const;
	class USceneComponent* GetRootComponent() const;
	bool GetUseMetasounds() const;
	class AFortAthenaVehicle* GetVehicleActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleSoundComponent">();
	}
	static class UFortVehicleSoundComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleSoundComponent>();
	}
};

// Class VehicleAudioRuntime.FortVehicleSoundComponent_Speed
// 0x0040 (0x00F0 - 0x00B0)
class UFortVehicleSoundComponent_Speed final  : public UFortVehicleSoundComponent
{
public:
	struct FFortAudioFloatParameter               Speed;                                             // 0x00B0(0x0038)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_83E8[0x8];                                     // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReversedChanged(bool bReversing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleSoundComponent_Speed">();
	}
	static class UFortVehicleSoundComponent_Speed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleSoundComponent_Speed>();
	}
};

// Class VehicleAudioRuntime.FortVehicleSoundComponent_Surface
// 0x00A8 (0x0158 - 0x00B0)
class UFortVehicleSoundComponent_Surface final  : public UFortVehicleSoundComponent
{
public:
	struct FFortVehicleSoundComponent_SurfaceContext Context;                                           // 0x00B0(0x00A8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	void OnBrakingChanged(bool bNewState);
	void OnInAirChanged(bool bNewState);
	void OnSkiddingChanged(bool bNewState);
	void OnSurfaceChanged(EPhysicalSurface NewSurface);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleSoundComponent_Surface">();
	}
	static class UFortVehicleSoundComponent_Surface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleSoundComponent_Surface>();
	}
};

// Class VehicleAudioRuntime.FortVehicleSoundData
// 0x0040 (0x0070 - 0x0030)
class UFortVehicleSoundData final  : public UDataAsset
{
public:
	TArray<class UFortVehicleSoundComponent*>     SoundComponents;                                   // 0x0030(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         MaxListenerDistance;                               // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateDataFromController;                         // 0x0044(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83E9[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxBrakeThreshold;                                 // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThrottleMultiplier;                                // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SurfaceFrictionModifier;                           // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MotorFrictionModifier;                             // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              FrictionJitter;                                    // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanShiftOverride;                                 // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83EA[0x7];                                     // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleSoundData">();
	}
	static class UFortVehicleSoundData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleSoundData>();
	}
};

}

