#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleCosmeticsAudioRuntime

#include "Basic.hpp"

#include "GameFeatures_classes.hpp"
#include "Engine_classes.hpp"
#include "VehicleAudioRuntime_classes.hpp"
#include "VehicleCosmeticsAudioRuntime_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class VehicleCosmeticsAudioRuntime.GameFeatureAction_OverrideMaxLoadedVehicleAudio
// 0x0028 (0x0050 - 0x0028)
class UGameFeatureAction_OverrideMaxLoadedVehicleAudio final  : public UGameFeatureAction
{
public:
	int32                                         DefaultSetting;                                    // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         XB1Setting;                                        // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         XSXSetting;                                        // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PS4Setting;                                        // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PS5Setting;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MobileSetting;                                     // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SwitchSetting;                                     // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85E3[0xC];                                     // 0x0044(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_OverrideMaxLoadedVehicleAudio">();
	}
	static class UGameFeatureAction_OverrideMaxLoadedVehicleAudio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_OverrideMaxLoadedVehicleAudio>();
	}
};

// Class VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController
// 0x0038 (0x0360 - 0x0328)
class AVehicleCosmeticsAudioController : public AFortVehicleAudioController
{
public:
	uint8                                         Pad_85E4[0x8];                                     // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVehicleAudioCosmeticData> CachedEngineAudioItem;                             // 0x0330(0x0020)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85E5[0x10];                                    // 0x0350(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnAudioDataEjected();
	void BP_OnAudioDataLoaded(class USoundBase* Sound);
	void BP_OnCosmeticsFailed(const struct FVehicleCosmeticsFailureInfo& ReasonInfo);
	void BP_OnUpdateAudioData(class UVehicleAudioCosmeticData* CosmeticData);
	void HandleEngineAudioCosmeticsFailed(const struct FVehicleCosmeticsFailureInfo& ReasonInfo);
	void HandleEngineAudioItemUpdated(TSoftObjectPtr<class UVehicleCosmeticsItemDefinition_EngineAudio> EngineAudioItem);
	void UpdateAudioData(class UVehicleAudioCosmeticData* CosmeticData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsAudioController">();
	}
	static class AVehicleCosmeticsAudioController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVehicleCosmeticsAudioController>();
	}
};

// Class VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioManager
// 0x0078 (0x00B8 - 0x0040)
class UVehicleCosmeticsAudioManager final  : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_85E6[0x20];                                    // 0x0040(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundBase*>                     LoadedAssets;                                      // 0x0060(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_85E7[0x10];                                    // 0x0070(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultMaxLoadedCosmetics;                         // 0x0080(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_85E8[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDistancePriority>              DistancePriorities;                                // 0x0088(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	float                                         LocalPlayerCosmeticPriority;                       // 0x0098(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PartyPlayerCosmeticPriority;                       // 0x009C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LicensedCosmeticPriority;                          // 0x00A0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TickInterval;                                      // 0x00A4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_85E9[0x10];                                    // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RegisterVehicleWithAsset(struct FVehicleCosmeticLoadRequestInfo& RequestInfo);
	void RemoveVehicleBudgetOverride();
	void SetVehicleBudgetOverride(int32 NewBudget);
	void UnregisterVehcle(TScriptInterface<class IVehicleCosmeticsAudioUser> Vehicle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsAudioManager">();
	}
	static class UVehicleCosmeticsAudioManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsAudioManager>();
	}
};

// Class VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioUser
// 0x0000 (0x0028 - 0x0028)
class IVehicleCosmeticsAudioUser final  : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsAudioUser">();
	}
	static class IVehicleCosmeticsAudioUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<IVehicleCosmeticsAudioUser>();
	}
};

}

