#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseCamera_0

#include "Basic.hpp"

#include "VerseCamera_0_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseCamera.VerseCamera_camera_director_default.$InitCDO
// 0x0090 (0x0090 - 0x0000)
struct VerseCamera_camera_director_default__InitCDO final 
{
public:
	TArray<class UVerseCamera_camera_mode*>       _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<class UVerseCamera_camera_mode*>       _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_B9DD[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVerseCamera_camera_mode*>       _ExprResult_5;                                     // 0x0048(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0058(0x0010)(ContainsInstancedReference)
	TArray<class UVerseCamera_camera_mode*>       _ForResult_6;                                      // 0x0068(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseCamera.VerseCamera_camera_director_default._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RAddCameraMode_L_Ncamera__mode_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCamera_camera_director_default__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RAddCameraMode_L_Ncamera__mode_R final 
{
public:
	class UVerseCamera_camera_mode*               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_director_default._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RAddSubDirector_L_Ncamera__director__interface_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCamera_camera_director_default__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RAddSubDirector_L_Ncamera__director__interface_R final 
{
public:
	class UObject*                                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_director_default._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RDetermineActiveCameraMode_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_director_default__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RDetermineActiveCameraMode_L_Ntag_R final 
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseCamera_camera_mode*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_director_default._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RRemoveCameraMode_L_Ncamera__mode_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCamera_camera_director_default__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RRemoveCameraMode_L_Ncamera__mode_R final 
{
public:
	class UVerseCamera_camera_mode*               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_director_default._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RRemoveSubDirector_L_Ncamera__director__interface_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCamera_camera_director_default__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RRemoveSubDirector_L_Ncamera__director__interface_R final 
{
public:
	class UObject*                                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera._L_2fUnrealEngine_2ecom_2fVerseCamera_N_RGetPlayerCameraView_L_Nplayer_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera__L_2fUnrealEngine_2ecom_2fVerseCamera_N_RGetPlayerCameraView_L_Nplayer_R final 
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseCamera_player_camera_view*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera._L_2fUnrealEngine_2ecom_2fVerseCamera_N_RGetPlayerCameraViewByIndex_L_Nint_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera__L_2fUnrealEngine_2ecom_2fVerseCamera_N_RGetPlayerCameraViewByIndex_L_Nint_R final 
{
public:
	int64                                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UVerseCamera_player_camera_view*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera.VerseCamera_camera_mode_blend_params$Factory
// 0x0020 (0x0020 - 0x0000)
struct VerseCamera_VerseCamera_camera_mode_blend_params_Factory final 
{
public:
	struct FVerseCamera_camera_mode_blend_params  RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseCamera.VerseCamera.VerseCamera_camera_mode_blend_params$OverrideFactory
// 0x0130 (0x0130 - 0x0000)
struct VerseCamera_VerseCamera_camera_mode_blend_params_OverrideFactory final 
{
public:
	struct FVerseCamera_camera_mode_blend_params  RetVal;                                            // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0020(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0070(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0080(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9DE[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_2;                                // 0x0088(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_3;                                     // 0x0098(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9DF[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_4;                                // 0x00A0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_5;                                     // 0x00B0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9E0[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_6;                                // 0x00B8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_7;                                     // 0x00C8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9E1[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_8;                                // 0x00D0(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_9;                                     // 0x00E0(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9E2[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_10;                               // 0x00E8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_11;                                    // 0x00F8(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9E3[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_12;                               // 0x0100(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_13;                                    // 0x0110(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9E4[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_14;                               // 0x0118(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_15;                                    // 0x0128(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_player_camera_view._L_2fUnrealEngine_2ecom_2fVerseCamera_2fplayer__camera__view_N_RGetCameraBehavior
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_player_camera_view__L_2fUnrealEngine_2ecom_2fVerseCamera_2fplayer__camera__view_N_RGetCameraBehavior final 
{
public:
	struct VerseCamera_0::FTuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_B9E6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseCamera_camera_behavior_component*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_player_camera_view._L_2fUnrealEngine_2ecom_2fVerseCamera_2fplayer__camera__view_N_RSetCameraBehavior_L_Ncamera__behavior__component_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCamera_player_camera_view__L_2fUnrealEngine_2ecom_2fVerseCamera_2fplayer__camera__view_N_RSetCameraBehavior_L_Ncamera__behavior__component_R final 
{
public:
	class UVerseCamera_camera_behavior_component* __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_behavior_component.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct VerseCamera_camera_behavior_component__InitCDO final 
{
public:
	class UVerseCamera_camera_director_default*   _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UVerseCamera_camera_evaluator_context*, true> _ExprResult_2;                                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_4;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9E9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseCamera_camera_director_default*   _ExprResult_5;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UVerseCamera_camera_evaluator_context*, true> _ExprResult_7;                                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_8 : 1;                                 // 0x003A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_9;                                // 0x003B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_behavior_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct VerseCamera_camera_behavior_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final 
{
public:
	struct VerseCamera_0::FTuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseCamera.VerseCamera_camera_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct VerseCamera_camera_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final 
{
public:
	struct VerseCamera_0::FTuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseCamera.VerseCamera_camera_director_interface._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RAddCameraMode_L_Ncamera__mode_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCamera_camera_director_interface__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RAddCameraMode_L_Ncamera__mode_R final 
{
public:
	class UVerseCamera_camera_mode*               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_director_interface._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RAddSubDirector_L_Ncamera__director__interface_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCamera_camera_director_interface__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RAddSubDirector_L_Ncamera__director__interface_R final 
{
public:
	class UObject*                                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_director_interface._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RDetermineActiveCameraMode_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct VerseCamera_camera_director_interface__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RDetermineActiveCameraMode_L_Ntag_R final 
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseCamera_camera_mode*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_director_interface._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RRemoveCameraMode_L_Ncamera__mode_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCamera_camera_director_interface__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RRemoveCameraMode_L_Ncamera__mode_R final 
{
public:
	class UVerseCamera_camera_mode*               __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_director_interface._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RRemoveSubDirector_L_Ncamera__director__interface_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCamera_camera_director_interface__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__director__interface_N_RRemoveSubDirector_L_Ncamera__director__interface_R final 
{
public:
	class UObject*                                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_mode.$InitCDO
// 0x00B0 (0x00B0 - 0x0000)
struct VerseCamera_camera_mode__InitCDO final 
{
public:
	class UVerseCamera_camera_mode_default_tag*   _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_2;                                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseCamera_camera_mode_blend_params  _ExprResult_3;                                     // 0x0018(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseCamera_camera_mode_blend_params  _ExprResult_4;                                     // 0x0038(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerseCamera_camera_mode_default_tag*   _ExprResult_5;                                     // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_7;                                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseCamera_camera_mode_blend_params  _ExprResult_8;                                     // 0x0070(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVerseCamera_camera_mode_blend_params  _ExprResult_9;                                     // 0x0090(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function VerseCamera.VerseCamera_camera_mode._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__mode_N_RClearEvaluatorContext
// 0x0001 (0x0001 - 0x0000)
struct VerseCamera_camera_mode__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__mode_N_RClearEvaluatorContext final 
{
public:
	struct VerseCamera_0::FTuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_mode._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__mode_N_RSetEvaluatorContext_L_Ncamera__evaluator__context_R
// 0x0008 (0x0008 - 0x0000)
struct VerseCamera_camera_mode__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__mode_N_RSetEvaluatorContext_L_Ncamera__evaluator__context_R final 
{
public:
	class UVerseCamera_camera_evaluator_context*  __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_mode._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__mode_N_RUpdateCameraModeParameters
// 0x0001 (0x0001 - 0x0000)
struct VerseCamera_camera_mode__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__mode_N_RUpdateCameraModeParameters final 
{
public:
	struct VerseCamera_0::FTuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_mode_fixed_angle.$InitCDO
// 0x0170 (0x0170 - 0x0000)
struct VerseCamera_camera_mode_fixed_angle__InitCDO final 
{
public:
	class UVerseCamera_camera_mode_fixed_angle_tag* _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_2;                                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_offset_space              _ExprResult_3;                                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9EF[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_4;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_5;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_6;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_7;                                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_8;                                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_fixed_angle_follow_type   _ExprResult_9;                                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9F0[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_10;                                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_11;                                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_12;                                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_13;                                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_14 : 1;                                // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	EVerseCamera_camera_dead_zone_shape           _ExprResult_15;                                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9F1[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_16;                                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_17;                                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_18;                                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_boom_collision_type       _ExprResult_19;                                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9F2[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_20;                                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_21;                                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_22;                                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_23;                                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseCamera_camera_mode_fixed_angle_tag* _ExprResult_24;                                    // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_25;                               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_26;                                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_offset_space              _ExprResult_27;                                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9F3[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_28;                                    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_29;                                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_30;                                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_31;                                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_32;                                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_fixed_angle_follow_type   _ExprResult_33;                                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9F4[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_34;                                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_35;                                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_36;                                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_37;                                    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_38 : 1;                                // 0x0128(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	EVerseCamera_camera_dead_zone_shape           _ExprResult_39;                                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9F5[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_40;                                    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_41;                                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_42;                                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_boom_collision_type       _ExprResult_43;                                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9F6[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_44;                                    // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_45;                                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_46;                                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_47;                                    // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_mode_fixed_point.$InitCDO
// 0x0110 (0x0110 - 0x0000)
struct VerseCamera_camera_mode_fixed_point__InitCDO final 
{
public:
	class UVerseCamera_camera_mode_fixed_point_tag* _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_2;                                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_B9FA[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_4;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_5;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_6;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_offset_space              _ExprResult_7;                                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_8 : 1;                                 // 0x0039(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_B9FB[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_9;                                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_10;                                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_11;                                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_12;                                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_13 : 1;                                // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_B9FC[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_14;                                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_15;                                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_16;                                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_17;                                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseCamera_camera_mode_fixed_point_tag* _ExprResult_18;                                    // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_19;                               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_20;                                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_21 : 1;                                // 0x00A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_B9FD[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_22;                                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_23;                                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_24;                                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_offset_space              _ExprResult_25;                                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_26 : 1;                                // 0x00C1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_B9FE[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_27;                                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_28;                                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_29;                                    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_30;                                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_31 : 1;                                // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_B9FF[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_32;                                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_33;                                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_34;                                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_35;                                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_entity_camera_evaluator_context.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct VerseCamera_entity_camera_evaluator_context__InitCDO final 
{
public:
	TOptional<class Entity_0::UEntity*, true>     _ExprResult_0;                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA00[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Entity_0::UEntity*, true>     _ExprResult_3;                                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA01[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Entity_0::UEntity*, true>     _ExprResult_6;                                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__5;                             // 0x0028(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x002A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_8;                                // 0x002B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA02[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Entity_0::UEntity*, true>     _ExprResult_9;                                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__7;                             // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x003A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_11;                               // 0x003B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_mode_third_person.$InitCDO
// 0x0120 (0x0120 - 0x0000)
struct VerseCamera_camera_mode_third_person__InitCDO final 
{
public:
	class UVerseCamera_camera_mode_third_person_tag* _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_2;                                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_3;                                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_4;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_offset_space              _ExprResult_5;                                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA07[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_6;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_7;                                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_8;                                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_offset_space              _ExprResult_9;                                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x0049(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_BA08[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_11;                                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_12;                                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_13;                                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_boom_collision_type       _ExprResult_14;                                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA09[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_15;                                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_16;                                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_17;                                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_18;                                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseCamera_camera_mode_third_person_tag* _ExprResult_19;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_20;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_21;                                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_22;                                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_23;                                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_offset_space              _ExprResult_24;                                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA0A[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_25;                                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_26;                                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_27;                                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_offset_space              _ExprResult_28;                                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_29 : 1;                                // 0x00D9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_BA0B[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_30;                                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_31;                                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_32;                                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseCamera_camera_boom_collision_type       _ExprResult_33;                                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA0C[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_34;                                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_35;                                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_36;                                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_37;                                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseCamera.VerseCamera_camera_mode_third_person._L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__mode_N_RUpdateCameraModeParameters
// 0x0001 (0x0001 - 0x0000)
struct VerseCamera_camera_mode_third_person__L_2fUnrealEngine_2ecom_2fVerseCamera_2fcamera__mode_N_RUpdateCameraModeParameters final 
{
public:
	struct VerseCamera_0::FTuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};

}

