#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseInput

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK::Params
{

// Function VerseInput.ControlInput_input_action.$InitCDO
// 0x0090 (0x0090 - 0x0000)
struct ControlInput_input_action__InitCDO final 
{
public:
	TArray<class UControlInput_modifier*>         _ExprResult_0;                                     // 0x0000(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_1;                        // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<class UControlInput_modifier*>         _ForResult_1;                                      // 0x0020(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_2;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_3;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_3;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_92C0[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UControlInput_modifier*>         _ExprResult_5;                                     // 0x0048(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_5;                        // 0x0058(0x0010)(ContainsInstancedReference)
	TArray<class UControlInput_modifier*>         _ForResult_6;                                      // 0x0068(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_7;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};

// Function VerseInput.ControlInput._L_2fVerse_2eorg_2fControlInput_N_RGetPlayerInput_L_Nplayer_R
// 0x0010 (0x0010 - 0x0000)
struct ControlInput__L_2fVerse_2eorg_2fControlInput_N_RGetPlayerInput_L_Nplayer_R final 
{
public:
	class USimulation_player*                     __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UControlInput_player_input*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseInput.ControlInput_InputVerbs.$InitCDO
// 0x0C80 (0x0C80 - 0x0000)
struct ControlInput_InputVerbs__InitCDO final 
{
public:
	class UControlInput_verb*                     _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0010(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_3;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_4;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0030(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_6;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_9;                                     // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_10;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x0070(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_12;                                    // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x0090(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_15;                                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_16;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x00B0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_18;                                    // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_19;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_20;                                    // 0x00D0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_21;                                    // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_22;                               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x00F0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_24;                                    // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_25;                               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_26;                                    // 0x0110(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_27;                                    // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_28;                               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_29;                                    // 0x0130(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_30;                                    // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_31;                               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_32;                                    // 0x0150(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_33;                                    // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_34;                               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_35;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_36;                                    // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_37;                               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_38;                                    // 0x0190(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_39;                                    // 0x01A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_40;                               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_41;                                    // 0x01B0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_42;                                    // 0x01C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_43;                               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_44;                                    // 0x01D0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_45;                                    // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_46;                               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_47;                                    // 0x01F0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_48;                                    // 0x0200(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_49;                               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_50;                                    // 0x0210(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_51;                                    // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_52;                               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_53;                                    // 0x0230(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_54;                                    // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_55;                               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_56;                                    // 0x0250(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_57;                                    // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_58;                               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_59;                                    // 0x0270(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_60;                                    // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_61;                               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_62;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_63;                                    // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_64;                               // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_65;                                    // 0x02B0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_66;                                    // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_67;                               // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_68;                                    // 0x02D0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_69;                                    // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_70;                               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_71;                                    // 0x02F0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_72;                                    // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_73;                               // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_74;                                    // 0x0310(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_75;                                    // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_76;                               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_77;                                    // 0x0330(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_78;                                    // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_79;                               // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_80;                                    // 0x0350(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_81;                                    // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_82;                               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_83;                                    // 0x0370(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_84;                                    // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_85;                               // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_86;                                    // 0x0390(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_87;                                    // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_88;                               // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_89;                                    // 0x03B0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_90;                                    // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_91;                               // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_92;                                    // 0x03D0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_93;                                    // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_94;                               // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_95;                                    // 0x03F0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_96;                                    // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_97;                               // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_98;                                    // 0x0410(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_99;                                    // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_100;                              // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_101;                                   // 0x0430(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_102;                                   // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_103;                              // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_104;                                   // 0x0450(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_105;                                   // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_106;                              // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_107;                                   // 0x0470(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_108;                                   // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_109;                              // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_110;                                   // 0x0490(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_111;                                   // 0x04A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_112;                              // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_113;                                   // 0x04B0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_114;                                   // 0x04C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_115;                              // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_116;                                   // 0x04D0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_117;                                   // 0x04E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_118;                              // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_119;                                   // 0x04F0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_120;                                   // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_121;                              // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_122;                                   // 0x0510(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_123;                                   // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_124;                              // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_125;                                   // 0x0530(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_126;                                   // 0x0540(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_127;                              // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_128;                                   // 0x0550(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_129;                                   // 0x0560(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_130;                              // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_131;                                   // 0x0570(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_132;                                   // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_133;                              // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_134;                                   // 0x0590(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_135;                                   // 0x05A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_136;                              // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_137;                                   // 0x05B0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_138;                                   // 0x05C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_139;                              // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_140;                                   // 0x05D0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_141;                                   // 0x05E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_142;                              // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_143;                                   // 0x05F0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_144;                                   // 0x0600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_145;                              // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_146;                                   // 0x0610(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_147;                                   // 0x0620(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_148;                              // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_149;                                   // 0x0630(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_150;                                   // 0x0640(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_151;                              // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_152;                                   // 0x0650(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_153;                                   // 0x0660(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_154;                              // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_155;                                   // 0x0670(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_156;                                   // 0x0680(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_157;                              // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_158;                                   // 0x0690(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_159;                                   // 0x06A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_160;                              // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_161;                                   // 0x06B0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_162;                                   // 0x06C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_163;                              // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_164;                                   // 0x06D0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_165;                                   // 0x06E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_166;                              // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_167;                                   // 0x06F0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_168;                                   // 0x0700(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_169;                              // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_170;                                   // 0x0710(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_171;                                   // 0x0720(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_172;                              // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_173;                                   // 0x0730(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_174;                                   // 0x0740(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_175;                              // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_176;                                   // 0x0750(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_177;                                   // 0x0760(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_178;                              // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_179;                                   // 0x0770(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_180;                                   // 0x0780(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_181;                              // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_182;                                   // 0x0790(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_183;                                   // 0x07A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_184;                              // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_185;                                   // 0x07B0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_186;                                   // 0x07C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_187;                              // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_188;                                   // 0x07D0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_189;                                   // 0x07E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_190;                              // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_191;                                   // 0x07F0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_192;                                   // 0x0800(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_193;                              // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_194;                                   // 0x0810(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_195;                                   // 0x0820(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_196;                              // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_197;                                   // 0x0830(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_198;                                   // 0x0840(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_199;                              // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_200;                                   // 0x0850(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_201;                                   // 0x0860(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_202;                              // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_203;                                   // 0x0870(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_204;                                   // 0x0880(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_205;                              // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_206;                                   // 0x0890(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_207;                                   // 0x08A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_208;                              // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_209;                                   // 0x08B0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_210;                                   // 0x08C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_211;                              // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_212;                                   // 0x08D0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_213;                                   // 0x08E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_214;                              // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_215;                                   // 0x08F0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_216;                                   // 0x0900(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_217;                              // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_218;                                   // 0x0910(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_219;                                   // 0x0920(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_220;                              // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_221;                                   // 0x0930(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_222;                                   // 0x0940(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_223;                              // 0x0948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_224;                                   // 0x0950(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_225;                                   // 0x0960(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_226;                              // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_227;                                   // 0x0970(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_228;                                   // 0x0980(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_229;                              // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_230;                                   // 0x0990(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_231;                                   // 0x09A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_232;                              // 0x09A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_233;                                   // 0x09B0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_234;                                   // 0x09C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_235;                              // 0x09C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_236;                                   // 0x09D0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_237;                                   // 0x09E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_238;                              // 0x09E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_239;                                   // 0x09F0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_240;                                   // 0x0A00(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_241;                              // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_242;                                   // 0x0A10(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_243;                                   // 0x0A20(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_244;                              // 0x0A28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_245;                                   // 0x0A30(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_246;                                   // 0x0A40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_247;                              // 0x0A48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_248;                                   // 0x0A50(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_249;                                   // 0x0A60(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_250;                              // 0x0A68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_251;                                   // 0x0A70(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_252;                                   // 0x0A80(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_253;                              // 0x0A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_254;                                   // 0x0A90(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_255;                                   // 0x0AA0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_256;                              // 0x0AA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_257;                                   // 0x0AB0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_258;                                   // 0x0AC0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_259;                              // 0x0AC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_260;                                   // 0x0AD0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_261;                                   // 0x0AE0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_262;                              // 0x0AE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_263;                                   // 0x0AF0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_264;                                   // 0x0B00(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_265;                              // 0x0B08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_266;                                   // 0x0B10(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_267;                                   // 0x0B20(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_268;                              // 0x0B28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_269;                                   // 0x0B30(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_270;                                   // 0x0B40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_271;                              // 0x0B48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_272;                                   // 0x0B50(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_273;                                   // 0x0B60(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_274;                              // 0x0B68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_275;                                   // 0x0B70(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_276;                                   // 0x0B80(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_277;                              // 0x0B88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_278;                                   // 0x0B90(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_279;                                   // 0x0BA0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_280;                              // 0x0BA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_281;                                   // 0x0BB0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_282;                                   // 0x0BC0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_283;                              // 0x0BC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_284;                                   // 0x0BD0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_285;                                   // 0x0BE0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_286;                              // 0x0BE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_287;                                   // 0x0BF0(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_288;                                   // 0x0C00(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_289;                              // 0x0C08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_290;                                   // 0x0C10(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_291;                                   // 0x0C20(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_292;                              // 0x0C28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_293;                                   // 0x0C30(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_294;                                   // 0x0C40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_295;                              // 0x0C48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_296;                                   // 0x0C50(0x0010)(HasGetValueTypeHash)
	class UControlInput_verb*                     _ExprResult_297;                                   // 0x0C60(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_298;                              // 0x0C68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_299;                                   // 0x0C70(0x0010)(HasGetValueTypeHash)
};

// Function VerseInput.ControlInput_exponential_response.$InitCDO
// 0x0130 (0x0130 - 0x0000)
struct ControlInput_exponential_response__InitCDO final 
{
public:
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_1;                                // 0x0018(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0068(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_5;                                     // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_6;                                // 0x00B0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0120(0x0010)(HasGetValueTypeHash)
};

// Function VerseInput.ControlInput_player_input._L_2fVerse_2eorg_2fControlInput_2fplayer__input_N_RAddInputAction_L_Ninput__action_R
// 0x0008 (0x0008 - 0x0000)
struct ControlInput_player_input__L_2fVerse_2eorg_2fControlInput_2fplayer__input_N_RAddInputAction_L_Ninput__action_R final 
{
public:
