#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseCamera

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "VerseCamera_structs.hpp"


namespace SDK
{

// Class VerseCamera.PrototypeCameraDirector
// 0x0020 (0x0048 - 0x0028)
class UPrototypeCameraDirector : public UObject
{
public:
	struct FGameplayTagContainer                  Categories;                                        // 0x0028(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrototypeCameraDirector">();
	}
	static class UPrototypeCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrototypeCameraDirector>();
	}
};

// Class VerseCamera.VerseCameraDirectorAdapter
// 0x0018 (0x0060 - 0x0048)
class UVerseCameraDirectorAdapter final  : public UPrototypeCameraDirector
{
public:
	uint8                                         Pad_82E1[0x18];                                    // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCameraDirectorAdapter">();
	}
	static class UVerseCameraDirectorAdapter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCameraDirectorAdapter>();
	}
};

// Class VerseCamera.PrototypeCameraEvaluatorContext
// 0x00E8 (0x0110 - 0x0028)
class UPrototypeCameraEvaluatorContext : public UObject
{
public:
	uint8                                         Pad_82E2[0xE8];                                    // 0x0028(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrototypeCameraEvaluatorContext">();
	}
	static class UPrototypeCameraEvaluatorContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrototypeCameraEvaluatorContext>();
	}
};

// Class VerseCamera.VerseCameraEvaluatorContext
// 0x0000 (0x0110 - 0x0110)
class UVerseCameraEvaluatorContext : public UPrototypeCameraEvaluatorContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCameraEvaluatorContext">();
	}
	static class UVerseCameraEvaluatorContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCameraEvaluatorContext>();
	}
};

// Class VerseCamera.PrototypeCameraMode
// 0x0050 (0x0078 - 0x0028)
class UPrototypeCameraMode : public UObject
{
public:
	class UCameraOperation*                       RootCameraOperation;                               // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrototypeCameraEvaluatorContext*       EvaluatorContext;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  CameraModeTags;                                    // 0x0038(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FPrototypeCameraModeTransition         TransitionInData;                                  // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FPrototypeCameraModeTransition         TransitionOutData;                                 // 0x0068(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrototypeCameraMode">();
	}
	static class UPrototypeCameraMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrototypeCameraMode>();
	}
};

// Class VerseCamera.VerseCameraMode
// 0x0000 (0x0078 - 0x0078)
class UVerseCameraMode final  : public UPrototypeCameraMode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCameraMode">();
	}
	static class UVerseCameraMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCameraMode>();
	}
};

// Class VerseCamera.PriorityListPrototypeCameraDirector
// 0x0050 (0x0098 - 0x0048)
class UPriorityListPrototypeCameraDirector final  : public UPrototypeCameraDirector
{
public:
	TMap<class UPrototypeCameraMode*, float>      CameraModes;                                       // 0x0048(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PriorityListPrototypeCameraDirector">();
	}
	static class UPriorityListPrototypeCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPriorityListPrototypeCameraDirector>();
	}
};

// Class VerseCamera.PrototypeCameraEvaluator
// 0x0858 (0x0880 - 0x0028)
class alignas(0x10) UPrototypeCameraEvaluator final  : public UObject
{
public:
	class URootCameraOperation*                   RootCameraOperation;                               // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrototypeCameraDirector*               RootCameraDirector;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrototypeCameraEvaluatorContext*       DefaultEvaluatorContext;                           // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_82E3[0x840];                                   // 0x0040(0x0840)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrototypeCameraEvaluator">();
	}
	static class UPrototypeCameraEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrototypeCameraEvaluator>();
	}
};

// Class VerseCamera.CameraOperation
// 0x0000 (0x0028 - 0x0028)
class UCameraOperation : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraOperation">();
	}
	static class UCameraOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraOperation>();
	}
};

// Class VerseCamera.BlendableCameraModeWrapperOperation
// 0x0020 (0x0048 - 0x0028)
class UBlendableCameraModeWrapperOperation final  : public UCameraOperation
{
public:
	class UPrototypeCameraMode*                   CameraMode;                                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_82E4[0x18];                                    // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendableCameraModeWrapperOperation">();
	}
	static class UBlendableCameraModeWrapperOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendableCameraModeWrapperOperation>();
	}
};

// Class VerseCamera.BlendStackCameraOperation
// 0x0010 (0x0038 - 0x0028)
class UBlendStackCameraOperation final  : public UCameraOperation
{
public:
	TArray<class UBlendableCameraModeWrapperOperation*> CameraModes;                                       // 0x0028(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendStackCameraOperation">();
	}
	static class UBlendStackCameraOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackCameraOperation>();
	}
};

// Class VerseCamera.RootCameraOperation
// 0x0000 (0x0028 - 0x0028)
class URootCameraOperation : public UCameraOperation
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RootCameraOperation">();
	}
	static class URootCameraOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootCameraOperation>();
	}
};

// Class VerseCamera.DefaultRootCameraOperation
// 0x0050 (0x0078 - 0x0028)
class UDefaultRootCameraOperation final  : public URootCameraOperation
{
public:
	TMap<class FName, class UBlendStackCameraOperation*> StackLayers;                                       // 0x0028(0x0050)(ExportObject, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DefaultRootCameraOperation">();
	}
	static class UDefaultRootCameraOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultRootCameraOperation>();
	}
};

// Class VerseCamera.ArrayCameraOperation
// 0x0010 (0x0038 - 0x0028)
class UArrayCameraOperation final  : public UCameraOperation
{
public:
	TArray<class UCameraOperation*>               Children;                                          // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void AddChild(class UCameraOperation* CameraOperation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArrayCameraOperation">();
	}
	static class UArrayCameraOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArrayCameraOperation>();
	}
};

// Class VerseCamera.CameraSetFieldOfViewOperation
// 0x0008 (0x0030 - 0x0028)
class UCameraSetFieldOfViewOperation final  : public UCameraOperation
{
public:
	float                                         FieldOfViewDegrees;                                // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82E5[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraSetFieldOfViewOperation">();
	}
	static class UCameraSetFieldOfViewOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraSetFieldOfViewOperation>();
	}
};

// Class VerseCamera.OffsetCameraOperation
// 0x0010 (0x0038 - 0x0028)
class UOffsetCameraOperation final  : public UCameraOperation
{
public:
	float                                         OffsetForward;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetRight;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetUp;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraOperationSpace                         OffsetSpace;                                       // 0x0034(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82E6[0x3];                                     // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OffsetCameraOperation">();
	}
	static class UOffsetCameraOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOffsetCameraOperation>();
	}
};

// Class VerseCamera.OffsetCameraFromTargetOperation
// 0x0010 (0x0038 - 0x0028)
class UOffsetCameraFromTargetOperation final  : public UCameraOperation
{
public:
	float                                         OffsetForward;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetRight;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetUp;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraOperationSpace                         OffsetSpace;                                       // 0x0034(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82E7[0x3];                                     // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OffsetCameraFromTargetOperation">();
	}
	static class UOffsetCameraFromTargetOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOffsetCameraFromTargetOperation>();
	}
};

// Class VerseCamera.SetPivotPointFromTargetOperation
// 0x0010 (0x0038 - 0x0028)
class USetPivotPointFromTargetOperation final  : public UCameraOperation
{
public:
	float                                         OffsetForward;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetRight;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetUp;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraOperationSpace                         OffsetSpace;                                       // 0x0034(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82E8[0x3];                                     // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SetPivotPointFromTargetOperation">();
	}
	static class USetPivotPointFromTargetOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetPivotPointFromTargetOperation>();
	}
};

// Class VerseCamera.RotateCameraAroundPivotPointOperation
// 0x0008 (0x0030 - 0x0028)
class URotateCameraAroundPivotPointOperation final  : public UCameraOperation
{
public:
	float                                         RotateYaw;                                         // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotatePitch;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RotateCameraAroundPivotPointOperation">();
	}
	static class URotateCameraAroundPivotPointOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<URotateCameraAroundPivotPointOperation>();
	}
};

// Class VerseCamera.LookAtTargetOperation
// 0x0010 (0x0038 - 0x0028)
class ULookAtTargetOperation : public UCameraOperation
{
public:
	float                                         OffsetForward;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetRight;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetUp;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraOperationSpace                         OffsetSpace;                                       // 0x0034(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x0035(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82E9[0x2];                                     // 0x0036(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LookAtTargetOperation">();
	}
	static class ULookAtTargetOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULookAtTargetOperation>();
	}
};

// Class VerseCamera.LookAtTargetWithClampAndDeadZoneOperation
// 0x0048 (0x0080 - 0x0038)
class ULookAtTargetWithClampAndDeadZoneOperation final  : public ULookAtTargetOperation
{
public:
	bool                                          bIsClampEnabled;                                   // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82EA[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ClampPitchDegreesMin;                              // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClampPitchDegreesMax;                              // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClampYawDegreesMin;                                // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClampYawDegreesMax;                                // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDeadZoneEnabled;                                // 0x004C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82EB[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeadZonePitchDegreesMin;                           // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZonePitchDegreesMax;                           // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZoneYawDegreesMin;                             // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZoneYawDegreesMax;                             // 0x005C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZonePitchOffset;                               // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZoneYawOffset;                                 // 0x0064(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82EC[0x18];                                    // 0x0068(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LookAtTargetWithClampAndDeadZoneOperation">();
	}
	static class ULookAtTargetWithClampAndDeadZoneOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULookAtTargetWithClampAndDeadZoneOperation>();
	}
};

// Class VerseCamera.FixedAngleCameraFollowOperation
// 0x0088 (0x00B0 - 0x0028)
class UFixedAngleCameraFollowOperation final  : public UCameraOperation
{
public:
	float                                         CameraSpeedHorizontal;                             // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraSpeedVertical;                               // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDeadZoneEnabled;                                // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraDeadZoneShape                          DeadZoneShape;                                     // 0x0031(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82ED[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeadZoneDiameter;                                  // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZoneWidth;                                     // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZoneHeight;                                    // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82EE[0x70];                                    // 0x0040(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FixedAngleCameraFollowOperation">();
	}
	static class UFixedAngleCameraFollowOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFixedAngleCameraFollowOperation>();
	}
};

// Class VerseCamera.FollowDeadZoneOperation
// 0x0088 (0x00B0 - 0x0028)
class UFollowDeadZoneOperation final  : public UCameraOperation
{
public:
	bool                                          bIsEnabled;                                        // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraDeadZoneShape                          DeadZoneShape;                                     // 0x0029(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82EF[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeadZoneDiameter;                                  // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZoneWidth;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZoneHeight;                                    // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82F0[0x78];                                    // 0x0038(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FollowDeadZoneOperation">();
	}
	static class UFollowDeadZoneOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFollowDeadZoneOperation>();
	}
};

// Class VerseCamera.SpringFollowTargetOperation
// 0x0060 (0x0088 - 0x0028)
class USpringFollowTargetOperation final  : public UCameraOperation
{
public:
	float                                         SpringStiffness;                                   // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistanceToTarget;                               // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82F1[0x57];                                    // 0x0031(0x0057)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpringFollowTargetOperation">();
	}
	static class USpringFollowTargetOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpringFollowTargetOperation>();
	}
};

// Class VerseCamera.InterpFollowOperation
// 0x0030 (0x0058 - 0x0028)
class UInterpFollowOperation final  : public UCameraOperation
{
public:
	float                                         InterpolationSpeed;                                // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistanceToTarget;                               // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82F2[0x27];                                    // 0x0031(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterpFollowOperation">();
	}
	static class UInterpFollowOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterpFollowOperation>();
	}
};

// Class VerseCamera.ThirdPersonCameraOperation
// 0x0028 (0x0050 - 0x0028)
class UThirdPersonCameraOperation final  : public UCameraOperation
{
public:
	class UCameraSetFieldOfViewOperation*         FOVOperation;                                      // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOffsetCameraFromTargetOperation*       OffsetFromTargetOperation;                         // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULookAtTargetOperation*                 LookAtTargetOperation;                             // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpringFollowTargetOperation*           SpringFollowTargetOperation;                       // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USetPivotPointFromTargetOperation*      SetPivotOperation;                                 // 0x0048(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ThirdPersonCameraOperation">();
	}
	static class UThirdPersonCameraOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UThirdPersonCameraOperation>();
	}
};

// Class VerseCamera.FixedPointCameraOperation
// 0x0010 (0x0038 - 0x0028)
class UFixedPointCameraOperation final  : public UCameraOperation
{
public:
	class UCameraSetFieldOfViewOperation*         FOVOperation;                                      // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULookAtTargetWithClampAndDeadZoneOperation* LookAtTargetOperation;                             // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FixedPointCameraOperation">();
	}
	static class UFixedPointCameraOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFixedPointCameraOperation>();
	}
};

// Class VerseCamera.FixedAngleCameraOperation
// 0x0040 (0x0068 - 0x0028)
class UFixedAngleCameraOperation final  : public UCameraOperation
{
public:
	class UCameraSetFieldOfViewOperation*         FOVOperation;                                      // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOffsetCameraFromTargetOperation*       OffsetFromTargetOperation;                         // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USetPivotPointFromTargetOperation*      SetPivotOperation;                                 // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URotateCameraAroundPivotPointOperation* RotateAroundPivotOperation;                        // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULookAtTargetOperation*                 LookAtTargetOperation;                             // 0x0048(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFollowDeadZoneOperation*               DeadZoneOperation;                                 // 0x0050(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInterpFollowOperation*                 InterpFollowOperation;                             // 0x0058(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpringFollowTargetOperation*           SpringFollowOperation;                             // 0x0060(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FixedAngleCameraOperation">();
	}
	static class UFixedAngleCameraOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFixedAngleCameraOperation>();
	}
};

// Class VerseCamera.VersePlayerCameraViewComponent
// 0x0000 (0x00A0 - 0x00A0)
class UVersePlayerCameraViewComponent : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VersePlayerCameraViewComponent">();
	}
	static class UVersePlayerCameraViewComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVersePlayerCameraViewComponent>();
	}
};

}

