#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseDevices_0

#include "Basic.hpp"

#include "VerseFortnite_0_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseAssets_0_classes.hpp"
#include "VerseDevices_0_structs.hpp"
#include "VerseDevices_classes.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "UnrealEngineExperimental_0_classes.hpp"
#include "VerseColors_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_0_classes.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseClass VerseDevices.Devices_device_function_get_base
// 0x0010 (0x0038 - 0x0028)
class UDevices_device_function_get_base : public UObject
{
public:
	FVerseStringProperty_                         __verse_0xF8B4D924_FunctionName;                   // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_base">();
	}
	static class UDevices_device_function_get_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_base>();
	}
};

// VerseClass VerseDevices.Devices_device_function_get_int
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_get_int final  : public UDevices_device_function_get_base
{
public:
	FVerseFunctionProperty_                       __verse_0x5F417C53__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__int_N_RInvoke; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	int64 _L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__int_N_RInvoke(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_int">();
	}
	static class UDevices_device_function_get_int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_int>();
	}
};

// VerseClass VerseDevices.Devices_creative_object
// 0x0070 (0x0130 - 0x00C0)
#pragma pack(push, 0x1)
class alignas(0x10) UDevices_creative_object : public UVerseCreativeObject
{
public:
	FVerseFunctionProperty_                       __verse_0x5139375F__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0A483613__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x49B5636B__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RSetTeam_L_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_20255_7d_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x873CD458__L_2fFortnite_2ecom_2fDevices_2fcreative__object__interface_N_RGetPlayspaceEpicInternal; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fFortnite_2ecom_2fDevices_2fcreative__object__interface_N_RGetPlayspaceEpicInternal(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RSetTeam_L_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_20255_7d_R(int64 __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument, TOptional<EVerseTrue> _ExprResultStack_0, FVerseFunctionProperty_ _Callee_1, const struct FTuple_Lcreative__object_Mtuple_L_R_Mtransform_R& _ExprResult_2, const struct VerseDevices_0::FTuple_L_R& _ExprResult_3, TOptional<EVerseTrue> _ExprResultStack_4, FVerseFunctionProperty_ _Callee_5, const struct FTuple_Lcreative__object_Mtuple_L_R_Mtransform_R& _ExprResult_6, const struct VerseDevices_0::FTuple_L_R& _ExprResult_7);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct VerseDevices_0::FTuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument, TOptional<EVerseTrue> _ExprResultStack_0, FVerseFunctionProperty_ _Callee_1, const struct FTuple_Lcreative__object_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R& _ExprResult_2, const struct VerseDevices_0::FTuple_L_R& _ExprResult_3, const struct VerseDevices_0::FTuple_Lvector3_Mrotation_R& _ExprResult_4, TOptional<EVerseTrue> _ExprResultStack_5, FVerseFunctionProperty_ _Callee_6, const struct FTuple_Lcreative__object_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R& _ExprResult_7, const struct VerseDevices_0::FTuple_L_R& _ExprResult_8, const struct VerseDevices_0::FTuple_Lvector3_Mrotation_R& _ExprResult_9);
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument, FVerseFunctionProperty_ _Callee_0, const struct FTuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R& _ExprResult_1, const struct VerseDevices_0::FTuple_L_R& _ExprResult_2, const struct VerseDevices_0::FTuple_L_R& _ExprResult_3, FVerseFunctionProperty_ _Callee_4, const struct FTuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R& _ExprResult_5, const struct VerseDevices_0::FTuple_L_R& _ExprResult_6, const struct VerseDevices_0::FTuple_L_R& _ExprResult_7);
	class UConcurrency_task* MoveTo_L_Ntransform_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Ltransform_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_object">();
	}
	static class UDevices_creative_object* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_object>();
	}
};
#pragma pack(pop)

// VerseClass VerseDevices.Devices_creative_prop
// 0x0080 (0x01B0 - 0x0130)
class UDevices_creative_prop final  : public UDevices_creative_object
{
public:
	FVerseFunctionProperty_                       __verse_0xB6F57275__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsDisposed; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC4FF6975__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7DCCC181__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_M_N_QIndex_Nint_20_3d_20_2e_2e_2e_R; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6E31A773__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow; // 0x0158(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x60EB84F3__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide; // 0x0168(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x909F40CD__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden; // 0x0178(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E6B9248__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid; // 0x0188(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5201150D__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose; // 0x0198(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_9696[0x8];                                     // 0x01A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsDisposed(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_M_N_QIndex_Nint_20_3d_20_2e_2e_2e_R(const struct FTuple_Lmaterial_M_QIndex_Nint_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R(class UAssets_mesh* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop">();
	}
	static class UDevices_creative_prop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop>();
	}
};

// VerseClass VerseDevices.Devices_creative_device_base
// 0x0020 (0x0150 - 0x0130)
class UDevices_creative_device_base final  : public UDevices_creative_object
{
public:
	FVerseFunctionProperty_                       __verse_0x0182371F__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E46A055__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_9697[0x8];                                     // 0x0148(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device_base">();
	}
	static class UDevices_creative_device_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device_base>();
	}
};

// VerseClass VerseDevices.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseDevices_0::U_SolarisSignatureFunctionOuter final  : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseDevices.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseDevices_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseDevices_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseDevices.Devices_CreativeAnimation_animation_controller_debug_log
// 0x0000 (0x0028 - 0x0028)
class UDevices_CreativeAnimation_animation_controller_debug_log final  : public UDiagnostics_log_channel
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation_animation_controller_debug_log">();
	}
	static class UDevices_CreativeAnimation_animation_controller_debug_log* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation_animation_controller_debug_log>();
	}
};

// VerseClass VerseDevices.Devices_device_function_get_logic
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_get_logic final  : public UDevices_device_function_get_base
{
public:
	FVerseFunctionProperty_                       __verse_0x546054FC__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__logic_N_RInvoke; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__logic_N_RInvoke(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_logic">();
	}
	static class UDevices_device_function_get_logic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_logic>();
	}
};

// VerseClass VerseDevices.Devices
// 0x0008 (0x0030 - 0x0028)
class UDevices final  : public UObject
{
public:
	class UDevices_creative_prop_asset*           __verse_0x88F30926_DefaultCreativePropAsset;       // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* _L_2fFortnite_2ecom_2fDevices_N_Rdevice__event(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument, FVerseFunctionProperty_ _Callee_0, FVerseFunctionProperty_ _Callee_1);
	static class UClass* _L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);
	static TArray<class UObject*> _L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	static TArray<class UObject*> _L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTags_L_Ntag__search__criteria_R(class UTags_tag_search_criteria* __verse_0xB2CDDD72_Argument);
	static EDevices_move_to_result _L_2fFortnite_2ecom_2fDevices_N_RHandleMoveToInternalResult_L_Nmove__to__internal__result_R(EDevices_move_to_internal_result __verse_0xB2CDDD72_Argument, FVerseDynamicProperty_ InvokeResultDummy_0, TOptional<FVerseDynamicProperty_> _ExprResultStack_1, FVerseDynamicProperty_ _ExprResult_2, FVerseDynamicProperty_ _ExprResult_3, FVerseDynamicProperty_ InvokeResultDummy_4, TOptional<FVerseDynamicProperty_> _ExprResultStack_5, FVerseDynamicProperty_ _ExprResult_6, FVerseDynamicProperty_ _ExprResult_7, class UDiagnostics_log* __verse_0x63A8D5FA_DebugLog_3, uint64 _InstancingGraph_8, class UDiagnostics_log* __verse_0x00000000__4, EVerseTrue _InvokeSureResultDummy_9, FVerseFunctionProperty_ _Callee_10, const struct VerseDevices_0::FTuple_L_Kchar_M_QLevel_Nlog__level_R& _ExprResult_11, FVerseStringProperty_ _ExprResult_12, const TArray<FVerseDynamicProperty_>& __verse_0xFFC68BC5_Array_5, FVerseFunctionProperty_ _Callee_13, const TArray<TArray<FVerseDynamicProperty_>>& _ExprResult_14, const TArray<FVerseStringProperty_>& __verse_0xFFC68BC5_Array_6, const struct VerseDevices_0::FTuple_L_Kchar_M_Kchar_R& __verse_0x00000000__7, FVerseStringProperty_ _ExprResult_15, FVerseStringProperty_ _ExprResultStack_16, FVerseFunctionProperty_ _Callee_17, FVerseStringProperty_ _ExprResultDummy_18, FVerseStringProperty_ _ExprResultDummy_19, const TArray<TArray<FVerseDynamicProperty_>>& _ForResult_20, int64 _ForIndex_21, int64 _ForLength_22, FVerseStringProperty_ __verse_0xFB88B569_Item_9, const TArray<FVerseDynamicProperty_>& _ExprResult_23, FVerseStringProperty_ __verse_0xFFC68BC5_Array_10, const TArray<FVerseDynamicProperty_>& _ForResult_24, int64 _ForIndex_25, int64 _ForLength_26, uint8 __verse_0xFB88B569_Item_12, FVerseDynamicProperty_ _ExprResult_27, FVerseStringProperty_ _ForResult_28, int64 _ForIndex_29, int64 _ForLength_30, FVerseDynamicProperty_ __verse_0xFB88B569_Item_14, uint8 _ExprResult_31, TOptional<EDiagnostics_log_level> _ExprResult_32, FVerseDynamicProperty_ InvokeResultDummy_33, TOptional<FVerseDynamicProperty_> _ExprResultStack_34, FVerseDynamicProperty_ _ExprResult_35, FVerseDynamicProperty_ _ExprResult_36, FVerseDynamicProperty_ InvokeResultDummy_37, TOptional<FVerseDynamicProperty_> _ExprResultStack_38, FVerseDynamicProperty_ _ExprResult_39, FVerseDynamicProperty_ _ExprResult_40, class UDiagnostics_log* __verse_0x63A8D5FA_DebugLog_17, uint64 _InstancingGraph_41, class UDiagnostics_log* __verse_0x00000000__18, EVerseTrue _InvokeSureResultDummy_42, FVerseFunctionProperty_ _Callee_43, const struct VerseDevices_0::FTuple_L_Kchar_M_QLevel_Nlog__level_R& _ExprResult_44, FVerseStringProperty_ _ExprResult_45, const TArray<FVerseDynamicProperty_>& __verse_0xFFC68BC5_Array_19, FVerseFunctionProperty_ _Callee_46, const TArray<TArray<FVerseDynamicProperty_>>& _ExprResult_47, const TArray<FVerseStringProperty_>& __verse_0xFFC68BC5_Array_20, const struct VerseDevices_0::FTuple_L_Kchar_M_Kchar_R& __verse_0x00000000__21, FVerseStringProperty_ _ExprResult_48, FVerseStringProperty_ _ExprResultStack_49, FVerseFunctionProperty_ _Callee_50, FVerseStringProperty_ _ExprResultDummy_51, FVerseStringProperty_ _ExprResultDummy_52, const TArray<TArray<FVerseDynamicProperty_>>& _ForResult_53, int64 _ForIndex_54, int64 _ForLength_55, FVerseStringProperty_ __verse_0xFB88B569_Item_23, const TArray<FVerseDynamicProperty_>& _ExprResult_56, FVerseStringProperty_ __verse_0xFFC68BC5_Array_24, const TArray<FVerseDynamicProperty_>& _ForResult_57, int64 _ForIndex_58, int64 _ForLength_59, uint8 __verse_0xFB88B569_Item_26, FVerseDynamicProperty_ _ExprResult_60, FVerseStringProperty_ _ForResult_61, int64 _ForIndex_62, int64 _ForLength_63, FVerseDynamicProperty_ __verse_0xFB88B569_Item_28, uint8 _ExprResult_64, TOptional<EDiagnostics_log_level> _ExprResult_65);
	static TOptional<class Entity_0::UEntity*, true> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetEntity_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetPlayspace_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTags_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FSpatialMath_transform _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTransformInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R(const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& __verse_0xB2CDDD72_Argument, EVerseTrue _ExprResult_0, EGame_teleport_to_result __verse_0x95D09D0E_Result_1, FVerseFunctionProperty_ _Callee_1, const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& _ExprResult_2, const struct VerseDevices_0::FTuple_L_R& _ExprResult_3, TOptional<EVerseTrue> _ExprResultStack_4, FVerseFunctionProperty_ _Callee_5, const struct VerseDevices_0::FTuple_Lteleport__to__result_Mtransform_R& _ExprResult_6, EVerseTrue _ExprResult_7, EGame_teleport_to_result __verse_0x95D09D0E_Result_2, FVerseFunctionProperty_ _Callee_8, const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& _ExprResult_9, const struct VerseDevices_0::FTuple_L_R& _ExprResult_10, TOptional<EVerseTrue> _ExprResultStack_11, FVerseFunctionProperty_ _Callee_12, const struct VerseDevices_0::FTuple_Lteleport__to__result_Mtransform_R& _ExprResult_13);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_R_R(const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R& __verse_0xB2CDDD72_Argument, EVerseTrue _ExprResult_0, const struct FSpatialMath_transform& __verse_0x61C3007D_Transform_1, FVerseFunctionProperty_ _Callee_1, const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R& _ExprResult_2, const struct VerseDevices_0::FTuple_L_R& _ExprResult_3, const struct VerseDevices_0::FTuple_L_R& _ExprResult_4, const struct FSpatialMath_vector3& _AssignmentScratch_5, const struct FVerseRotation& _AssignmentScratch_6, EGame_teleport_to_result __verse_0x95D09D0E_Result_1, FVerseFunctionProperty_ _Callee_7, const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& _ExprResult_8, const struct VerseDevices_0::FTuple_L_R& _ExprResult_9, TOptional<EVerseTrue> _ExprResultStack_10, FVerseFunctionProperty_ _Callee_11, const struct VerseDevices_0::FTuple_Lteleport__to__result_Mtransform_R& _ExprResult_12, EVerseTrue _ExprResult_13, const struct FSpatialMath_transform& __verse_0x61C3007D_Transform_2, FVerseFunctionProperty_ _Callee_14, const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R& _ExprResult_15, const struct VerseDevices_0::FTuple_L_R& _ExprResult_16, const struct VerseDevices_0::FTuple_L_R& _ExprResult_17, const struct FSpatialMath_vector3& _AssignmentScratch_18, const struct FVerseRotation& _AssignmentScratch_19, EGame_teleport_to_result __verse_0x95D09D0E_Result_2, FVerseFunctionProperty_ _Callee_20, const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& _ExprResult_21, const struct VerseDevices_0::FTuple_L_R& _ExprResult_22, TOptional<EVerseTrue> _ExprResultStack_23, FVerseFunctionProperty_ _Callee_24, const struct VerseDevices_0::FTuple_Lteleport__to__result_Mtransform_R& _ExprResult_25);
	static EGame_teleport_to_result _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R(const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& __verse_0xB2CDDD72_Argument);
	static struct FTuple_L_Qcreative__prop_Mspawn__prop__result_R _L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Ntransform_R(const struct FTuple_Lcreative__prop__asset_Mtransform_R& __verse_0xB2CDDD72_Argument);
	static struct FTuple_L_Qcreative__prop_Mspawn__prop__result_R _L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Nvector3_M_Nrotation_R(const struct FTuple_Lcreative__prop__asset_Mvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	static FVerseStringProperty_ _L_2fFortnite_2ecom_2fDevices_N_RToString_L_Nmove__to__internal__result_R(EDevices_move_to_internal_result __verse_0xB2CDDD72_Argument, EDevices_move_to_internal_result __verse_0x00000000__1, FVerseDynamicProperty_ InvokeResultDummy_0, TOptional<FVerseDynamicProperty_> _ExprResultStack_1, FVerseDynamicProperty_ _ExprResult_2, FVerseDynamicProperty_ _ExprResult_3, FVerseDynamicProperty_ InvokeResultDummy_4, TOptional<FVerseDynamicProperty_> _ExprResultStack_5, FVerseDynamicProperty_ _ExprResult_6, FVerseDynamicProperty_ _ExprResult_7, FVerseDynamicProperty_ InvokeResultDummy_8, TOptional<FVerseDynamicProperty_> _ExprResultStack_9, FVerseDynamicProperty_ _ExprResult_10, FVerseDynamicProperty_ _ExprResult_11, FVerseDynamicProperty_ InvokeResultDummy_12, TOptional<FVerseDynamicProperty_> _ExprResultStack_13, FVerseDynamicProperty_ _ExprResult_14, FVerseDynamicProperty_ _ExprResult_15, FVerseDynamicProperty_ InvokeResultDummy_16, TOptional<FVerseDynamicProperty_> _ExprResultStack_17, FVerseDynamicProperty_ _ExprResult_18, FVerseDynamicProperty_ _ExprResult_19, FVerseDynamicProperty_ InvokeResultDummy_20, TOptional<FVerseDynamicProperty_> _ExprResultStack_21, FVerseDynamicProperty_ _ExprResult_22, FVerseDynamicProperty_ _ExprResult_23, FVerseDynamicProperty_ InvokeResultDummy_24, TOptional<FVerseDynamicProperty_> _ExprResultStack_25, FVerseDynamicProperty_ _ExprResult_26, FVerseDynamicProperty_ _ExprResult_27, EDevices_move_to_internal_result __verse_0x00000000__10, FVerseDynamicProperty_ InvokeResultDummy_28, TOptional<FVerseDynamicProperty_> _ExprResultStack_29, FVerseDynamicProperty_ _ExprResult_30, FVerseDynamicProperty_ _ExprResult_31, FVerseDynamicProperty_ InvokeResultDummy_32, TOptional<FVerseDynamicProperty_> _ExprResultStack_33, FVerseDynamicProperty_ _ExprResult_34, FVerseDynamicProperty_ _ExprResult_35, FVerseDynamicProperty_ InvokeResultDummy_36, TOptional<FVerseDynamicProperty_> _ExprResultStack_37, FVerseDynamicProperty_ _ExprResult_38, FVerseDynamicProperty_ _ExprResult_39, FVerseDynamicProperty_ InvokeResultDummy_40, TOptional<FVerseDynamicProperty_> _ExprResultStack_41, FVerseDynamicProperty_ _ExprResult_42, FVerseDynamicProperty_ _ExprResult_43, FVerseDynamicProperty_ InvokeResultDummy_44, TOptional<FVerseDynamicProperty_> _ExprResultStack_45, FVerseDynamicProperty_ _ExprResult_46, FVerseDynamicProperty_ _ExprResult_47, FVerseDynamicProperty_ InvokeResultDummy_48, TOptional<FVerseDynamicProperty_> _ExprResultStack_49, FVerseDynamicProperty_ _ExprResult_50, FVerseDynamicProperty_ _ExprResult_51, FVerseDynamicProperty_ InvokeResultDummy_52, TOptional<FVerseDynamicProperty_> _ExprResultStack_53, FVerseDynamicProperty_ _ExprResult_54, FVerseDynamicProperty_ _ExprResult_55);
	static struct FDevices_device_ai_interaction_result Devices_device_ai_interaction_result_Factory();
	static struct FDevices_device_ai_interaction_result Devices_device_ai_interaction_result_OverrideFactory(TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static class UConcurrency_task* Operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R& __verse_0xB2CDDD72_Argument);
	static class UConcurrency_task* Operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_Mfloat_R_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R& __verse_0xB2CDDD72_Argument);
	static class UConcurrency_task* Operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO(class UDevices_creative_prop_asset* _ExprResult_0, uint64 _InstancingGraph_1, class UDevices_creative_prop_asset* _ExprResult_2, uint64 _InstancingGraph_3);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices">();
	}
	static class UDevices* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices>();
	}
};

// VerseClass VerseDevices.Devices_device_event
// 0x0060 (0x0088 - 0x0028)
class UDevices_device_event : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0xD8DCC5F0__L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8DE7DBE5_Await;                          // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x21011A72_EventName;                      // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_96B9[0x30];                                    // 0x0058(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event">();
	}
	static class UDevices_device_event* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event>();
	}
};

// VerseClass VerseDevices.Devices_device_event_vehicle
// 0x0000 (0x0088 - 0x0088)
class UDevices_device_event_vehicle final  : public UDevices_device_event
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event_vehicle">();
	}
	static class UDevices_device_event_vehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event_vehicle>();
	}
};

// VerseClass VerseDevices.Devices_creative_device
// 0x00B8 (0x0170 - 0x00B8)
class alignas(0x10) UDevices_creative_device final  : public UVerseCreativeDevice
{
public:
	FVerseFunctionProperty_                       __verse_0x1F792AAA_OnBegin;                        // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3DFFEDE4__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0AA415A9__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x826ED8B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x592F1135__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x57F532B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x873CD458__L_2fFortnite_2ecom_2fDevices_2fcreative__object__interface_N_RGetPlayspaceEpicInternal; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_96BB[0x8];                                     // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UObject*, true>               __verse_0x0B6F4FC4_PlayspaceEpicInternal;          // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_96BC[0x8];                                     // 0x0168(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO(TOptional<class UObject*, true> _ExprResult_0, TOptional<EVerseFalse> __verse_0x00000000__1, uint8 _ExprResult_1, TOptional<EVerseFalse> _ExprResultStack_2, TOptional<class UObject*, true> _ExprResult_3, TOptional<EVerseFalse> __verse_0x00000000__3, uint8 _ExprResult_4, TOptional<EVerseFalse> _ExprResultStack_5);
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument, TOptional<EVerseTrue> _ExprResultStack_0, FVerseFunctionProperty_ _Callee_1, const struct FTuple_Lcreative__device_Mtuple_L_R_Mtransform_R& _ExprResult_2, const struct VerseDevices_0::FTuple_L_R& _ExprResult_3, TOptional<EVerseTrue> _ExprResultStack_4, FVerseFunctionProperty_ _Callee_5, const struct FTuple_Lcreative__device_Mtuple_L_R_Mtransform_R& _ExprResult_6, const struct VerseDevices_0::FTuple_L_R& _ExprResult_7);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct VerseDevices_0::FTuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument, TOptional<EVerseTrue> _ExprResultStack_0, FVerseFunctionProperty_ _Callee_1, const struct FTuple_Lcreative__device_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R& _ExprResult_2, const struct VerseDevices_0::FTuple_L_R& _ExprResult_3, const struct VerseDevices_0::FTuple_Lvector3_Mrotation_R& _ExprResult_4, TOptional<EVerseTrue> _ExprResultStack_5, FVerseFunctionProperty_ _Callee_6, const struct FTuple_Lcreative__device_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R& _ExprResult_7, const struct VerseDevices_0::FTuple_L_R& _ExprResult_8, const struct VerseDevices_0::FTuple_Lvector3_Mrotation_R& _ExprResult_9);
	class UObject* _L_2fFortnite_2ecom_2fDevices_2fcreative__object__interface_N_RGetPlayspaceEpicInternal(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument, FVerseFunctionProperty_ _Callee_0, const struct FTuple_Lcreative__device_Mtuple_L_R_Mtuple_L_R_R& _ExprResult_1, const struct VerseDevices_0::FTuple_L_R& _ExprResult_2, const struct VerseDevices_0::FTuple_L_R& _ExprResult_3, FVerseFunctionProperty_ _Callee_4, const struct FTuple_Lcreative__device_Mtuple_L_R_Mtuple_L_R_R& _ExprResult_5, const struct VerseDevices_0::FTuple_L_R& _ExprResult_6, const struct VerseDevices_0::FTuple_L_R& _ExprResult_7);
	class UConcurrency_task* MoveTo_L_Ntransform_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Ltransform_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FTuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device">();
	}
	static class UDevices_creative_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device>();
	}
};

// VerseClass VerseDevices.Devices_creative_device_asset
// 0x0000 (0x00C8 - 0x00C8)
class UDevices_creative_device_asset final  : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device_asset">();
	}
	static class UDevices_creative_device_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device_asset>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_base
// 0x0010 (0x0038 - 0x0028)
class UDevices_device_function_set_base : public UObject
{
public:
	FVerseStringProperty_                         __verse_0xF8B4D924_FunctionName;                   // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_base">();
	}
	static class UDevices_device_function_set_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_base>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_multi_parameter_base
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_multi_parameter_base : public UDevices_device_function_set_base
{
public:
	TOptional<class UClass*>                      __verse_0xBF5FC553_ReturnType;                     // 0x0038(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO(TOptional<class UClass*> _ExprResult_0, TOptional<EVerseFalse> __verse_0x00000000__1, uint8 _ExprResult_1, TOptional<EVerseFalse> _ExprResultStack_2, TOptional<class UClass*> _ExprResult_3, TOptional<EVerseFalse> __verse_0x00000000__3, uint8 _ExprResult_4, TOptional<EVerseFalse> _ExprResultStack_5);
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_multi_parameter_base">();
	}
	static class UDevices_device_function_set_multi_parameter_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_multi_parameter_base>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_params_by_name
// 0x0060 (0x00A8 - 0x0048)
class UDevices_device_function_set_params_by_name : public UDevices_device_function_set_multi_parameter_base
{
public:
	FVerseFunctionProperty_                       __verse_0xD67AF8BF__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name_N_RInvoke_L_N_5b_Kchar_5dfunction__parameter__base_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UClass*>    __verse_0x8F623C81_ParameterTypes;                 // 0x0058(0x0050)(InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UDevices_function_parameter_base*, true> _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name_N_RInvoke_L_N_5b_Kchar_5dfunction__parameter__base_R(const TMap<FVerseStringProperty_, class UDevices_function_parameter_base*>& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_params_by_name">();
	}
	static class UDevices_device_function_set_params_by_name* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_params_by_name>();
	}
};

// VerseClass VerseDevices.Devices_function_parameter_base
// 0x0000 (0x0028 - 0x0028)
class UDevices_function_parameter_base : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_base">();
	}
	static class UDevices_function_parameter_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_base>();
	}
};

// VerseClass VerseDevices.Devices_function_parameter_int
// 0x0008 (0x0030 - 0x0028)
class UDevices_function_parameter_int final  : public UDevices_function_parameter_base
{
public:
	int64                                         __verse_0x31A8F10C_Value;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_int">();
	}
	static class UDevices_function_parameter_int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_int>();
	}
};

// VerseClass VerseDevices.Devices_creative_object_interface
// 0x0000 (0x0028 - 0x0028)
class UDevices_creative_object_interface final  : public UObject
{
public:
	class UObject* _L_2fFortnite_2ecom_2fDevices_2fcreative__object__interface_N_RGetPlayspaceEpicInternal(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_object_interface">();
	}
	static class UDevices_creative_object_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_object_interface>();
	}
};

// VerseClass VerseDevices.Devices_creative_prop_asset
// 0x0000 (0x0090 - 0x0090)
class UDevices_creative_prop_asset final  : public UVerseCreativePropAsset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop_asset">();
	}
	static class UDevices_creative_prop_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop_asset>();
	}
};

// VerseClass VerseDevices.task_Devices_creative_device$MoveTo_L_Ntransform_M_Nfloat_R
// 0x02D0 (0x0420 - 0x0150)
class UTask_Devices_creative_device_MoveTo_L_Ntransform_M_Nfloat_R final  : public UConcurrency_task
{
public:
	class UDevices_creative_device*               _Self;                                             // 0x0150(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96D0[0x8];                                     // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTuple_Ltransform_Mfloat_R             __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0070)(Parm, HasGetValueTypeHash)
	EDevices_move_to_result                       _RetVal;                                           // 0x01D0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96D1[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x01E0(0x0010)(HasGetValueTypeHash)
	struct FTuple_Lcreative__device_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R _ExprResult_2;                                     // 0x01F0(0x0080)(HasGetValueTypeHash)
	struct VerseDevices_0::FTuple_L_R             _ExprResult_3;                                     // 0x0270(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_96D2[0xF];                                     // 0x0271(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTuple_Ltransform_Mfloat_R             _ExprResult_4;                                     // 0x0280(0x0070)(HasGetValueTypeHash)
	int64                                         _AsyncResult_5;                                    // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_6;                                      // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_7;                                 // 0x0300(0x0010)(HasGetValueTypeHash)
	struct FTuple_Lcreative__device_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R _ExprResult_8;                                     // 0x0310(0x0080)(HasGetValueTypeHash)
	struct VerseDevices_0::FTuple_L_R             _ExprResult_9;                                     // 0x0390(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_96D3[0xF];                                     // 0x0391(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTuple_Ltransform_Mfloat_R             _ExprResult_10;                                    // 0x03A0(0x0070)(HasGetValueTypeHash)
	int64                                         _AsyncResult_11;                                   // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Devices_creative_device$MoveTo_L_Ntransform_M_Nfloat_R">();
	}
	static class UTask_Devices_creative_device_MoveTo_L_Ntransform_M_Nfloat_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTask_Devices_creative_device_MoveTo_L_Ntransform_M_Nfloat_R>();
	}
};

// VerseClass VerseDevices.Devices_creative_prop_debug_log
// 0x0000 (0x0028 - 0x0028)
class UDevices_creative_prop_debug_log final  : public UDiagnostics_log_channel
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop_debug_log">();
	}
	static class UDevices_creative_prop_debug_log* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop_debug_log>();
	}
};

// VerseClass VerseDevices.Devices_CreativeAnimation
// 0x0000 (0x0028 - 0x0028)
class UDevices_CreativeAnimation final  : public UObject
{
public:
	static struct FTuple_L_Qanimation__controller_Mget__animation__controller__result_R _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_RGetAnimationController_L_Ncreative__movable__object__base_R(class UVerseMovableObjectBase* __verse_0xB2CDDD72_Argument);
	static TOptional<class UDevices_CreativeAnimation_animation_controller*, true> _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_Roperator_U_2eGetAnimationController_U_L_Ncreative__prop_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct FTuple_Lcreative__prop_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument, EVerseFalse _ExprResult_0, const struct FTuple_L_Qanimation__controller_Mget__animation__controller__result_R& __verse_0x95D09D0E_Result_1, FVerseFunctionProperty_ _Callee_1, class UDiagnostics_log* __verse_0x63A8D5FA_DebugLog_1, uint64 _InstancingGraph_2, FVerseDynamicProperty_ InvokeResultDummy_3, TOptional<FVerseDynamicProperty_> _ExprResultStack_4, FVerseDynamicProperty_ _ExprResult_5, FVerseDynamicProperty_ _ExprResult_6, class UDiagnostics_log* __verse_0x00000000__3, EVerseTrue _InvokeSureResultDummy_7, FVerseFunctionProperty_ _Callee_8, const struct VerseDevices_0::FTuple_L_Kchar_M_QLevel_Nlog__level_R& _ExprResult_9, FVerseStringProperty_ _ExprResult_10, TOptional<EDiagnostics_log_level> _ExprResult_11, FVerseDynamicProperty_ InvokeResultDummy_12, TOptional<FVerseDynamicProperty_> _ExprResultStack_13, FVerseDynamicProperty_ _ExprResult_14, FVerseDynamicProperty_ _ExprResult_15, class UDiagnostics_log* __verse_0x00000000__5, EVerseTrue _InvokeSureResultDummy_16, FVerseFunctionProperty_ _Callee_17, const struct VerseDevices_0::FTuple_L_Kchar_M_QLevel_Nlog__level_R& _ExprResult_18, FVerseStringProperty_ _ExprResult_19, TOptional<EDiagnostics_log_level> _ExprResult_20, TOptional<class UDevices_CreativeAnimation_animation_controller*, true> _ExprResultStack_21, EVerseFalse _ExprResult_22, const struct FTuple_L_Qanimation__controller_Mget__animation__controller__result_R& __verse_0x95D09D0E_Result_6, FVerseFunctionProperty_ _Callee_23, class UDiagnostics_log* __verse_0x63A8D5FA_DebugLog_6, uint64 _InstancingGraph_24, FVerseDynamicProperty_ InvokeResultDummy_25, TOptional<FVerseDynamicProperty_> _ExprResultStack_26, FVerseDynamicProperty_ _ExprResult_27, FVerseDynamicProperty_ _ExprResult_28, class UDiagnostics_log* __verse_0x00000000__8, EVerseTrue _InvokeSureResultDummy_29, FVerseFunctionProperty_ _Callee_30, const struct VerseDevices_0::FTuple_L_Kchar_M_QLevel_Nlog__level_R& _ExprResult_31, FVerseStringProperty_ _ExprResult_32, TOptional<EDiagnostics_log_level> _ExprResult_33, FVerseDynamicProperty_ InvokeResultDummy_34, TOptional<FVerseDynamicProperty_> _ExprResultStack_35, FVerseDynamicProperty_ _ExprResult_36, FVerseDynamicProperty_ _ExprResult_37, class UDiagnostics_log* __verse_0x00000000__10, EVerseTrue _InvokeSureResultDummy_38, FVerseFunctionProperty_ _Callee_39, const struct VerseDevices_0::FTuple_L_Kchar_M_QLevel_Nlog__level_R& _ExprResult_40, FVerseStringProperty_ _ExprResult_41, TOptional<EDiagnostics_log_level> _ExprResult_42, TOptional<class UDevices_CreativeAnimation_animation_controller*, true> _ExprResultStack_43);
	static struct FDevices_CreativeAnimation_cubic_bezier_parameters Devices_CreativeAnimation_cubic_bezier_parameters_Factory();
	static struct FDevices_CreativeAnimation_cubic_bezier_parameters Devices_CreativeAnimation_cubic_bezier_parameters_OverrideFactory(TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap, FVerseStringProperty_ _ExprResultStack_0, TOptional<uint8> _ExprResult_1, FVerseStringProperty_ _ExprResultStack_2, TOptional<uint8> _ExprResult_3, FVerseStringProperty_ _ExprResultStack_4, TOptional<uint8> _ExprResult_5, FVerseStringProperty_ _ExprResultStack_6, TOptional<uint8> _ExprResult_7, FVerseStringProperty_ _ExprResultStack_8, TOptional<uint8> _ExprResult_9, FVerseStringProperty_ _ExprResultStack_10, TOptional<uint8> _ExprResult_11, FVerseStringProperty_ _ExprResultStack_12, TOptional<uint8> _ExprResult_13, FVerseStringProperty_ _ExprResultStack_14, TOptional<uint8> _ExprResult_15);
	static struct FDevices_CreativeAnimation_keyframe_delta Devices_CreativeAnimation_keyframe_delta_Factory(const struct FSpatialMath_vector3& _ExprResult_0, const TMap<FVerseStringProperty_, uint8>& _ExprResultStack_1, FVerseStringProperty_ _ExprResult_2, FVerseStringProperty_ _ExprResult_3, FVerseStringProperty_ _ExprResult_4, const struct FSpatialMath_vector3& _ExprResult_5, const TMap<FVerseStringProperty_, uint8>& _ExprResultStack_6, FVerseStringProperty_ _ExprResult_7, FVerseStringProperty_ _ExprResult_8, FVerseStringProperty_ _ExprResult_9);
	static struct FDevices_CreativeAnimation_keyframe_delta Devices_CreativeAnimation_keyframe_delta_OverrideFactory(TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap, FVerseStringProperty_ _ExprResultStack_0, TOptional<uint8> _ExprResult_1, const struct FSpatialMath_vector3& _ExprResult_2, const TMap<FVerseStringProperty_, uint8>& _ExprResultStack_3, FVerseStringProperty_ _ExprResult_4, FVerseStringProperty_ _ExprResult_5, FVerseStringProperty_ _ExprResult_6, FVerseStringProperty_ _ExprResultStack_7, TOptional<uint8> _ExprResult_8, FVerseStringProperty_ _ExprResultStack_9, TOptional<uint8> _ExprResult_10, const struct FSpatialMath_vector3& _ExprResult_11, const TMap<FVerseStringProperty_, uint8>& _ExprResultStack_12, FVerseStringProperty_ _ExprResult_13, FVerseStringProperty_ _ExprResult_14, FVerseStringProperty_ _ExprResult_15, FVerseStringProperty_ _ExprResultStack_16, TOptional<uint8> _ExprResult_17);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation">();
	}
	static class UDevices_CreativeAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_int
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_int final  : public UDevices_device_function_set_base
{
public:
	FVerseFunctionProperty_                       __verse_0x53CE1022__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__int_N_RInvoke_L_Nint_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__int_N_RInvoke_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_int">();
	}
	static class UDevices_device_function_set_int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_int>();
	}
};

// VerseClass VerseDevices.Devices_CreativeAnimation_animation_controller
// 0x0140 (0x0168 - 0x0028)
class UDevices_CreativeAnimation_animation_controller final  : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x0E85E6FA__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x053E8BA6_AwaitNextKeyframe;              // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5D81E59F__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlayInternal; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B727DF3__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlay; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1A1EC93E__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPauseInternal; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E385FBF__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPause; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDF78CD56__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStopInternal; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x230023B8__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStop; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4A2A0F34__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDCA25E7B__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xECB7EA34__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimationInternal_L_N_Kkeyframe__delta_M_N_QAnimationMode_Nanimation__mode_20_3d_20_2e_2e_2e_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x30521B48__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RToString_L_Nset__animation__result_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8C3C09A2__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimation_L_N_Kkeyframe__delta_M_N_QMode_Nanimation__mode_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog;                       // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x1A3A2D49_KeyframeReachedEvent;           // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xEC8DE8C6_MovementCompleteEvent;          // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xDE60FD58_StateChangedEvent;              // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_96E8[0x50];                                    // 0x0118(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO(class UDiagnostics_log* _ExprResult_0, uint64 _InstancingGraph_1, class UVerseEngine_subscribable_event* _ExprResult_2, uint64 _InstancingGraph_3, class UVerseEngine_subscribable_event* _ExprResult_4, uint64 _InstancingGraph_5, class UVerseEngine_subscribable_event* _ExprResult_6, uint64 _InstancingGraph_7, class UDiagnostics_log* _ExprResult_8, uint64 _InstancingGraph_9, class UVerseEngine_subscribable_event* _ExprResult_10, uint64 _InstancingGraph_11, class UVerseEngine_subscribable_event* _ExprResult_12, uint64 _InstancingGraph_13, class UVerseEngine_subscribable_event* _ExprResult_14, uint64 _InstancingGraph_15);
	void _InitInstance();
	EDevices_CreativeAnimation_animation_controller_state _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid(const struct VerseDevices_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
