#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQuery_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "Entity_0_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseGameplayTags_structs.hpp"


namespace SDK
{

// VerseClass VerseQuery.collision_override
// 0x0000 (0x0028 - 0x0028)
class UCollision_override : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"collision_override">();
	}
	static class UCollision_override* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollision_override>();
	}
};

// VerseClass VerseQuery.no_collision_override
// 0x0000 (0x0028 - 0x0028)
class UNo_collision_override final  : public UCollision_override
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"no_collision_override">();
	}
	static class UNo_collision_override* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNo_collision_override>();
	}
};

// VerseClass VerseQuery._Root
// 0x0000 (0x0028 - 0x0028)
class VerseQuery_0::U_Root final  : public UObject
{
public:
	static TArray<class UComponent*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindComponents_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct FTuple_Lentity_Mtuple_L_R_Mcomponent_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntities_U_L_Nentity_M_Ntuple_L_R_M_NEntityType_20where_20EntityType_R(const struct FTuple_Lentity_Mtuple_L_R_Mentity_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R(const struct FTuple_Lentity_Mtuple_L_R_Mconvex__hull3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesOriginInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R(const struct FTuple_Lentity_Mtuple_L_R_Mconvex__hull3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesOverlapping_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R(const struct FTuple_Lentity_Mtuple_L_R_Mconvex__hull3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesWithComponent_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct FTuple_Lentity_Mtuple_L_R_Mcomponent_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesWithTag_U_L_Nentity_M_Ntuple_L_R_M_Ntag_R(const struct FTuple_Lentity_Mtuple_L_R_Mtag_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UComponent*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentComponents_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct FTuple_Lentity_Mtuple_L_R_Mcomponent_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntities_U_L_Nentity_M_Ntuple_L_R_M_NEntityType_20where_20EntityType_R(const struct FTuple_Lentity_Mtuple_L_R_Mentity_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R(const struct FTuple_Lentity_Mtuple_L_R_Mconvex__hull3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesOriginInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R(const struct FTuple_Lentity_Mtuple_L_R_Mconvex__hull3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesOverlapping_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R(const struct FTuple_Lentity_Mtuple_L_R_Mconvex__hull3_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesWithComponent_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct FTuple_Lentity_Mtuple_L_R_Mcomponent_R& __verse_0xB2CDDD72_Argument);
	static TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesWithTag_U_L_Nentity_M_Ntuple_L_R_M_Ntag_R(const struct FTuple_Lentity_Mtuple_L_R_Mtag_R& __verse_0xB2CDDD72_Argument);
	static struct FOverlap_result Overlap_result_Factory();
	static struct FOverlap_result Overlap_result_OverrideFactory(TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseQuery._Root", true>();
	}
	static class VerseQuery_0::U_Root* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseQuery_0::U_Root>();
	}
};

// VerseClass VerseQuery.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseQuery_0::U_SolarisSignatureFunctionOuter final  : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseQuery.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseQuery_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseQuery_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseQuery.collision_component
// 0x00E0 (0x0240 - 0x0160)
class UCollision_component final  : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x40438E4A__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RGetCollisionOverride; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x238F64FE__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RSetCollisionOverride_L_Ncollision__override_R; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UCollision_override*                    __verse_0xF8DD4357_CollisionOverride;              // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9F9250BD__L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable; // 0x0188(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x20BC70FC__L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable; // 0x0198(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7E7AEB13__L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled; // 0x01A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UObject*                                __verse_0x2BE44E5A_BeginOverlap;                   // 0x01B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xC770952B_EndOverlap;                     // 0x01C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x25242D26_SendOverlapEvents : 1;          // 0x01C8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_BAA0[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCollision_override*                    __verse_0x8B7A1A4B_InternalCollisionOverride;      // 0x01D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_BAA1[0x68];                                    // 0x01D8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO(class UVerseEngine_subscribable_event* _ExprResult_0, uint64 _InstancingGraph_1, class UVerseEngine_subscribable_event* _ExprResult_2, uint64 _InstancingGraph_3, uint8 _ExprResult_4, uint8 _ExprResult_5, class UNo_collision_override* _ExprResult_6, uint64 _InstancingGraph_7, class UVerseEngine_subscribable_event* _ExprResult_8, uint64 _InstancingGraph_9, class UVerseEngine_subscribable_event* _ExprResult_10, uint64 _InstancingGraph_11, uint8 _ExprResult_12, uint8 _ExprResult_13, class UNo_collision_override* _ExprResult_14, uint64 _InstancingGraph_15);
	void _InitInstance();
	class UCollision_override* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RGetCollisionOverride(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RSetCollisionOverride_L_Ncollision__override_R(class UCollision_override* __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"collision_component">();
	}
	static class UCollision_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollision_component>();
	}
};

// VerseClass VerseQuery.shape3
// 0x0010 (0x0038 - 0x0028)
class UShape3 : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x17FC6BF5__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fshape3_N_RDebugDraw; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fshape3_N_RDebugDraw(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"shape3">();
	}
	static class UShape3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShape3>();
	}
};

// VerseClass VerseQuery.volume3
// 0x0000 (0x0038 - 0x0038)
class UVolume3 : public UShape3
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"volume3">();
	}
	static class UVolume3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVolume3>();
	}
};

// VerseClass VerseQuery.convex_hull3
// 0x0010 (0x0048 - 0x0038)
class UConvex_hull3 : public UVolume3
{
public:
	FVerseFunctionProperty_                       __verse_0x45C8E3C5__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fconvex__hull3_N_RContains_L_Nvector3_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fconvex__hull3_N_RContains_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"convex_hull3">();
	}
	static class UConvex_hull3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConvex_hull3>();
	}
};

// VerseClass VerseQuery.axis_aligned_box3
// 0x0030 (0x0078 - 0x0048)
class UAxis_aligned_box3 final  : public UConvex_hull3
{
public:
	struct FSpatialMath_vector3                   __verse_0xD0BE3FBE_Center;                         // 0x0048(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0xA327BDA5_Extent;                         // 0x0060(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO(const struct FSpatialMath_vector3& _ExprResult_0, const TMap<FVerseStringProperty_, uint8>& _ExprResultStack_1, FVerseStringProperty_ _ExprResult_2, FVerseStringProperty_ _ExprResult_3, FVerseStringProperty_ _ExprResult_4, const struct FSpatialMath_vector3& _ExprResult_5, const TMap<FVerseStringProperty_, uint8>& _ExprResultStack_6, FVerseStringProperty_ _ExprResult_7, FVerseStringProperty_ _ExprResult_8, FVerseStringProperty_ _ExprResult_9, const struct FSpatialMath_vector3& _ExprResult_10, const TMap<FVerseStringProperty_, uint8>& _ExprResultStack_11, FVerseStringProperty_ _ExprResult_12, FVerseStringProperty_ _ExprResult_13, FVerseStringProperty_ _ExprResult_14, const struct FSpatialMath_vector3& _ExprResult_15, const TMap<FVerseStringProperty_, uint8>& _ExprResultStack_16, FVerseStringProperty_ _ExprResult_17, FVerseStringProperty_ _ExprResult_18, FVerseStringProperty_ _ExprResult_19);
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fshape3_N_RDebugDraw(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"axis_aligned_box3">();
	}
	static class UAxis_aligned_box3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAxis_aligned_box3>();
	}
};

// VerseClass VerseQuery.component_query_iterator_interface
// 0x0000 (0x0028 - 0x0028)
class UComponent_query_iterator_interface final  : public UObject
{
public:
	TOptional<class UComponent*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"component_query_iterator_interface">();
	}
	static class UComponent_query_iterator_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent_query_iterator_interface>();
	}
};

// VerseClass VerseQuery.entity_query_iterator
// 0x0058 (0x0080 - 0x0028)
class UEntity_query_iterator final  : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x53DE0B78__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_BAA6[0x48];                                    // 0x0038(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class Entity_0::UEntity*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"entity_query_iterator">();
	}
	static class UEntity_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity_query_iterator>();
	}
};

// VerseClass VerseQuery.entity_query_iterator_interface
// 0x0000 (0x0028 - 0x0028)
class UEntity_query_iterator_interface final  : public UObject
{
public:
	TOptional<class Entity_0::UEntity*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"entity_query_iterator_interface">();
	}
	static class UEntity_query_iterator_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity_query_iterator_interface>();
	}
};

// VerseClass VerseQuery.null_component_query_iterator
// 0x0010 (0x0038 - 0x0028)
class UNull_component_query_iterator final  : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x6D54C3C6__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UComponent*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"null_component_query_iterator">();
	}
	static class UNull_component_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNull_component_query_iterator>();
	}
};

// VerseClass VerseQuery.null_entity_query_iterator
// 0x0010 (0x0038 - 0x0028)
class UNull_entity_query_iterator final  : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x53DE0B78__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class Entity_0::UEntity*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"null_entity_query_iterator">();
	}
	static class UNull_entity_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNull_entity_query_iterator>();
	}
};

// VerseClass VerseQuery.playspace_association_component
// 0x0008 (0x0168 - 0x0160)
class UPlayspace_association_component final  : public UComponent
{
public:
	uint8                                         Pad_BAAB[0x8];                                     // 0x0160(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"playspace_association_component">();
	}
	static class UPlayspace_association_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspace_association_component>();
	}
};

// VerseClass VerseQuery.shape2
// 0x0000 (0x0028 - 0x0028)
class UShape2 final  : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"shape2">();
	}
	static class UShape2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShape2>();
	}
};

// VerseClass VerseQuery.slow_component_array_copy_query_iterator
// 0x0028 (0x0050 - 0x0028)
class USlow_component_array_copy_query_iterator final  : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x6D54C3C6__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_BAAC[0x18];                                    // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UComponent*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"slow_component_array_copy_query_iterator">();
	}
	static class USlow_component_array_copy_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlow_component_array_copy_query_iterator>();
	}
};

// VerseClass VerseQuery.slow_entity_array_copy_query_iterator
// 0x0028 (0x0050 - 0x0028)
class USlow_entity_array_copy_query_iterator final  : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x53DE0B78__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_BAAE[0x18];                                    // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class Entity_0::UEntity*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"slow_entity_array_copy_query_iterator">();
	}
	static class USlow_entity_array_copy_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlow_entity_array_copy_query_iterator>();
	}
};

// VerseClass VerseQuery.tag_component
// 0x0050 (0x01B0 - 0x0160)
class UTag_component final  : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xA772F8B2__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RGetTags; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3DC24FBF__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RAddTag_L_Ntag_R; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x216FAA41__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RRemoveTag_L_Ntag_R; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UTags_tag_container*                    __verse_0x5C685848_InternalTags;                   // 0x0190(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVerseGameplayTagContainer             __verse_0x322F2385_TagSelector;                    // 0x0198(0x0010)(Edit, InstancedReference, SaveGame)
	uint8                                         Pad_BAB0[0x8];                                     // 0x01A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO(class UTags_tag_container* _ExprResult_0, uint64 _InstancingGraph_1, const struct FVerseGameplayTagContainer& _ExprResult_2, class UTags_tag_container* _ExprResult_3, uint64 _InstancingGraph_4, const struct FVerseGameplayTagContainer& _ExprResult_5);
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RAddTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RGetTags(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RRemoveTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"tag_component">();
	}
	static class UTag_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTag_component>();
	}
};

// VerseClass VerseQuery.sphere3
// 0x0020 (0x0068 - 0x0048)
class USphere3 final  : public UConvex_hull3
{
public:
	struct FSpatialMath_vector3                   __verse_0xD0BE3FBE_Center;                         // 0x0048(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0xE34F9FAC_Radius;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO(const struct FSpatialMath_vector3& _ExprResult_0, const TMap<FVerseStringProperty_, uint8>& _ExprResultStack_1, FVerseStringProperty_ _ExprResult_2, FVerseStringProperty_ _ExprResult_3, FVerseStringProperty_ _ExprResult_4, const struct FSpatialMath_vector3& _ExprResult_5, const TMap<FVerseStringProperty_, uint8>& _ExprResultStack_6, FVerseStringProperty_ _ExprResult_7, FVerseStringProperty_ _ExprResult_8, FVerseStringProperty_ _ExprResult_9);
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fshape3_N_RDebugDraw(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"sphere3">();
	}
	static class USphere3* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphere3>();
	}
};

// VerseClass VerseQuery.volume_collision_override
// 0x0008 (0x0030 - 0x0028)
class UVolume_collision_override final  : public UCollision_override
{
public:
	class UConvex_hull3*                          __verse_0xACEB3EE3_CollisionVolume;                // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO(class USphere3* _ExprResult_0, uint64 _InstancingGraph_1, class USphere3* _ExprResult_2, uint64 _InstancingGraph_3);
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"volume_collision_override">();
	}
	static class UVolume_collision_override* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVolume_collision_override>();
	}
};

}

