#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_0

#include "Basic.hpp"

#include "VerseFortnite_0_structs.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseGameplayTags_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK::Params
{

// Function VerseFortnite.Game_healthful._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth
// 0x0010 (0x0010 - 0x0000)
struct Game_healthful__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_BABD[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Game_healthful._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth
// 0x0010 (0x0010 - 0x0000)
struct Game_healthful__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_BABE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Game_healthful._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Game_healthful__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R final 
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Game_healthful._L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R
// 0x0008 (0x0008 - 0x0000)
struct Game_healthful__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R final 
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.AI_focus_interface.MaintainFocus_L_Nagent_R
// 0x0028 (0x0028 - 0x0000)
struct AI_focus_interface_MaintainFocus_L_Nagent_R final 
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.AI_focus_interface.MaintainFocus_L_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct AI_focus_interface_MaintainFocus_L_Nvector3_R final 
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UConcurrency_task*                      RetVal;                                            // 0x0030(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nagent_R
// 0x0010 (0x0010 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nagent_R final 
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAI_navigation_target*                  RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Ntarget__info_R
// 0x0038 (0x0038 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Ntarget__info_R final 
{
public:
	struct FAI_target_info                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0030)(Parm, NoDestructor)
	class UAI_navigation_target*                  RetVal;                                            // 0x0030(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nvector3_R
// 0x0020 (0x0020 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nvector3_R final 
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAI_navigation_target*                  RetVal;                                            // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFocusInterface_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFocusInterface_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R final 
{
public:
	struct VerseFortnite_0::FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UObject*, true>               RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFortLeashable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFortLeashable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R final 
{
public:
	struct VerseFortnite_0::FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UObject*, true>               RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetLastKnownPosition_U_L_Ntarget__info_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0050 (0x0050 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetLastKnownPosition_U_L_Ntarget__info_M_Ntuple_L_R_M_Ntuple_L_R_R final 
{
public:
	struct VerseFortnite_0::FTuple_Ltarget__info_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0038)(Parm, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNavigatable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNavigatable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R final 
{
public:
	struct VerseFortnite_0::FTuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UObject*, true>               RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.AI._L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNPCBehavior_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct AI__L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNPCBehavior_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R final 
{
public:
	struct VerseFortnite_0::FTuple_Lagent_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	TOptional<class UAI_npc_behavior*, true>      RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.AI.AI_fort_obstacle_info$Factory
// 0x0028 (0x0028 - 0x0000)
struct AI_AI_fort_obstacle_info_Factory final 
{
public:
	struct FAI_fort_obstacle_info                 RetVal;                                            // 0x0000(0x0028)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VerseFortnite.AI.AI_fort_obstacle_info$OverrideFactory
// 0x0078 (0x0078 - 0x0000)
struct AI_AI_fort_obstacle_info_OverrideFactory final 
{
public:
	struct FAI_fort_obstacle_info                 RetVal;                                            // 0x0000(0x0028)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0028(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function VerseFortnite.AI.AI_target_info$Factory
// 0x0160 (0x0160 - 0x0000)
struct AI_AI_target_info_Factory final 
{
public:
	struct FAI_target_info                        RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_1;                                // 0x0048(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x00A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x00B8(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_5;                                     // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_6;                                // 0x00E0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0130(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x0140(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0150(0x0010)(HasGetValueTypeHash)
};

// Function VerseFortnite.AI.AI_target_info$OverrideFactory
// 0x0210 (0x0210 - 0x0000)
struct AI_AI_target_info_OverrideFactory final 
{
public:
	struct FAI_target_info                        RetVal;                                            // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0030(0x0050)(ConstParm, Parm, ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResultStack_0;                                // 0x0080(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_1;                                     // 0x0090(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAC0[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_2;                                     // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x00B0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0120(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_7;                                // 0x0130(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_8;                                     // 0x0140(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAC1[0x6];                                     // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         _ExprResultStack_9;                                // 0x0148(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_10;                                    // 0x0158(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAC2[0x6];                                     // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   _ExprResult_11;                                    // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_12;                               // 0x0178(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x01C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x01D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x01E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResultStack_16;                               // 0x01F8(0x0010)(HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResult_17;                                    // 0x0208(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component.$InitCDO
// 0x0100 (0x0100 - 0x0000)
struct Characters_fort_character_component__InitCDO final 
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_8;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_10;                                    // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_12;                                    // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_13;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_14;                                    // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_15;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_16;                                    // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_17;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_18;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_19;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_20;                                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_21;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_22;                                    // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_23;                               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_24;                                    // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_25;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_26;                                    // 0x00D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_27;                               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_28;                                    // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_29;                               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_30;                                    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_31;                               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_BAC3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_BAC4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent
// 0x0070 (0x0070 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_BAC5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class USimulation_agent*, true>     RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class USimulation_agent*                      _ExprResult_0;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__1;                             // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResultStack_1;                                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0028(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_3;                                     // 0x0038(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_BAC6[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_agent*                      _ExprResult_4;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__2;                             // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResultStack_5;                                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0058(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_7;                                     // 0x0068(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetEntity
// 0x0010 (0x0010 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetEntity final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_BAC7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Entity_0::UEntity*, true>     RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewLocation
// 0x0060 (0x0060 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewLocation final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_BAC8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	class UObject*                                __verse_0x00000000__1;                             // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0028(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_1;                                     // 0x0038(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_BAC9[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0048(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_3;                                     // 0x0058(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation
// 0x0070 (0x0070 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_BACA[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         RetVal;                                            // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
	class UObject*                                __verse_0x00000000__1;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0038(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_1;                                     // 0x0048(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_BACB[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0058(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_3;                                     // 0x0068(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide
// 0x0058 (0x0058 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_BACC[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BACD[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_2;                                     // 0x0028(0x0001)(HasGetValueTypeHash)
	uint8                                         Pad_BACE[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BACF[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_5;                                     // 0x0050(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive
// 0x0058 (0x0058 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAD0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_1;                                // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAD1[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_3;                                     // 0x0028(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_4;                                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAD2[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_5;                                // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAD3[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_7;                                     // 0x0050(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsCrouching
// 0x0058 (0x0058 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsCrouching final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAD4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_1;                                // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAD5[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_3;                                     // 0x0028(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_4;                                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAD6[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_5;                                // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAD7[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_7;                                     // 0x0050(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut
// 0x0058 (0x0058 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAD8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_1;                                // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAD9[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_3;                                     // 0x0028(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_4;                                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BADA[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_5;                                // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BADB[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_7;                                     // 0x0050(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFalling
// 0x0058 (0x0058 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFalling final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BADC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_1;                                // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BADD[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_3;                                     // 0x0028(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_4;                                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BADE[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_5;                                // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BADF[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_7;                                     // 0x0050(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFlying
// 0x0058 (0x0058 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFlying final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAE0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_1;                                // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAE1[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_3;                                     // 0x0028(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_4;                                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAE2[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_5;                                // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAE3[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_7;                                     // 0x0050(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsGliding
// 0x0058 (0x0058 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsGliding final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAE4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_1;                                // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAE5[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_3;                                     // 0x0028(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_4;                                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAE6[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_5;                                // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAE7[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_7;                                     // 0x0050(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInAir
// 0x0058 (0x0058 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInAir final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAE8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_1;                                // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAE9[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_3;                                     // 0x0028(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_4;                                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAEA[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_5;                                // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAEB[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_7;                                     // 0x0050(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInWater
// 0x0058 (0x0058 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInWater final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAEC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__1;                             // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_1;                                // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAED[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_3;                                     // 0x0028(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_4;                                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAEE[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__2;                             // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_5;                                // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAEF[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	struct VerseFortnite_0::FTuple_L_R            _ExprResult_7;                                     // 0x0050(0x0001)(HasGetValueTypeHash)
};

// Function VerseFortnite.Characters_fort_character_component._L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsOnGround
// 0x0058 (0x0058 - 0x0000)
struct Characters_fort_character_component__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsOnGround final 
{
public:
	struct VerseFortnite_0::FTuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAF0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
