#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VGameplayRst_0

#include "Basic.hpp"

#include "VGameplayRst_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "VerseColors_structs.hpp"


namespace SDK::Params
{

// Function VGameplayRst.task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionBegin.Update
// 0x0008 (0x0008 - 0x0000)
struct Task_VGameplayRst_Components_dynamic_activation_component_WaitForTransitionBegin_Update final 
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Messaging_debug_command_component.__WaitForCommand_L_N_Kchar_R
// 0x0030 (0x0030 - 0x0000)
struct VGameplayRst_Messaging_debug_command_component___WaitForCommand_L_N_Kchar_R final 
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0010)(Parm, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0028(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VGameplayRst.task_VGameplayRst_Physics_vk_collision_component$WaitEndOverlap.Update
// 0x0008 (0x0008 - 0x0000)
struct Task_VGameplayRst_Physics_vk_collision_component_WaitEndOverlap_Update final 
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionComplete.Update
// 0x0008 (0x0008 - 0x0000)
struct Task_VGameplayRst_Components_dynamic_activation_component_WaitForTransitionComplete_Update final 
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.task_VGameplayRst_Physics_vk_collision_component$WaitHit.Update
// 0x0008 (0x0008 - 0x0000)
struct Task_VGameplayRst_Physics_vk_collision_component_WaitHit_Update final 
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_Transform_rotatable._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector
// 0x0020 (0x0020 - 0x0000)
struct VGameplayRst_Transform_rotatable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector final 
{
public:
	struct VGameplayRst_0::FTuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_B8FB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VGameplayRst.VGameplayRst_Transform_rotatable._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector
// 0x0020 (0x0020 - 0x0000)
struct VGameplayRst_Transform_rotatable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector final 
{
public:
	struct VGameplayRst_0::FTuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_B8FC[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VGameplayRst.VGameplayRst_Transform_rotatable._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRotation
// 0x0030 (0x0030 - 0x0000)
struct VGameplayRst_Transform_rotatable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRotation final 
{
public:
	struct VGameplayRst_0::FTuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_B8FD[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         RetVal;                                            // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function VGameplayRst.VGameplayRst_Transform_rotatable._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector
// 0x0020 (0x0020 - 0x0000)
struct VGameplayRst_Transform_rotatable__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector final 
{
public:
	struct VGameplayRst_0::FTuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_B8FE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   RetVal;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function VGameplayRst.task_VGameplayRst_Messaging_debug_command_component$__WaitForCommand_L_N_Kchar_R.Update
// 0x0008 (0x0008 - 0x0000)
struct Task_VGameplayRst_Messaging_debug_command_component___WaitForCommand_L_N_Kchar_R_Update final 
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_GameObjects._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateImmutableModel_L_Ntag_R
// 0x00C8 (0x00C8 - 0x0000)
struct VGameplayRst_GameObjects__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateImmutableModel_L_Ntag_R final 
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_immutable_model*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8FF[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEntityComponent*                       __verse_0x44719314_FoundComponent_3;               // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_0;                                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0010)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0xECA943DB_Entity_3;                       // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_2;                                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0048(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0058(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_6;                                // 0x0069(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__6;                             // 0x006B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B900[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEntityComponent*                       __verse_0x44719314_FoundComponent_8;               // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_7;                                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0080(0x0010)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0xECA943DB_Entity_8;                       // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_9;                                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x00B0(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_12 : 1;                                // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_13;                               // 0x00C1(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_GameObjects._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateImmutableModel_L_Nvk__entity_M_N_Ksubtype_Lvk__component_R_R
// 0x0358 (0x0358 - 0x0000)
struct VGameplayRst_GameObjects__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateImmutableModel_L_Nvk__entity_M_N_Ksubtype_Lvk__component_R_R final 
{
public:
	struct FTuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_immutable_model*, true> RetVal;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0020(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B901[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         __verse_0x36974CE7_ComponentClassesToAdd_2;        // 0x0028(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_0;                                     // 0x0038(0x0010)(ContainsInstancedReference)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__3;                             // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_1;                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B902[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0058(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x71AD33A7_Mesh_4;                         // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Geometry_fixed_mesh_component*, true> _FallibleType_3;                                   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_4;                                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_5;                                     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__5;                             // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0090(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__6;                             // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_7;                          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B903[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x00B0(0x0010)(HasGetValueTypeHash)
	struct FTuple_Llogic_Mlogic_R                 _ExprResult_9;                                     // 0x00C0(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_B904[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x802C815C_Collision_4;                    // 0x00C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _FallibleType_10;                                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_11;                               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_12;                                    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__7;                             // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x00F0(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0xA82B0967_Position_4;                     // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _FallibleType_14;                                  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_15;                               // 0x0110(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_16;                                    // 0x0118(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__8;                             // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_17;                                        // 0x0128(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_4;                     // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _FallibleType_18;                                  // 0x0140(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_19;                               // 0x0148(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_20;                                    // 0x0150(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__9;                             // 0x0158(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_21;                                        // 0x0160(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0xA376805D_Scale_4;                        // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _FallibleType_22;                                  // 0x0178(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_23;                               // 0x0180(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_24;                                    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__10;                            // 0x0190(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_25;                                        // 0x0198(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_GameObjects_immutable_model* __verse_0x95D09D0E_Result_11;                      // 0x01A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_26;                               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_27 : 1;                                // 0x01B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_28;                               // 0x01B9(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__13;                            // 0x01BB(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B905[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         __verse_0x36974CE7_ComponentClassesToAdd_14;       // 0x01C0(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ExprResult_29;                                    // 0x01D0(0x0010)(ContainsInstancedReference)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__15;                            // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_30;                         // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B906[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_31;                                        // 0x01F0(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x71AD33A7_Mesh_16;                        // 0x0200(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Geometry_fixed_mesh_component*, true> _FallibleType_32;                                  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_33;                               // 0x0210(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_34;                                    // 0x0218(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__17;                            // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_35;                                        // 0x0228(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__18;                            // 0x0238(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_36;                         // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B907[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_37;                                        // 0x0248(0x0010)(HasGetValueTypeHash)
	struct FTuple_Llogic_Mlogic_R                 _ExprResult_38;                                    // 0x0258(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_B908[0x6];                                     // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x802C815C_Collision_16;                   // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Physics_vk_collision_component*, true> _FallibleType_39;                                  // 0x0268(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_40;                               // 0x0270(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_41;                                    // 0x0278(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__19;                            // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_42;                                        // 0x0288(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0xA82B0967_Position_16;                    // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _FallibleType_43;                                  // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_44;                               // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_45;                                    // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__20;                            // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_46;                                        // 0x02C0(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0x78C70FF3_Rotation_16;                    // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_rotation_component*, true> _FallibleType_47;                                  // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_48;                               // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_49;                                    // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__21;                            // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_50;                                        // 0x02F8(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0xA376805D_Scale_16;                       // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_scale_component*, true> _FallibleType_51;                                  // 0x0310(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_52;                               // 0x0318(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_53;                                    // 0x0320(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__22;                            // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_54;                                        // 0x0330(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_GameObjects_immutable_model* __verse_0x95D09D0E_Result_23;                      // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_55;                               // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_56 : 1;                                // 0x0350(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_57;                               // 0x0351(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_GameObjects._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateImmutableModel_L_Nvk__entity_R
// 0x00F0 (0x00F0 - 0x0000)
struct VGameplayRst_GameObjects__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateImmutableModel_L_Nvk__entity_R final 
{
public:
	class UVerseEngine_Entity_vk_entity*          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_immutable_model*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UClass*>                         __verse_0xDFAF13A0_ComponentClassToAdd_1;          // 0x0010(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_2;                        // 0x0020(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ForResult_0;                                      // 0x0030(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_1;                                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_2;                                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_4;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x0051(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_B909[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0058(0x0010)(HasGetValueTypeHash)
	struct FTuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R _ExprResult_5;                                     // 0x0068(0x0018)(HasGetValueTypeHash)
	TArray<class UClass*>                         __verse_0xDFAF13A0_ComponentClassToAdd_6;          // 0x0080(0x0010)(ContainsInstancedReference)
	TArray<EVerseFalse>                           __verse_0xFFC68BC5_Array_7;                        // 0x0090(0x0010)(ContainsInstancedReference)
	TArray<class UClass*>                         _ForResult_6;                                      // 0x00A0(0x0010)(ContainsInstancedReference)
	int64                                         _ForIndex_7;                                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_8;                                      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseFalse                                   __verse_0xFB88B569_Item_9;                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_9 : 1;                                 // 0x00C1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_B90A[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x00C8(0x0010)(HasGetValueTypeHash)
	struct FTuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R _ExprResult_11;                                    // 0x00D8(0x0018)(HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_GameObjects._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_M_Nmaterial_R
// 0x0250 (0x0250 - 0x0000)
struct VGameplayRst_GameObjects__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_M_Nmaterial_R final 
{
public:
	struct FTuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_Mmaterial_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0090)(Parm, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> RetVal;                                            // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> __verse_0x2BD82FE8_MaybeModel_1;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x00A0(0x0010)(HasGetValueTypeHash)
	struct FTuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R _ExprResult_1;                                     // 0x00B0(0x0090)(HasGetValueTypeHash)
	class UVGameplayRst_GameObjects_model*        __verse_0x986678F9_Model_2;                        // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> _ExprResultStack_2;                                // 0x0148(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__3;                             // 0x0150(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B90B[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0160(0x0010)(HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> __verse_0x2BD82FE8_MaybeModel_4;                   // 0x0170(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x0178(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_B90C[0x8];                                     // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R _ExprResult_6;                                     // 0x0190(0x0090)(HasGetValueTypeHash)
	class UVGameplayRst_GameObjects_model*        __verse_0x986678F9_Model_5;                        // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> _ExprResultStack_7;                                // 0x0228(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__6;                             // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B90D[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x0240(0x0010)(HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_GameObjects._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_R
// 0x0350 (0x0350 - 0x0000)
struct VGameplayRst_GameObjects__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_R final 
{
public:
	struct FTuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0090)(Parm, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> RetVal;                                            // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0098(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B90E[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseEngine_Entity_vk_entity*, true> __verse_0x6BB06783_MaybeObj_2;                     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x00A8(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_B90F[0x8];                                     // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTuple_Ltransform_M_Kchar_R            _ExprResult_1;                                     // 0x00C0(0x0070)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x4F5E77FF_Obj_3;                          // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_2;                                // 0x0138(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> __verse_0x2BD82FE8_MaybeModel_4;                   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0148(0x0010)(HasGetValueTypeHash)
	struct FTuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R _ExprResult_4;                                     // 0x0158(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_GameObjects_model*        __verse_0x986678F9_Model_5;                        // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> _ExprResultStack_5;                                // 0x0178(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__6;                             // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B910[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0190(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__7;                             // 0x01A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B911[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x01B0(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x00000000__8;                             // 0x01C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_10;                         // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B912[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x01D0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x01E0(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_13 : 1;                                // 0x01F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_14;                               // 0x01F1(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__10;                            // 0x01F3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B913[0x3];                                     // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseEngine_Entity_vk_entity*, true> __verse_0x6BB06783_MaybeObj_11;                    // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x0200(0x0010)(HasGetValueTypeHash)
	struct FTuple_Ltransform_M_Kchar_R            _ExprResult_16;                                    // 0x0210(0x0070)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x4F5E77FF_Obj_12;                         // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_17;                               // 0x0288(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> __verse_0x2BD82FE8_MaybeModel_13;                  // 0x0290(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x0298(0x0010)(HasGetValueTypeHash)
	struct FTuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R _ExprResult_19;                                    // 0x02A8(0x0018)(HasGetValueTypeHash)
	class UVGameplayRst_GameObjects_model*        __verse_0x986678F9_Model_14;                       // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> _ExprResultStack_20;                               // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__15;                            // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_21;                         // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B914[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_22;                                        // 0x02E0(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__16;                            // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_23;                         // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B915[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_24;                                        // 0x0300(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x00000000__17;                            // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_25;                         // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B916[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_26;                                        // 0x0320(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_27;                                    // 0x0330(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_28 : 1;                                // 0x0340(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_29;                               // 0x0341(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_GameObjects._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Nvector3_M_Nrotation_M_Nvector3_M_N_Kchar_M_Nmesh_M_Nmaterial_R
// 0x0410 (0x0410 - 0x0000)
struct VGameplayRst_GameObjects__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Nvector3_M_Nrotation_M_Nvector3_M_N_Kchar_M_Nmesh_M_Nmaterial_R final 
{
public:
	struct FTuple_L_Ksubtype_Lvk__component_R_Mvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0090)(Parm, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> RetVal;                                            // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> __verse_0x2BD82FE8_MaybeModel_1;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x00A0(0x0010)(HasGetValueTypeHash)
	struct FTuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R _ExprResult_1;                                     // 0x00B0(0x0090)(HasGetValueTypeHash)
	struct FSpatialMath_transform                 _ExprResult_2;                                     // 0x0140(0x0060)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_3;                                // 0x01A0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x01F0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_5;                                     // 0x0200(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_6;                                     // 0x0210(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_GameObjects_model*        __verse_0x986678F9_Model_2;                        // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> _ExprResultStack_7;                                // 0x0228(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__3;                             // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_8;                          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B917[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_9;                                         // 0x0240(0x0010)(HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> __verse_0x2BD82FE8_MaybeModel_4;                   // 0x0250(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x0258(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_B918[0x8];                                     // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R _ExprResult_11;                                    // 0x0270(0x0090)(HasGetValueTypeHash)
	struct FSpatialMath_transform                 _ExprResult_12;                                    // 0x0300(0x0060)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_13;                               // 0x0360(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x03B0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_15;                                    // 0x03C0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_16;                                    // 0x03D0(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_GameObjects_model*        __verse_0x986678F9_Model_5;                        // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> _ExprResultStack_17;                               // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0x00000000__6;                             // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_18;                         // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B919[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_19;                                        // 0x0400(0x0010)(HasGetValueTypeHash)
};

// Function VGameplayRst.VGameplayRst_GameObjects._L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Ntag_R
// 0x00C8 (0x00C8 - 0x0000)
struct VGameplayRst_GameObjects__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Ntag_R final 
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_GameObjects_model*, true> RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0010(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B91A[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEntityComponent*                       __verse_0x44719314_FoundComponent_3;               // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_0;                                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0028(0x0010)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0xECA943DB_Entity_3;                       // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_2;                                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0048(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0058(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_6;                                // 0x0069(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__6;                             // 0x006B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B91B[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEntityComponent*                       __verse_0x44719314_FoundComponent_8;               // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_7;                                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x0080(0x0010)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0xECA943DB_Entity_8;                       // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_9;                                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x00A0(0x0010)(HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x00B0(0x0010)(HasGetValueTypeHash)
	uint8                                         _ExprResult_12 : 1;                                // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_13;                               // 0x00C1(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

