#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VictoryCrownsUI

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class VictoryCrownsUI.FortUIManagerComponent_VictoryCrowns
// 0x00B0 (0x0158 - 0x00A8)
class UFortUIManagerComponent_VictoryCrowns final  : public UFortControllerComponent
{
public:
	TSubclassOf<class UVictoryCrownsIndicator>    VictoryCrownsIndicatorClass;                       // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUserWidgetPool                        IndicatorPool;                                     // 0x00B0(0x0088)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9970[0x20];                                    // 0x0138(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RebuildBearerIndicators(TArray<class AFortPlayerStateAthena*>& CrownBearerList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIManagerComponent_VictoryCrowns">();
	}
	static class UFortUIManagerComponent_VictoryCrowns* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIManagerComponent_VictoryCrowns>();
	}
};

// Class VictoryCrownsUI.VictoryCrownsBearerInfoBase
// 0x0010 (0x0300 - 0x02F0)
class UVictoryCrownsBearerInfoBase final  : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class AFortPlayerStateAthena>  WeakPSA;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_PlayerName;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSetPlayerState(class AFortPlayerStateAthena* PSA);
	void SetPlayerState(class AFortPlayerStateAthena* InPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VictoryCrownsBearerInfoBase">();
	}
	static class UVictoryCrownsBearerInfoBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVictoryCrownsBearerInfoBase>();
	}
};

// Class VictoryCrownsUI.VictoryCrownsIndicator
// 0x0028 (0x0400 - 0x03D8)
class UVictoryCrownsIndicator final  : public UFortActorIndicatorWidget
{
public:
	uint8                                         Pad_9971[0x28];                                    // 0x03D8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDistanceChanged(int32 Distance);
	void OnScreenClampChanged(bool bIsClamped);

	const class AFortPlayerStateAthena* GetIndicatedPlayerStateAthena() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VictoryCrownsIndicator">();
	}
	static class UVictoryCrownsIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVictoryCrownsIndicator>();
	}
};

// Class VictoryCrownsUI.VictoryCrownsPlacementOverlay
// 0x0000 (0x0350 - 0x0350)
class UVictoryCrownsPlacementOverlay final  : public UPostGamePlacementOverlay
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VictoryCrownsPlacementOverlay">();
	}
	static class UVictoryCrownsPlacementOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVictoryCrownsPlacementOverlay>();
	}
};

// Class VictoryCrownsUI.VictoryCrownsPlayerInfoWidget
// 0x0010 (0x0340 - 0x0330)
class UVictoryCrownsPlayerInfoWidget final  : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_9972[0x10];                                    // 0x0330(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCrownBearerListChanged(TArray<class AFortPlayerStateAthena*>& CrownBearerList);
	void OnPlayerVictoryCrownStatusChanged(bool bHasCrown);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VictoryCrownsPlayerInfoWidget">();
	}
	static class UVictoryCrownsPlayerInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVictoryCrownsPlayerInfoWidget>();
	}
};

// Class VictoryCrownsUI.VictoryCrownsPreGameWidget
// 0x0050 (0x0458 - 0x0408)
class UVictoryCrownsPreGameWidget final  : public UCommonActivatableWidget
{
public:
	class UDynamicEntryBox*                       EntryBox_BearerList;                               // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    TipActionWidget;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CloseObjectInputAction;                            // 0x0418(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9973[0x30];                                    // 0x0428(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FadeOutTimerFinished();
	void OnButtonClose();
	void OnButtonCloseProgress(float Progress);
	void OnCloseActionsComplete();
	void OnInputMethodChanged(ECommonInputType CurrentInput);
	void RebuildBearerList(TArray<class AFortPlayerStateAthena*>& CrownBearerList);
	void RegisterCloseButtonInput();
	void StartFadeOut();
	void UnregisterCloseButtonInput();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VictoryCrownsPreGameWidget">();
	}
	static class UVictoryCrownsPreGameWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVictoryCrownsPreGameWidget>();
	}
};

}

