#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VotingFramework

#include "Basic.hpp"

#include "VotingFramework_structs.hpp"
#include "MeshNetwork_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class VotingFramework.VoteBroadcasterComponent
// 0x03C0 (0x0510 - 0x0150)
class UVoteBroadcasterComponent final  : public UMeshNetworkComponent
{
public:
	TArray<struct FVoteSessionSettings>           VoteSessionSettingsList;                           // 0x0150(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FVoteSessionRuntimeArray               VoteSessionRuntimeList;                            // 0x0160(0x0120)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FVoteRuntimeArray                      VoteRuntimeList;                                   // 0x0280(0x0120)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FVoteSelectionResultsArray             VoteResultsList;                                   // 0x03A0(0x0120)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FUniqueNetIdRepl, struct FCastedVote> PlayerCastedVotesMap;                              // 0x04C0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	void OnVoteCasted(struct FUniqueNetIdRepl& UserNetId, struct FGameplayTag& VoteSessionId, struct FGameplayTag& VoteId, struct FGameplayTag& VoteSelectionId);
	void ServerSubmitVotesAggregated(class FName VoteSessionId, class FName VoteId, class FName VoteSelectionId, int32 VoteDelta);
	void VoteEnd(class FName VoteSessionId, class FName VoteId, class FName WinningVoteSelectionId);
	void VoteSessionComplete(class FName VoteSessionId);
	void VoteSessionSetup(class FName VoteSessionId, class FName StartingVoteId, EVoteSessionNetworkType NetworkType);
	void VoteSessionShutdown(class FName VoteSessionId);
	void VoteSetup(class FName VoteSessionId, class FName VoteId);
	void VoteStart(class FName VoteSessionId, class FName VoteId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoteBroadcasterComponent">();
	}
	static class UVoteBroadcasterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteBroadcasterComponent>();
	}
};

// Class VotingFramework.VoteDispatchSubsystem
// 0x00A0 (0x00D0 - 0x0030)
class UVoteDispatchSubsystem final  : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_B145[0x90];                                    // 0x0030(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVoteSelectionResults>          VotingResults;                                     // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoteDispatchSubsystem">();
	}
	static class UVoteDispatchSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteDispatchSubsystem>();
	}
};

// Class VotingFramework.VoteInitiationActor
// 0x0010 (0x02A0 - 0x0290)
class AVoteInitiationActor final  : public AInfo
{
public:
	uint8                                         Pad_B146[0x8];                                     // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoteBroadcasterComponent*              VoteBroadcasterComponent;                          // 0x0298(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoteInitiationActor">();
	}
	static class AVoteInitiationActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVoteInitiationActor>();
	}
};

// Class VotingFramework.VoteListenerComponent
// 0x00E0 (0x0180 - 0x00A0)
class UVoteListenerComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnVoteSessionSetupEvent;                           // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVoteSessionVotingEvent;                          // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVoteSetupEvent;                                  // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVoteStartEvent;                                  // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVoteChangeEvent;                                 // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVoteEndEvent;                                    // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVoteSessionCompleteEvent;                        // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVoteSessionShutdownEvent;                        // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequestedVoteSessionIds;                           // 0x0120(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  RequestedVoteIds;                                  // 0x0140(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  RequestedVoteSelectionIds;                         // 0x0160(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	void OnVoteChange(struct FGameplayTag& VoteSessionId, struct FGameplayTag& VoteId, struct FGameplayTag& VoteSelectionId, int32 ServerVoteTotal, int32 AllServersVoteTotal);
	void OnVoteEnd(struct FGameplayTag& VoteSessionId, struct FGameplayTag& VoteId, struct FGameplayTag& WinningVoteSelectionId, EVoteState VoteState);
	void OnVoteSessionComplete(struct FGameplayTag& VoteSessionId);
	void OnVoteSessionSetup(struct FGameplayTag& VoteSessionId, struct FGameplayTag& StartingVoteId, EVoteSessionNetworkType NetworkType, EVoteSessionState SessionState);
	void OnVoteSessionShutdown(struct FGameplayTag& VoteSessionId);
	void OnVoteSessionVoting(struct FGameplayTag& VoteSessionId, struct FGameplayTag& StartingVoteId, EVoteSessionState SessionState);
	void OnVoteSetup(struct FGameplayTag& VoteSessionId, struct FGameplayTag& VoteId, EVoteState VoteState);
	void OnVoteStart(struct FGameplayTag& VoteSessionId, struct FGameplayTag& VoteId, EVoteState VoteState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoteListenerComponent">();
	}
	static class UVoteListenerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteListenerComponent>();
	}
};

// Class VotingFramework.VoteResponderComponent
// 0x0070 (0x01F0 - 0x0180)
class UVoteResponderComponent final  : public UVoteListenerComponent
{
public:
	TArray<struct FVoteSelection>                 SupportedVoteSelections;                           // 0x0180(0x0010)(Edit, Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bShouldLockVotingAfterCasted;                      // 0x0190(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B14C[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FUniqueNetIdRepl, struct FCastedVote> PlayerCastedVotesMap;                              // 0x0198(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	class FName                                   ActiveVoteSessionId;                               // 0x01E8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ActiveVoteId;                                      // 0x01EC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void CastDefaultVoteSelection(class APlayerState* InPlayerState);
	void CastManualVoteSelection(class APlayerState* InPlayerState, struct FGameplayTag& VoteSelection);
	void CastManualVoteSelectionAtIndex(class APlayerState* InPlayerState, int32 SelectionIndex);
	void ServerCastVoteSelection(struct FUniqueNetIdRepl& InUserId, struct FCastedVote& CastedVote);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoteResponderComponent">();
	}
	static class UVoteResponderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteResponderComponent>();
	}
};

}

