#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Juno_CustomBanner

#include "Basic.hpp"

#include "E_CustomBannerViewType_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "WBP_MPItemShop_CustomBanner_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Juno_CustomBanner.WBP_Juno_CustomBanner_C
// 0x0078 (0x0340 - 0x02C8)
class UWBP_Juno_CustomBanner_C final  : public UWBP_MPItemShop_CustomBanner_C
{
public:
	class UFortItemShopOfferVM*                   FortItemShopOfferVM;                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortDynamicEntryBox*                   FortDynamicEntryBox_Items;                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_ViewType;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Usable;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FString, int32>                    ItemAmountsMap;                                    // 0x02E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_CustomBannerViewType                        CurrentView;                                       // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BuildEntry(int32 Param_Index, class UWBP_Juno_CustomBanner_Entry_C* NewEntry, TArray<class FString>& CallFunc_Map_Keys_Keys, class UUserWidget* CallFunc_BP_CreateEntry_ReturnValue, class UWBP_Juno_CustomBanner_Entry_C* K2Node_DynamicCast_AsWBP_Juno_Custom_Banner_Entry, bool K2Node_DynamicCast_bSuccess, class FText CallFunc_Conv_StringToText_ReturnValue, TArray<int32>& CallFunc_Map_Values_Values, int64 CallFunc_Conv_IntToInt64_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue);
	void IncrementMapValue(class FText& Key, int32 AmountToAdd, int32 NewLocalVar, const class FString& KeyString, const class FString& CallFunc_Conv_TextToString_ReturnValue, int32 CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void ParseGrantedItems(TArray<class UFortItemVM*>& Items, const TArray<class FText>& CategoryNames, bool Temp_bool_Variable, int32 CallFunc_Array_Length_ReturnValue, bool Temp_bool_Variable_1, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, class UFortItemVM* CallFunc_Array_Get_Item, E_CustomBannerViewType Temp_byte_Variable, bool K2Node_Select_Default, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Map_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue);
	void ParseItem(class UFortItemVM* Item, class FText CallFunc_MakeLiteralText_ReturnValue, class UFortLockerCategoryConfig* CallFunc_GetItemCategory_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UJunoShopBuildSetItemDetailsVM* K2Node_DynamicCast_AsJuno_Shop_Build_Set_Item_Details_VM, bool K2Node_DynamicCast_bSuccess, class UJunoShopPropBundleItemDetailsVM* K2Node_DynamicCast_AsJuno_Shop_Prop_Bundle_Item_Details_VM, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_Array_Length_ReturnValue, EFortItemType CallFunc_GetItemType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue);
	void SetFortItemShopOfferVM(class UFortItemShopOfferVM* ViewModel, class UMVVMView* CallFunc_GetExtension_ReturnValue, TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput, bool CallFunc_SetViewModel_ReturnValue);
	void SetOfferViewModel(class UFortItemShopOfferVM* OfferVM);
	void SetViewType(E_CustomBannerViewType ViewType, E_CustomBannerViewType Temp_byte_Variable, class UWidget* K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Juno_CustomBanner_C">();
	}
	static class UWBP_Juno_CustomBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Juno_CustomBanner_C>();
	}
};

}

