#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemDetails_PropBundle

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemDetails_PropBundle.WBP_ItemDetails_PropBundle_C
// 0x0038 (0x0300 - 0x02C8)
class UWBP_ItemDetails_PropBundle_C final  : public UUserWidget
{
public:
	class UFortItemSelectionVM*                   FortItemSelectionVM;                               // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UJunoShopPropBundleItemDetailsVM*       JunoShopPropBundleItemDetailsVM;                   // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_VariantLegalText_1;                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ItemDetails_Buildset;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BuildSet_PartsList_C*              PartsList;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_InteractiveDecor;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Legal_Details_Buildset;                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UWidget* CustomScroll(EUINavigation Param_Navigation);
	void OnPropsUpdated(TArray<struct FJunoShopPropInfo>& Props, class FText Name_Loop, bool IsInteractive_Loop, bool IsAnyPropInteractive, const TArray<class FText>& Names, ESlateVisibility Temp_byte_Variable, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, const struct FJunoShopPropInfo& CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, ESlateVisibility Temp_byte_Variable_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, class FText CallFunc_SelectText_ReturnValue, bool Temp_bool_Variable, ESlateVisibility K2Node_Select_Default, int32 CallFunc_Array_Add_ReturnValue);
	void SetJunoShopPropBundleItemDetailsVM(class UJunoShopPropBundleItemDetailsVM* ViewModel, class UMVVMView* CallFunc_GetExtension_ReturnValue, TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput, bool CallFunc_SetViewModel_ReturnValue);
	void SetPropBundleVM(class UFortItemVM* ItemVM, bool CallFunc_IsValid_ReturnValue, class UJunoShopPropBundleItemDetailsVM* K2Node_DynamicCast_AsJuno_Shop_Prop_Bundle_Item_Details_VM, bool K2Node_DynamicCast_bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemDetails_PropBundle_C">();
	}
	static class UWBP_ItemDetails_PropBundle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemDetails_PropBundle_C>();
	}
};

}

