#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Tabs_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_UI_Alignment_structs.hpp"
#include "E_UI_TabsInputActionType_structs.hpp"
#include "E_UI_BackplateCornerRadius_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_UI_BackplateBrightness_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Tabs_Base.WBP_UIKit_Tabs_Base_C
// 0x0238 (0x0738 - 0x0500)
class UWBP_UIKit_Tabs_Base_C : public UUIKitTabGroup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_PromptSpaceChange;                            // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridPanel*                             Main;                                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Next_Prompt;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Next_SizeBox;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Next_Spacer;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Prev_Prompt;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Prev_SizeBox;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Prev_Spacer;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PrevTabAction;                                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Root;                                              // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Root;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Slot_Tabs;                                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             TabsContainer;                                     // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   InitialSelectedTabID;                              // 0x0578(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InitialSelectedTabIndex;                           // 0x057C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVertical;                                        // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB23[0x7];                                     // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ButtonClass;                                       // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         MinButtonWidth;                                    // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinButtonHeight;                                   // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          ButtonHorizontalAlignment;                         // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            ButtonVerticalAlignment;                           // 0x0599(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB24[0x6];                                     // 0x059A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TabSpacing;                                        // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconSize;                                          // 0x05A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNaturalNavigation;                               // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB25[0x7];                                     // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    Bumper_NextTab;                                    // 0x05C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    Bumper_PrevTab;                                    // 0x05D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    Trigger_NextTab;                                   // 0x05E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    Trigger_PrevTab;                                   // 0x05F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    BumperAndMouseScroll_NextTab;                      // 0x0600(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    BumperAndMouseScroll_PrevTab;                      // 0x0610(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    TriggerAndMouseScroll_NextTab;                     // 0x0620(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    TriggerAndMouseScroll_PrevTab;                     // 0x0630(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	E_UI_TabsInputActionType                      InputActions;                                      // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputActionsWithMouseScroll;                       // 0x0641(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          NextPromptHorizontalAlignment;                     // 0x0642(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            NextPromptVerticalAlignment;                       // 0x0643(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HidePrompts;                                       // 0x0644(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideMouseAndKeyboardPrompts;                       // 0x0645(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB26[0x2];                                     // 0x0646(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReservedPromptSpace;                               // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimateReservedPromptSpace;                        // 0x0650(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB27[0x7];                                     // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeToHidePrompts;                                 // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeToShowPrompts;                                 // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                NextPromptPadding;                                 // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_UI_Alignment                                SelectionAlignment;                                // 0x0678(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDividers;                                       // 0x0679(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB28[0x6];                                     // 0x067A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DividerClass;                                      // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        DividerSpacing;                                    // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPromptsVisible;                                  // 0x0690(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          TabGroupHorizontalAlignment;                       // 0x0691(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            TabGroupVerticalAlignment;                         // 0x0692(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB29[0x1];                                     // 0x0693(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                TabGroupPadding;                                   // 0x0694(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB2A[0x4];                                     // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_Backplate_Base_C*            ContentBackplate;                                  // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBackplate;                                      // 0x06B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB2B[0x7];                                     // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 BackplateClass;                                    // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateBrightness                      BackplateBrightness;                               // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateCornerRadius                    BackplateCornerRadius;                             // 0x06C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB2C[0x6];                                     // 0x06C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_Backplate_Base_C*            PrevPromptBackplate;                               // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Backplate_Base_C*            NextPromptBackplate;                               // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Divider_Base_C*              ContentDivider;                                    // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentSubGroupID;                                 // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DividersCount;                                     // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoSpacingAfterDivider;                             // 0x06E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsePromptBackplate;                                // 0x06E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB2D[0x6];                                     // 0x06EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 PromptsBackplateClass;                             // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateBrightness                      PromptBackplateBrightness;                         // 0x06F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateCornerRadius                    PromptBackplateCornerRadius;                       // 0x06F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          PrevPromptHorizontalAlignment;                     // 0x06FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            PrevPromptVerticalAlignment;                       // 0x06FB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                PrevPromptPadding;                                 // 0x06FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB2E[0x4];                                     // 0x070C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PromptBackplateMinWidth;                           // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PromptBackplateMinHeight;                          // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PromptsInsideTabsBackplate;                        // 0x0720(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CurrentInputType;                                  // 0x0721(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB2F[0x2];                                     // 0x0722(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                DividerPadding;                                    // 0x0724(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void AddBackplate(class UPanelSlot* CallFunc_AddChild_ReturnValue, class UWBP_UIKit_Backplate_Base_C* CallFunc_SpawnObject_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue_1, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue_1, class UWBP_UIKit_Backplate_Base_C* CallFunc_SpawnObject_ReturnValue_1, class UWBP_UIKit_Backplate_Base_C* CallFunc_SpawnObject_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, float CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast, float CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast_1, float CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast, float CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast_1);
	void AddButtonToGrid(class UWidget* Widget, int32 Param_Index, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, double CallFunc_SelectFloat_ReturnValue, const struct FMargin& K2Node_MakeStruct_Margin, const struct FMargin& K2Node_MakeStruct_Margin_1, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue_1, float K2Node_MakeStruct_Top_ImplicitCast, float K2Node_MakeStruct_Left_ImplicitCast);
	void AddDivider(int32 Param_Index, class FName SubGroup, bool CallFunc_NotEqual_IntInt_ReturnValue, class UWBP_UIKit_Divider_Base_C* CallFunc_SpawnObject_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 Temp_int_Variable, bool CallFunc_NotEqual_NameName_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void AddDividerToGrid(class UWBP_UIKit_Divider_Base_C* Divider, int32 Param_Index, int32 CallFunc_Add_IntInt_ReturnValue, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue_1);
	void Cleanup(class UWidget* Widget, bool CallFunc_IsValid_ReturnValue, class UPanelWidget* CallFunc_GetParent_ReturnValue, bool CallFunc_RemoveChild_ReturnValue);
	void ClearTabGroup();
	void Construct();
	void Destruct();
	void Event_On_Input_Method_Changed(ECommonInputType bNewInputType);
	void ExecuteUbergraph_WBP_UIKit_Tabs_Base(int32 EntryPoint, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, float CallFunc_GetAnimationCurrentTime_ReturnValue, bool K2Node_Event_IsDesignTime, double CallFunc_Multiply_DoubleDouble_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_2, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_3, class FName K2Node_Event_TabNameID, class UCommonButtonBase* K2Node_Event_TabButton, int32 CallFunc_GetTabIndexByID_ReturnValue, bool CallFunc_Array_IsNotEmpty_ReturnValue, bool CallFunc_SelectTabByID_ReturnValue, bool CallFunc_SelectTabByIndex_ReturnValue, ECommonInputType K2Node_CustomEvent_bNewInputType, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast);
	void GetButtonClass(class UUIKitTabGroupButtonViewModel* TabVM, class UClass** Param_ButtonClass, class UFortTabViewModel* K2Node_DynamicCast_AsFort_Tab_Viewmodel, bool K2Node_DynamicCast_bSuccess, TSubclassOf<class UCommonButtonBase> CallFunc_GetOverrideTabWidget_ReturnValue, bool CallFunc_IsValidClass_ReturnValue);
	void HandleTabCreation(class FName TabNameID, class UCommonButtonBase* TabButton);
	void OverrideInputActions(const struct FDataTableRowHandle& Next_Tab, const struct FDataTableRowHandle& PreviousTab);
	void PreConstruct(bool IsDesignTime);
	void PresetForDesignTime(uint8 CallFunc_MakeLiteralByte_ReturnValue, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, bool Temp_bool_Variable_1, const struct FVector2D& K2Node_Select_Default, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_HasAnyChildren_ReturnValue, ESlateVisibility K2Node_Select_Default_1);
	void Repeater_PromptSpaceChange();
	void RestoreTabSelection(class FName TabNameID, class UCommonButtonBase* CallFunc_GetTabButtonBaseByID_ReturnValue, bool CallFunc_SelectTabByID_ReturnValue, class UWBP_UIKit_ButtonGeneric_Base_C* K2Node_DynamicCast_AsWBP_UIKit_Button_Generic_Base, bool K2Node_DynamicCast_bSuccess);
	void SequenceEvent__ENTRYPOINTWBP_UIKit_Tabs_Base();
	void SequenceEvent__ENTRYPOINTWBP_UIKit_Tabs_Base_0();
	void SequenceEvent__ENTRYPOINTWBP_UIKit_Tabs_Base_1();
	void Set_Tabs_Data(TArray<class UUIKitTabGroupButtonViewModel*>& InTabs_Data, class FName CurrentSelection, int32 Temp_int_Array_Index_Variable, const class FString& CallFunc_Conv_IntToString_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue, bool Temp_bool_Variable, class FName CallFunc_GetSelectedTabId_ReturnValue, int32 CallFunc_GetTabCount_ReturnValue, class FName Temp_name_Variable, bool CallFunc_Greater_IntInt_ReturnValue, bool Temp_bool_Variable_1, int32 Temp_int_Loop_Counter_Variable, class UUIKitTabGroupButtonViewModel* CallFunc_Array_Get_Item, class UClass* CallFunc_GetButtonClass_ButtonClass, class FName K2Node_Select_Default, class FName K2Node_Select_Default_1, bool CallFunc_IsTabViewModelValid_ReturnValue, bool CallFunc_RegisterTab_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void SetBackplateProperties(class UWBP_UIKit_Backplate_Base_C* Backplate, E_UI_BackplateBrightness Brightness, E_UI_BackplateCornerRadius Corner_Radius);
	void SetGridAlignment(class UWidget* Widget, EHorizontalAlignment Horizontal, EVerticalAlignment Vertical, class UGridSlot* K2Node_DynamicCast_AsGrid_Slot, bool K2Node_DynamicCast_bSuccess);
	void SetGridColumnAndRow(class UWidget* Widget, int32 Row, int32 Row_Span, int32 Column, int32 Column_Span, class UGridSlot* K2Node_DynamicCast_AsGrid_Slot, bool K2Node_DynamicCast_bSuccess);
	void SetGridLayer(class UWidget* Widget, int32 Layer, class UGridSlot* K2Node_DynamicCast_AsGrid_Slot, bool K2Node_DynamicCast_bSuccess);
	void SetGridNudge(class UWidget* Widget, const struct FVector2D& Nudge, class UGridSlot* K2Node_DynamicCast_AsGrid_Slot, bool K2Node_DynamicCast_bSuccess);
	void SetGridPadding(class UWidget* Widget, const struct FMargin& Param_Padding, class UGridSlot* K2Node_DynamicCast_AsGrid_Slot, bool K2Node_DynamicCast_bSuccess);
	void SetInputActionsType(E_UI_TabsInputActionType Param_InputActions, bool Param_InputActionsWithMouseScroll);
	void SetPlacement(class UWidget* Widget, const struct FS_UI_Placement& Placement);
	void SetPromptsVisibility(bool ShowPrompts, double CallFunc_SafeDivide_ReturnValue, double CallFunc_SafeDivide_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimationReverse_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, bool Temp_bool_Variable, const struct FVector2D& K2Node_Select_Default, bool CallFunc_NotEqual_BoolBool_ReturnValue, float CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast, float CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast);
	void SetupTabButton(class FName Tab_ID, class UCommonButtonBase* CreatedButtonReference, class UWBP_UIKit_Button_Selectable_C* ButtonReference, class UWBP_UIKit_ButtonGeneric_Base_C* K2Node_DynamicCast_AsWBP_UIKit_Button_Generic_Base, bool K2Node_DynamicCast_bSuccess, class UUIKitTabGroupButtonViewModel* CallFunc_GetTabViewModelByID_ReturnValue);
	void Trigger_End();
	void Trigger_Start();
	void UpdateInputActions(bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, const struct FDataTableRowHandle& K2Node_Select_Default, const struct FDataTableRowHandle& K2Node_Select_Default_1, const struct FDataTableRowHandle& K2Node_Select_Default_2, const struct FDataTableRowHandle& K2Node_Select_Default_3, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle, bool K2Node_SwitchEnum_CmpSuccess);
	void UpdatePromptsVisibility(uint8 CallFunc_MakeLiteralByte_ReturnValue, uint8 CallFunc_MakeLiteralByte_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, const struct FSlateBrush& CallFunc_GetIcon_ReturnValue, const struct FSlateBrush& CallFunc_GetIcon_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1);
	void UpdateTabLayout(const struct FMargin& K2Node_MakeStruct_Margin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Tabs_Base_C">();
	}
	static class UWBP_UIKit_Tabs_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Tabs_Base_C>();
	}
};

}

