#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Sparks_Dbg_Cosmetic_Group

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Sparks_Dbg_Cosmetic_Group.WBP_Sparks_Dbg_Cosmetic_Group_C
// 0x0088 (0x0350 - 0x02C8)
class UWBP_Sparks_Dbg_Cosmetic_Group_C final  : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCheckBox*                              Chk_Collapse;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Txt_Title;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Vb_Items;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Title;                                             // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESparksAccountItemSubtype                     Item_Type;                                         // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D392[0x6];                                     // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Sparks_Dbg_CosmeticPicker_C*       ParentPicker;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<ESparksInstrumentType, class UWBP_Sparks_Dbg_CosmeticItem_C*> Items;                                             // 0x0300(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BndEvt__WBP_Sparks_Dbg_Cosmetic_Group_chk_Collapse_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void ExecuteUbergraph_WBP_Sparks_Dbg_Cosmetic_Group(int32 EntryPoint, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool K2Node_ComponentBoundEvent_bIsChecked, ESlateVisibility K2Node_Select_Default);
	void OnChoiceChanged(ESparksInstrumentType Instrument, class UWBP_Sparks_Dbg_CosmeticItem_C* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	void RefreshAll(int32 Temp_int_Variable, int32 Temp_int_Variable_1, uint8 CallFunc_Conv_IntToByte_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, uint8 CallFunc_GetValidValue_ReturnValue, uint8 CallFunc_Conv_IntToByte_ReturnValue_1, uint8 CallFunc_GetEnumeratorValueFromIndex_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, int32 CallFunc_Conv_ByteToInt_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, class UWBP_Sparks_Dbg_CosmeticItem_C* CallFunc_Create_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue, int32 CallFunc_MakeLiteralInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void SetGroupSubtype(ESparksAccountItemSubtype ItemType, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void SetItemInfo(class USparksAccountItemDefinition* NewItem, bool CallFunc_IsValid_ReturnValue, ESparksInstrumentType CallFunc_GetInstrumentType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UWBP_Sparks_Dbg_CosmeticItem_C* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Sparks_Dbg_Cosmetic_Group_C">();
	}
	static class UWBP_Sparks_Dbg_Cosmetic_Group_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Sparks_Dbg_Cosmetic_Group_C>();
	}
};

}

