#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buildset_Ingredients_Dialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Buildset_Ingredients_Dialog.WBP_Buildset_Ingredients_Dialog_C
// 0x0070 (0x0478 - 0x0408)
class UWBP_Buildset_Ingredients_Dialog_C final  : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UJunoShopBuildSetItemDetailsVM*         JunoShopBuildSetItemDetailsVM;                     // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Scroll;                                            // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCloseButton_C*                         Button_CloseTouch;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Dialog_Base_C*               Dialog_Base;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortDynamicEntryBox*                   FortDynamicEntryBox_Ingredients;                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Ingredients;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUIKitDialogButtonViewModel*>    TouchDialogButtons;                                // 0x0440(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<class UUIKitDialogButtonViewModel*>    PC_ConsoleDialogButtons;                           // 0x0450(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        ScrollOffsetStep;                                  // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScrollTarget;                                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimatedScrollValue;                               // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Buildset_Ingredients_Dialog_Button_CloseTouch_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	class UWidget* CustomScroll(EUINavigation Direction, class UWidget* CallFunc_GetDesiredFocusTarget_ReturnValue);
	void ExecuteUbergraph_WBP_Buildset_Ingredients_Dialog(int32 EntryPoint, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate, int32 K2Node_CustomEvent_ButtonIndex, ECommonInputType K2Node_CustomEvent_bNewInputType, TArray<class UUIKitDialogButtonViewModel*>& CallFunc_GetDialogButtonsBasedOnInput_Dialog_Buttons, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, bool K2Node_Event_IsDesignTime, TDelegate<void(int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, class UDialogVM_BuildsetIngredients_C* CallFunc_SpawnObject_ReturnValue, class UDialogVM_BuildsetIngredients_C* CallFunc_SpawnObject_ReturnValue_1);
	void GetDialogButtonsBasedOnInput(ECommonInputType NewInputMethod, TArray<class UUIKitDialogButtonViewModel*>* Dialog_Buttons, bool Temp_bool_Variable, bool CallFunc_EqualEqual_ByteByte_ReturnValue, TArray<class UUIKitDialogButtonViewModel*>& K2Node_Select_Default);
	void HandleInputTypeChange(ECommonInputType bNewInputType);
	void HandleScroll(EUINavigation Direction, double Temp_real_Variable, double Temp_real_Variable_1, double Temp_real_Variable_2, double Temp_real_Variable_3, double Temp_real_Variable_4, double Temp_real_Variable_5, double Temp_real_Variable_6, float CallFunc_GetScrollOffsetOfEnd_ReturnValue, float CallFunc_GetScrollOffset_ReturnValue, EUINavigation Temp_byte_Variable, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, double K2Node_Select_Default, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_FClamp_ReturnValue, double CallFunc_FClamp_Max_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast);
	void OnButtonClicked(int32 ButtonIndex);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void Set_Custom_Scroll(TDelegate<void(EUINavigation Navigation)> K2Node_CreateDelegate_OutputDelegate, class UWBP_UIKit_ButtonCTA_Base_C* CallFunc_Array_Get_Item);
	void SetAnimatedScrollValue(double LerpValue, float CallFunc_GetScrollOffset_ReturnValue, double CallFunc_Lerp_ReturnValue, double CallFunc_Lerp_A_ImplicitCast, float CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast);
	void SetIngredientsList(TArray<struct FJunoShopBuildResourceRequirement>& Array, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, const struct FJunoShopBuildResourceRequirement& CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UUserWidget* CallFunc_BP_CreateEntry_ReturnValue, class UWBP_BuildsetDialog_Entry_C* K2Node_DynamicCast_AsWBP_Buildset_Dialog_Entry, bool K2Node_DynamicCast_bSuccess);
	void SetJunoShopBuildSetItemDetailsVM(class UJunoShopBuildSetItemDetailsVM* ViewModel, class UMVVMView* CallFunc_GetExtension_ReturnValue, TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput, bool CallFunc_SetViewModel_ReturnValue);

	class UWidget* BP_GetDesiredFocusTarget(class UWBP_UIKit_ButtonCTA_Base_C* CallFunc_Array_Get_Item) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Buildset_Ingredients_Dialog_C">();
	}
	static class UWBP_Buildset_Ingredients_Dialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Buildset_Ingredients_Dialog_C>();
	}
};

}

