#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Button_TopNavBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_ButtonGeneric_Base_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Button_TopNavBar.WBP_UIKit_Button_TopNavBar_C
// 0x0050 (0x1880 - 0x1830)
class UWBP_UIKit_Button_TopNavBar_C final  : public UWBP_UIKit_ButtonGeneric_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Button_TopNavBar_C;       // 0x1830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortTabViewModel*                      FortTabViewModel;                                  // 0x1838(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstance*                      TextMaterial;                                      // 0x1840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      TextOutlineMaterial;                               // 0x1848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MobileTextMaterial;                                // 0x1850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MobileTextOutlineMaterial;                         // 0x1858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMobile;                                          // 0x1860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C0[0x7];                                     // 0x1861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             IconVBuck;                                         // 0x1868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Text_C*                Block_Text_Secondary;                              // 0x1870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void BP_OnWidgetStyled();
	void Construct();
	void ExecuteUbergraph_WBP_UIKit_Button_TopNavBar(int32 EntryPoint, class UWBP_UIKit_Block_BackgroundTopNavBar_C* K2Node_DynamicCast_AsWBP_UIKit_Block_Background_Top_Nav_Bar, bool K2Node_DynamicCast_bSuccess, const struct FUIKitBlockTiming& K2Node_MakeStruct_UIKitBlockTiming, class UWBP_UIKit_Block_BackgroundTopNavBar_C* K2Node_DynamicCast_AsWBP_UIKit_Block_Background_Top_Nav_Bar_1, bool K2Node_DynamicCast_bSuccess_1, bool K2Node_Event_IsDesignTime, bool CallFunc_IsMobileGame_ReturnValue, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void PreConstruct(bool IsDesignTime);
	void SetBangType(EFortBangType EBangType, bool CallFunc_IsValid_ReturnValue);
	void SetData(class UUIKitSelectableButtonViewModel* VM_Button, class UFortTabViewModel* K2Node_DynamicCast_AsFort_Tab_Viewmodel, bool K2Node_DynamicCast_bSuccess);
	void SetFontStyle(bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool CallFunc_IsMobileGame_ReturnValue, class UObject* K2Node_Select_Default, const struct FFontOutlineSettings& K2Node_MakeStruct_FontOutlineSettings, class UObject* K2Node_Select_Default_1, const struct FSlateFontInfo& K2Node_MakeStruct_SlateFontInfo);
	void SetFortTabViewModel(class UFortTabViewModel* ViewModel, class UMVVMView* CallFunc_GetExtension_ReturnValue, TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput, bool CallFunc_SetViewModel_ReturnValue);
	void SetIcon(class UObject* Param_Icon, EFortUIFeature UIFeature, bool CallFunc_IsMobileGame_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, EFortUIFeature CallFunc_GetLinkedUIFeature_ReturnValue, const struct FMargin& K2Node_MakeStruct_Margin, bool CallFunc_IsValid_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_1);
	void SetText(class FText Param_Text, EFortUIFeature UIFeature, bool CallFunc_IsMobileGame_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class FText CallFunc_SelectText_ReturnValue, EFortUIFeature CallFunc_GetLinkedUIFeature_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue, class FText CallFunc_GetTabDisplayName_ReturnValue);
	void SetTextLayout(const struct FMargin& K2Node_MakeStruct_Margin, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FMargin& K2Node_MakeStruct_Margin_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, const struct FMargin& K2Node_MakeStruct_Margin_2, bool CallFunc_IsMobileGame_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Button_TopNavBar_C">();
	}
	static class UWBP_UIKit_Button_TopNavBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Button_TopNavBar_C>();
	}
};

}

