#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Block_InputField_Background

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_BlockBackground_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Block_InputField_Background.WBP_UIKit_Block_InputField_Background_C
// 0x0030 (0x0358 - 0x0328)
class UWBP_UIKit_Block_InputField_Background_C final  : public UWBP_UIKit_BlockBackground_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Block_InputField_Background_C; // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Disabled_Transition;                          // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pressed_Transition;                           // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Focused_Transition;                           // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          SelectionIsAvailable;                              // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_Block_InputField_Background(int32 EntryPoint, bool CallFunc_GetIsSelected_IsSelected, bool CallFunc_GetIsSelectable_IsSelectable, bool CallFunc_GetIsSelectable_IsSelectable_1, bool CallFunc_GetIsSelectable_IsSelectable_2, bool CallFunc_GetIsSelectable_IsSelectable_3, bool K2Node_Event_IsDesignTime);
	void OnInstantTransitionToDisabled();
	void OnInstantTransitionToEnabled();
	void OnTransitionDeselectedFocusedRequested();
	void OnTransitionDeselectedIdleRequested();
	void OnTransitionDisabledRequested();
	void OnTransitionEnabledRequested();
	void OnTransitionFocusedRequested();
	void OnTransitionPressedRequested();
	void OnTransitionReleasedRequested();
	void OnTransitionSelectedRequested();
	void OnTransitionUnfocusedRequested();
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundBrush(struct FSlateBrush& InBrush, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue);
	void SetBackgroundMaterial(class UMaterialInstance*& Material_Instance, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue);
	void SetCornerRadius(bool Radius_in_Pixels, double TopLeft, double TopRight, double BottomRight, double BottomLeft, const struct FLinearColor& K2Node_MakeStruct_LinearColor, double CallFunc_Conv_BoolToDouble_ReturnValue, float K2Node_MakeStruct_R_ImplicitCast, float K2Node_MakeStruct_B_ImplicitCast, float K2Node_MakeStruct_A_ImplicitCast, float K2Node_MakeStruct_G_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Block_InputField_Background_C">();
	}
	static class UWBP_UIKit_Block_InputField_Background_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Block_InputField_Background_C>();
	}
};

}

