#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CosmeticGate_PurchaseInfo

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CosmeticGate_PurchaseInfo.WBP_CosmeticGate_PurchaseInfo_C
// 0x0030 (0x02F8 - 0x02C8)
class UWBP_CosmeticGate_PurchaseInfo_C final  : public UUserWidget
{
public:
	class UWBP_CosmeticGate_IslandPreview_C*      IslandPreiview_E;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CosmeticGate_IslandPreview_C*      IslandPreiview_E10;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CosmeticGate_IslandPreview_C*      IslandPreiview_T;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Body1;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Body2;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PurchaseConfirmation;                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetIslandAgeRestrictionIcons(int32 Temp_int_Array_Index_Variable, bool Temp_bool_Variable, TArray<class UWBP_CosmeticGate_IslandPreview_C*>& K2Node_MakeArray_Array, int32 Temp_int_Loop_Counter_Variable, TArray<class UWBP_CosmeticGate_IslandPreview_C*>& K2Node_MakeArray_Array_1, int32 CallFunc_Add_IntInt_ReturnValue, class ULocalPlayer* CallFunc_GetOwningLocalPlayer_ReturnValue, TArray<class UTexture2DDynamic*>& CallFunc_GetAgeRatingIconsForExperiences_AgeRatingIconsForExperiences, class UTexture2DDynamic* CallFunc_Array_Get_Item, bool CallFunc_Array_IsValidIndex_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, TArray<class UWBP_CosmeticGate_IslandPreview_C*>& K2Node_Select_Default, int32 CallFunc_Array_Length_ReturnValue_1, class UWBP_CosmeticGate_IslandPreview_C* CallFunc_Array_Get_Item_1, bool CallFunc_Less_IntInt_ReturnValue);
	void SetIslandApprovalStatus(TArray<TScriptInterface<class ICosmeticItemGatingInterface>>& Cosmetic_Item_Interfaces, class ULocalPlayer* CallFunc_GetOwningLocalPlayer_ReturnValue, const struct FGameplayTagContainer& CallFunc_GetMinRatingGameplayTagsForCosmetics_OutMinGameplayTag, bool CallFunc_HasTag_ReturnValue, bool CallFunc_HasTag_ReturnValue_1, bool CallFunc_HasTag_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue);
	void SetOfferInfo(class UFortStoreFrontOfferInfo* OfferInfo, bool OfferContainsJamTrack, bool Temp_bool_Variable, TArray<class UFortItem*>& CallFunc_GetGrantedItems_Items, class FText Temp_text_Variable, int32 CallFunc_Array_Length_ReturnValue, class FText Temp_text_Variable_1, int32 Temp_int_Array_Index_Variable, class UFortItem* CallFunc_Array_Get_Item, class UFortItemDefinition* CallFunc_GetItemDefinitionBP_ReturnValue, EFortItemType CallFunc_GetItemType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class FText K2Node_Select_Default, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility K2Node_Select_Default_1, class ULocalPlayer* CallFunc_GetOwningLocalPlayer_ReturnValue, int32 Temp_int_Loop_Counter_Variable, TArray<struct FFortItemQuantityPair>& CallFunc_GetGrantedItemQuantityPairs_ItemQuantityPairs, bool CallFunc_Less_IntInt_ReturnValue, TArray<TScriptInterface<class ICosmeticItemGatingInterface>>& CallFunc_ConvertItemQuantityPairsToCosmeticGatingInterfaces_OutCosmeticItemGatingInterfaces, int32 CallFunc_Add_IntInt_ReturnValue, class ULocalPlayer* CallFunc_GetOwningLocalPlayer_ReturnValue_1, bool CallFunc_IsRatingSettingBelowRatingCap_ReturnValue, bool CallFunc_IsPlayerRatingRestricted_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class FText CallFunc_GetPurchaseConfirmationRatingRestrictedWarningText_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CosmeticGate_PurchaseInfo_C">();
	}
	static class UWBP_CosmeticGate_PurchaseInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CosmeticGate_PurchaseInfo_C>();
	}
};

}

