#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_StatusIndicator_Base

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "E_UI_StatusIndicator_Size_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "E_UI_StatusIndicator_Configuration_structs.hpp"
#include "E_UI_StatusIndicator_Type_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_StatusIndicator_Base.WBP_UIKit_StatusIndicator_Base_C
// 0x00F0 (0x03F8 - 0x0308)
class UWBP_UIKit_StatusIndicator_Base_C : public UFortBangWrapper_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Intro;                                        // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundWithOutline;                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Root;                                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_StatusIndicator_Configuration            Configuration;                                     // 0x032C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_StatusIndicator_Type                     Type;                                              // 0x032D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideStatusIndicatorVisibility;                 // 0x032E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_StatusIndicator_Size                     IconSize;                                          // 0x032F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Icon;                                              // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideStatusIndicatorState;                      // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF1A[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Indicator_Text;                                    // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Indicator_Icon;                                    // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BackgroundDynamicMaterial;                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     BackgroundMaterial;                                // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x0360(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         SizeDot;                                           // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF1B[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SizeNumber;                                        // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SizeIconCompact;                                   // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SizeIconDefault;                                   // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MobileIconSizeMultiplierCompact;                   // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MobileIconSizeMultipierDefault;                    // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MobileIconSizeMultiplierDot;                       // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Mobile_Font_Size_MultiplierNumeric;                // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_StatusIndicator_Base(int32 EntryPoint, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, E_UI_StatusIndicator_Configuration Temp_byte_Variable_2, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, class FName K2Node_Event_TutorialObjectiveName, ETutorialType K2Node_Event_TutorialType, bool K2Node_Event_IsDesignTime, bool K2Node_Event_bEnabled, int32 K2Node_Event_Count, ESlateVisibility K2Node_Select_Default, bool K2Node_Select_Default_1, int32 K2Node_CustomEvent_Count);
	void Fotmat_Text(E_UI_StatusIndicator_Type Temp_byte_Variable, const struct FLinearColor& Temp_struct_Variable, const struct FLinearColor& Temp_struct_Variable_1, const struct FLinearColor& Temp_struct_Variable_2, bool Temp_bool_Variable, class FText Temp_text_Variable, bool CallFunc_IsMobileGame_ReturnValue, double CallFunc_Select_Float_with_Boolean_Output, const struct FLinearColor& K2Node_Select_Default, const struct FSlateColor& K2Node_MakeStruct_SlateColor, bool CallFunc_Greater_IntInt_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, class FText K2Node_Select_Default_1, double CallFunc_Select_Float_with_Boolean_True_ImplicitCast, double CallFunc_Select_Float_with_Boolean_False_ImplicitCast, float K2Node_SetFieldsInStruct_Size_ImplicitCast);
	void InitializeStatusIndicator(class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue);
	void OnBangStateChanged(bool bEnabled, int32 Param_Count);
	void OnStartCallout(class FName TutorialObjectiveName, ETutorialType TutorialType);
	void OnStopCallout();
	void OverrideCount(int32 Param_Count);
	void PassBangTypeFromBP(EFortBangType EBangType);
	void PreConstruct(bool IsDesignTime);
	void Select_Float_with_Boolean(double FLASE, double TURR, bool Boolean, double* Output, bool Temp_bool_Variable, double CallFunc_Multiply_DoubleDouble_ReturnValue, float K2Node_Select_Default, float K2Node_Select_Option_0_ImplicitCast, double K2Node_FunctionResult_Output_ImplicitCast, float K2Node_Select_Option_1_ImplicitCast);
	void SetIcon(class UObject* IconAsset, E_UI_StatusIndicator_Size Temp_byte_Variable, E_UI_StatusIndicator_Type Temp_byte_Variable_1, const struct FLinearColor& Temp_struct_Variable, const struct FLinearColor& Temp_struct_Variable_1, const struct FLinearColor& Temp_struct_Variable_2, bool CallFunc_IsValid_ReturnValue, E_UI_StatusIndicator_Size Temp_byte_Variable_2, float Temp_real_Variable, float Temp_real_Variable_1, bool CallFunc_IsMobileGame_ReturnValue, double CallFunc_Select_Float_with_Boolean_Output, double CallFunc_Select_Float_with_Boolean_Output_1, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue_1, float K2Node_Select_Default, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FLinearColor& K2Node_Select_Default_1, float K2Node_Select_Default_2, const struct FMargin& K2Node_MakeStruct_Margin, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, float K2Node_Select_NewEnumerator3_ImplicitCast, float K2Node_Select_NewEnumerator2_ImplicitCast, double CallFunc_MakeVector2D_X_ImplicitCast, double CallFunc_MakeVector2D_Y_ImplicitCast, const struct FDeprecateSlateVector2D& K2Node_MakeStruct_ImageSize_ImplicitCast);
	void SetIndicatorConfiguration(int32 InCount, E_UI_StatusIndicator_Configuration IndicatorConfig, class UGridSlot* L_ContentSlot, class UObject* L_DynamicObject, float Temp_real_Variable, float Temp_real_Variable_1, class UImage* CallFunc_SpawnObject_ReturnValue, class UCommonTextBlock* CallFunc_SpawnObject_ReturnValue_1, float Temp_real_Variable_2, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue_1, E_UI_StatusIndicator_Configuration Temp_byte_Variable, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_Greater_IntInt_ReturnValue, float K2Node_Select_Default);
	void SetIndicatorType(E_UI_StatusIndicator_Type IndicatorType, const struct FLinearColor& Temp_struct_Variable, const struct FLinearColor& Temp_struct_Variable_1, const struct FLinearColor& Temp_struct_Variable_2, E_UI_StatusIndicator_Type Temp_byte_Variable, bool CallFunc_IsValid_ReturnValue, const struct FLinearColor& Temp_struct_Variable_3, const struct FLinearColor& Temp_struct_Variable_4, const struct FLinearColor& Temp_struct_Variable_5, E_UI_StatusIndicator_Type Temp_byte_Variable_1, bool CallFunc_IsValid_ReturnValue_1, const struct FLinearColor& K2Node_Select_Default, const struct FLinearColor& K2Node_Select_Default_1, const struct FSlateColor& K2Node_MakeStruct_SlateColor, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_Greater_IntInt_ReturnValue);
	void TriggerIntro(class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void TriggerReset(class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void UpdateSize(E_UI_StatusIndicator_Size Param_IconSize, bool L_IsMobile, const struct FVector2D& L_DesiretSize, E_UI_StatusIndicator_Size Temp_byte_Variable, E_UI_StatusIndicator_Size Temp_byte_Variable_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, double CallFunc_Select_Float_with_Boolean_Output, double CallFunc_Select_Float_with_Boolean_Output_1, double CallFunc_Select_Float_with_Boolean_Output_2, bool CallFunc_IsMobileGame_ReturnValue, double CallFunc_Select_Float_with_Boolean_Output_3, double CallFunc_Select_Float_with_Boolean_Output_4, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Select_Float_with_Boolean_Output_5, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, bool Temp_bool_Variable, double CallFunc_Select_Float_with_Boolean_Output_6, double K2Node_Select_Default, double CallFunc_Subtract_DoubleDouble_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_3, double CallFunc_Select_Float_with_Boolean_Output_7, double CallFunc_Subtract_DoubleDouble_ReturnValue_1, double CallFunc_Select_Float_with_Boolean_Output_8, double CallFunc_Select_Float_with_Boolean_Output_9, float K2Node_Select_Default_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_4, float K2Node_Select_Default_2, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_5, double CallFunc_Select_Float_with_Boolean_True_ImplicitCast, double CallFunc_Select_Float_with_Boolean_True_ImplicitCast_1, double CallFunc_Select_Float_with_Boolean_True_ImplicitCast_2, double CallFunc_Select_Float_with_Boolean_True_ImplicitCast_3, double CallFunc_Select_Float_with_Boolean_True_ImplicitCast_4, double CallFunc_Select_Float_with_Boolean_True_ImplicitCast_5, double K2Node_Select_Option_0_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, float K2Node_Select_NewEnumerator3_ImplicitCast, float K2Node_Select_NewEnumerator2_ImplicitCast, float K2Node_Select_NewEnumerator3_ImplicitCast_1, float K2Node_Select_NewEnumerator2_ImplicitCast_1, double CallFunc_MakeVector2D_X_ImplicitCast, double CallFunc_MakeVector2D_Y_ImplicitCast, double CallFunc_MakeVector2D_X_ImplicitCast_1, double CallFunc_MakeVector2D_Y_ImplicitCast_1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_StatusIndicator_Base_C">();
	}
	static class UWBP_UIKit_StatusIndicator_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_StatusIndicator_Base_C>();
	}
};

}

