#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Block_BackgroundTabSideNav

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_BlockBackground_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Block_BackgroundTabSideNav.WBP_UIKit_Block_BackgroundTabSideNav_C
// 0x0040 (0x0368 - 0x0328)
class UWBP_UIKit_Block_BackgroundTabSideNav_C final  : public UWBP_UIKit_BlockBackground_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Block_BackgroundTabSideNav_C; // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Selected_Transition;                          // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OutlineUnhover;                               // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_OutlineHover;                                 // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusOutline;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          RadiusInPixels;                                    // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC3E[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CornerRadius;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_UIKit_Block_BackgroundTabSideNav(int32 EntryPoint, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue, bool CallFunc_IsAnimationPlaying_ReturnValue, bool CallFunc_IsAnimationPlaying_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue_1, bool CallFunc_IsAnyAnimationPlaying_ReturnValue, bool CallFunc_GetIsSelected_IsSelected, bool K2Node_Event_IsDesignTime, bool CallFunc_IsAnimationPlaying_ReturnValue_2, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue_2, class UUMGSequencePlayer* CallFunc_PlayAnimationForward_ReturnValue_3, bool CallFunc_IsAnimationPlaying_ReturnValue_3, float CallFunc_SetCornerRadiuses_CornerRadius_ImplicitCast);
	void OnInitialized();
	void OnInstantTransitionToSelected();
	void OnTransitionDeselectedFocusedRequested();
	void OnTransitionDeselectedIdleRequested();
	void OnTransitionFocusedRequested();
	void OnTransitionSelectedRequested();
	void OnTransitionUnfocusedRequested();
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundMaterial(class UMaterialInstance*& Material_Instance, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue);
	void SetCornerRadiuses(float Param_CornerRadius, bool Param_RadiusInPixels, double CallFunc_Conv_BoolToDouble_ReturnValue, const struct FLinearColor& K2Node_MakeStruct_LinearColor, double K2Node_VariableSet_CornerRadius_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast_1);
	void SetOutlineMaterial(class UMaterialInstance*& Material_Instance, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Block_BackgroundTabSideNav_C">();
	}
	static class UWBP_UIKit_Block_BackgroundTabSideNav_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Block_BackgroundTabSideNav_C>();
	}
};

}

