#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Button_Tab_Enhanced

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_Button_Selectable_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_UI_StatusIndicator_Configuration_structs.hpp"
#include "E_UI_StatusIndicator_Type_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Button_Tab_Enhanced.WBP_UIKit_Button_Tab_Enhanced_C
// 0x0060 (0x18A0 - 0x1840)
class UWBP_UIKit_Button_Tab_Enhanced_C final  : public UWBP_UIKit_Button_Selectable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Button_Tab_Enhanced_C;    // 0x1840(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftClassPtr<class UClass>                   StatusIndicatorClass_0;                            // 0x1848(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          EnableCustomLayout;                                // 0x1868(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81B1[0x3];                                     // 0x1869(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                BangPadding;                                       // 0x186C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerticalAlignment                            BangVerticalAlignment;                             // 0x187C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          BangHorizontalAlignment;                           // 0x187D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81B2[0x2];                                     // 0x187E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              BangNudge;                                         // 0x1880(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_StatusIndicator_Configuration            Configuration_0;                                   // 0x1890(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_StatusIndicator_Type                     Type_0;                                            // 0x1891(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBangType                                 BangType;                                          // 0x1892(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81B3[0x1];                                     // 0x1893(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TutorialName;                                      // 0x1894(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_UIKit_Button_Tab_Enhanced(int32 EntryPoint, bool K2Node_Event_IsDesignTime);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Button_Tab_Enhanced_C">();
	}
	static class UWBP_UIKit_Button_Tab_Enhanced_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Button_Tab_Enhanced_C>();
	}
};

}

