#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Divider_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Divider_Base.WBP_UIKit_Divider_Base_C
// 0x0038 (0x0300 - 0x02C8)
class UWBP_UIKit_Divider_Base_C final  : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DividerBar;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Div_Color_and_Opacity;                             // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Div_Width;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Div_Padding;                                       // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UIKit_Divider_Base(int32 EntryPoint, bool K2Node_Event_IsDesignTime, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, const struct FDeprecateSlateVector2D& K2Node_MakeStruct_ImageSize_ImplicitCast);
	void PreConstruct(bool IsDesignTime);
	void SetDividerOrientation(bool IsVertical, bool Temp_bool_Variable, EHorizontalAlignment Temp_byte_Variable, EHorizontalAlignment Temp_byte_Variable_1, class UGridSlot* CallFunc_SlotAsGridSlot_ReturnValue, EHorizontalAlignment K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue, EVerticalAlignment Temp_byte_Variable_2, EVerticalAlignment Temp_byte_Variable_3, bool Temp_bool_Variable_1, EVerticalAlignment K2Node_Select_Default_1);
	void SetDividerPadding(const struct FMargin& Param_Padding, class UGridSlot* CallFunc_SlotAsGridSlot_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void SetDividerSpacing(double Spacing, bool IsVertical, bool Temp_bool_Variable, const struct FMargin& K2Node_MakeStruct_Margin, const struct FMargin& K2Node_MakeStruct_Margin_1, const struct FMargin& K2Node_Select_Default, class UGridSlot* CallFunc_SlotAsGridSlot_ReturnValue, bool CallFunc_IsValid_ReturnValue, float K2Node_MakeStruct_Left_ImplicitCast, float K2Node_MakeStruct_Right_ImplicitCast, float K2Node_MakeStruct_Top_ImplicitCast, float K2Node_MakeStruct_Bottom_ImplicitCast);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Divider_Base_C">();
	}
	static class UWBP_UIKit_Divider_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Divider_Base_C>();
	}
};

}

