#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Throbber_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_UI_ThrobberSize_structs.hpp"
#include "E_UI_ThrobberType_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Throbber_Base.WBP_UIKit_Throbber_Base_C
// 0x0040 (0x0308 - 0x02C8)
class UWBP_UIKit_Throbber_Base_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Throbber;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_UI_ThrobberSize                             ThrobberSize;                                      // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D263[0x3];                                     // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SizeSmall;                                         // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SizeMedium;                                        // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SizeLarge;                                         // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_ThrobberType                             ThrobberStyle;                                     // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D264[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      MonochromaticInstance;                             // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CurrentMaterialInstance;                           // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DisplayBackground;                                 // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_Throbber_Base(int32 EntryPoint, bool K2Node_Event_IsDesignTime);
	void InitializeStyle(E_UI_ThrobberType StyleType, E_UI_ThrobberType Temp_byte_Variable, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, class UMaterialInterface* K2Node_Select_Default);
	void InitializeThrobber();
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundVisibility(bool ShowBackground, bool Temp_bool_Variable, float Temp_real_Variable, float Temp_real_Variable_1, float K2Node_Select_Default);
	void SetThrobberSize(E_UI_ThrobberSize Size, E_UI_ThrobberSize Temp_byte_Variable, float Temp_real_Variable, float Temp_real_Variable_1, float Temp_real_Variable_2, E_UI_ThrobberSize Temp_byte_Variable_1, float Temp_real_Variable_3, float Temp_real_Variable_4, float Temp_real_Variable_5, E_UI_ThrobberSize Temp_byte_Variable_2, float K2Node_Select_Default, float K2Node_Select_Default_1, double CallFunc_Conv_IntToDouble_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_1, double CallFunc_Conv_IntToDouble_ReturnValue_2, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_2, const struct FDeprecateSlateVector2D& K2Node_Select_Default_2, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, const struct FDeprecateSlateVector2D& K2Node_Select_NewEnumerator2_ImplicitCast, const struct FDeprecateSlateVector2D& K2Node_Select_NewEnumerator1_ImplicitCast, const struct FDeprecateSlateVector2D& K2Node_Select_NewEnumerator0_ImplicitCast);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Throbber_Base_C">();
	}
	static class UWBP_UIKit_Throbber_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Throbber_Base_C>();
	}
};

}

