#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponModStationUI

#include "Basic.hpp"

#include "BlueprintContext_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchContext
// 0x00B8 (0x00E8 - 0x0030)
class UAthenaWeaponModsWorkbenchContext final  : public UBlueprintContextBase
{
public:
	uint8                                         Pad_9984[0x20];                                    // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnWeaponModsWorkbenchRequestClose;                 // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_9985[0x18];                                    // 0x0060(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnWeaponModsWorkbenchSelectedModChanged;           // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_9986[0x60];                                    // 0x0088(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnWeaponModsWorkbenchRequestClose__DelegateSignature();
	void OnWeaponModsWorkbenchSelectedModChanged__DelegateSignature(class UFortWeaponModItemDefinition* CurrentlySelectedMod);
	void RequestCloseUI();

	struct FGameplayTag GetCurrentModCategory() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchContext">();
	}
	static class UAthenaWeaponModsWorkbenchContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchContext>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchWidgetBase
// 0x0000 (0x02F0 - 0x02F0)
class UAthenaWeaponModsWorkbenchWidgetBase : public UCommonUserWidget
{
public:
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnWeaponModCategoryChanged(const struct FGameplayTag& ModTypeTag);
	void OnWorkbenchClosed();
	void OnWorkbenchOpened();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchWidgetBase">();
	}
	static class UAthenaWeaponModsWorkbenchWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchWidgetBase>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchEquippedModDetails
// 0x0000 (0x02F0 - 0x02F0)
class UAthenaWeaponModsWorkbenchEquippedModDetails final  : public UAthenaWeaponModsWorkbenchWidgetBase
{
public:
	void HandleCurrentlySelectedModChanged(class UFortWeaponModItemDefinition* NewSelectedMod);
	void HandleSetEquippedModInfo(class UFortWeaponModItemDefinition* WeaponMod);
	void OnRemoveModClicked();
	void OnSetCurrentlySelectedModInfo(class UFortWeaponModItemDefinition* ModItemDefinition, bool bIsSameCategory, bool bIsEquippedMod);
	void OnSetEquippedModInfo(class UFortWeaponModItemDefinition* ModItemDefinition, bool bIsDefaultMod, bool bSlotHasDefaultMod, bool bCanRemoveMod);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchEquippedModDetails">();
	}
	static class UAthenaWeaponModsWorkbenchEquippedModDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchEquippedModDetails>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchModal
// 0x0038 (0x0440 - 0x0408)
class UAthenaWeaponModsWorkbenchModal final  : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_9989[0x8];                                     // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BlockedInputActions;                               // 0x0410(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FPrimaryContentSetup                   PrimaryContentSetup;                               // 0x0420(0x0003)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_998A[0x5];                                     // 0x0423(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        WorkbenchModalInputComp;                           // 0x0428(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_998B[0x10];                                    // 0x0430(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCloseUI();
	void HandleModStationComponentForceStop(class AFortWeaponModStationBase* WeaponModStation);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnInputTypeChanged(ECommonInputType NewInputType);
	void OnWeaponEquipped(bool bIsModdable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchModal">();
	}
	static class UAthenaWeaponModsWorkbenchModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchModal>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchModListEntry
// 0x0010 (0x14B0 - 0x14A0)
class UAthenaWeaponModsWorkbenchModListEntry final  : public UCommonButtonBase
{
public:
	uint8                                         Pad_998C[0x10];                                    // 0x14A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnListItemSet(class UFortItemDefinition* Item);
	void OnRefreshStatus();

	bool IsEquippableMod() const;
	bool IsEquippedMod() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchModListEntry">();
	}
	static class UAthenaWeaponModsWorkbenchModListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchModListEntry>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchModSelection
// 0x0040 (0x0330 - 0x02F0)
class UAthenaWeaponModsWorkbenchModSelection final  : public UAthenaWeaponModsWorkbenchWidgetBase
{
public:
	class UFortWorldItemDefinition*               PurchasingCurrency;                                // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_998D[0x8];                                     // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        ListView_ModChoices;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_998E[0x8];                                     // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    PreviousListEntryInputAction;                      // 0x0310(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    NextListEntryInputAction;                          // 0x0320(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

public:
	void GetSelectedModCostAndOwnedCurrency(int32* ModCost, int32* OwnedCurrency);
	void OnBuyAndEquipClicked();
	void OnExitUIClicked();
	void OnModPurchasedSuccessfully();
	void OnModPurchaseFailed();
	void OnModRemovedCallback();
	void OnRefreshMods(TArray<class UFortWeaponModItemDefinition*>& WeaponModItemDefinitions);
	void OnRefreshModType(const struct FGameplayTag& ModCategoryTag);
	void OnRemoveModClicked();
	void OnSetSelectedModCostAndOwnedCurrency(int32 ModCost, int32 OwnedCurrency);
	void OnSetSelectedModInfo(class UFortWeaponModItemDefinition* ModItemDef);
	void OnSetSelectedRemoveModCostAndOwnedCurrency(int32 ModCost, int32 OwnedCurrency);
	void RequestBuyAndEquip();
	void RequestRemoveMod();
	void SetCanRemoveMod(bool bCanRemoveMod);

	bool CanApplySelectedModToEquippedWeapon() const;
	bool CanRemoveSelectedModFromWeapon() const;
	bool DoesEquippedWeaponHaveDefaultModForSlot() const;
	void GetSelectedRemoveModCostAndOwnedCurrency(int32* RemoveModCost, int32* OwnedCurrency) const;
	bool IsSelectedModEquippedOnWeapon() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchModSelection">();
	}
	static class UAthenaWeaponModsWorkbenchModSelection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchModSelection>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchModTypeButton
// 0x0010 (0x14B0 - 0x14A0)
class UAthenaWeaponModsWorkbenchModTypeButton final  : public UCommonButtonBase
{
public:
	struct FGameplayTag                           ModTypeTag;                                        // 0x14A0(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_998F[0x4];                                     // 0x14A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponModItemDefinition*           DefaultModItemDef;                                 // 0x14A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnWorkbenchClosed();
	void OnWorkbenchOpened();
	void SetEquippedOrDefaultMod(class UFortWeaponModItemDefinition* ItemDefinition, bool bIsAvailableCategory);

	struct FGameplayTag GetModTypeTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchModTypeButton">();
	}
	static class UAthenaWeaponModsWorkbenchModTypeButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchModTypeButton>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchModTypeTabs
// 0x0028 (0x0318 - 0x02F0)
class UAthenaWeaponModsWorkbenchModTypeTabs final  : public UAthenaWeaponModsWorkbenchWidgetBase
{
public:
	uint8                                         Pad_9991[0x8];                                     // 0x02F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    PreviousTabInputAction;                            // 0x02F8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    NextTabInputAction;                                // 0x0308(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

public:
	TArray<class UAthenaWeaponModsWorkbenchModTypeButton*> GetTabButtons();
	void OnModTypeTabClicked(const struct FGameplayTag& ModTypeTag);
	void SetItemSlotInfo(TArray<struct FFortWeaponModSlot>& ModSlots);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchModTypeTabs">();
	}
	static class UAthenaWeaponModsWorkbenchModTypeTabs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchModTypeTabs>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchWeaponDetails
// 0x0008 (0x02F8 - 0x02F0)
class UAthenaWeaponModsWorkbenchWeaponDetails final  : public UAthenaWeaponModsWorkbenchWidgetBase
{
public:
	uint8                                         Pad_9992[0x8];                                     // 0x02F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnWeaponEquipped(class UItemDefinitionBase* ItemDefinition, class FText& DisplayName);
	void SetWeaponType(class FText& WeaponTypeText, class UTexture2D* WeaponTypeTexture, bool bIsValidType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchWeaponDetails">();
	}
	static class UAthenaWeaponModsWorkbenchWeaponDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchWeaponDetails>();
	}
};

// Class WeaponModStationUI.AthenaWeaponModsWorkbenchWeaponRenderContainer
// 0x0000 (0x02F0 - 0x02F0)
class UAthenaWeaponModsWorkbenchWeaponRenderContainer final  : public UAthenaWeaponModsWorkbenchWidgetBase
{
public:
	void HandleWeaponModSlotPreview(class UFortWeaponModItemDefinition* PreviewingModItemDefinition);
	void OnWeaponModSlotPreview(class AFortWeapon* Weapon, class UFortWeaponModItemDefinition* PreviewingModItemDefinition);
	void OnWeaponModSlotsChanged(class AFortWeapon* Weapon);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaWeaponModsWorkbenchWeaponRenderContainer">();
	}
	static class UAthenaWeaponModsWorkbenchWeaponRenderContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWeaponModsWorkbenchWeaponRenderContainer>();
	}
};

}

