#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponModsUI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "UMG_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class WeaponModsUI.AthenaEquippedItemInfoWeaponMods
// 0x0000 (0x02C8 - 0x02C8)
class UAthenaEquippedItemInfoWeaponMods final  : public UUserWidget
{
public:
	void HandleWeaponFullyEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void ResetItemInfo();
	void SetItemSlotInfo(struct FFortWeaponModSlot& ModSlot);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaEquippedItemInfoWeaponMods">();
	}
	static class UAthenaEquippedItemInfoWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEquippedItemInfoWeaponMods>();
	}
};

// Class WeaponModsUI.AthenaInventoryGroupWeaponMods
// 0x0000 (0x0360 - 0x0360)
class UAthenaInventoryGroupWeaponMods final  : public UAthenaInventoryGroupBase
{
public:
	void HandleButtonClicked(class UObject* Object);

	bool CanWeaponEquipMod(class AFortWeapon* Weapon, class UFortWeaponModItemDefinition* Mod) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryGroupWeaponMods">();
	}
	static class UAthenaInventoryGroupWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryGroupWeaponMods>();
	}
};

// Class WeaponModsUI.AthenaInventoryItemInfoWeaponMods
// 0x0000 (0x02C8 - 0x02C8)
class UAthenaInventoryItemInfoWeaponMods : public UUserWidget
{
public:
	void HandleInventoryItemSelected(class UFortItem* SelectedItem);
	void HandleInventoryPanelOpened();
	void HandleWeaponModSlotsChanged(class AFortWeapon* Weapon);
	void ResetItemInfo();
	void SetIsModifiableWeapon(bool bIsModifiable);
	void SetItemSlotInfo(struct FFortWeaponModSlot& ModSlot);
	void UpdateItemMods();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryItemInfoWeaponMods">();
	}
	static class UAthenaInventoryItemInfoWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryItemInfoWeaponMods>();
	}
};

// Class WeaponModsUI.AthenaInventoryItemInfoWeaponModsConfigurator
// 0x0000 (0x02C8 - 0x02C8)
class UAthenaInventoryItemInfoWeaponModsConfigurator final  : public UAthenaInventoryItemInfoWeaponMods
{
public:
	void RemoveMod(class UFortWeaponModItemDefinition* ModItemDef);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryItemInfoWeaponModsConfigurator">();
	}
	static class UAthenaInventoryItemInfoWeaponModsConfigurator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryItemInfoWeaponModsConfigurator>();
	}
};

// Class WeaponModsUI.AthenaLastKillerWeaponModsInfo
// 0x0008 (0x0338 - 0x0330)
class UAthenaLastKillerWeaponModsInfo final  : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_9995[0x8];                                     // 0x0330(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetKillerWeaponMods(TArray<struct FFortWeaponModSlot>& ModSlots);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaLastKillerWeaponModsInfo">();
	}
	static class UAthenaLastKillerWeaponModsInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLastKillerWeaponModsInfo>();
	}
};

// Class WeaponModsUI.AthenaPickupIndicatorWeaponMods
// 0x0000 (0x02C8 - 0x02C8)
class UAthenaPickupIndicatorWeaponMods final  : public UFortInteractContextInfoWidget
{
public:
	void HandlePickupHovered(class AFortPickup* Pickup);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void ResetItemInfo();
	void SetEquippedWeaponItemInfo(class UItemDefinitionBase* ItemDef);
	void SetEquippedWeaponItemSlotInfo(struct FFortWeaponModSlot& ModSlot);
	void SetItemModifiedWeaponName(class FText& ModifiedWeaponName);
	void SetItemSlotInfo(struct FFortWeaponModSlot& ModSlot);

	bool IsInspectViewCollapsedBySettings() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaPickupIndicatorWeaponMods">();
	}
	static class UAthenaPickupIndicatorWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaPickupIndicatorWeaponMods>();
	}
};

// Class WeaponModsUI.AthenaQuickBarSlotWeaponModsIndicator
// 0x0218 (0x0510 - 0x02F8)
class UAthenaQuickBarSlotWeaponModsIndicator final  : public UAthenaQuickBarSlotExtensionWidgetBase
{
public:
	class UImage*                                 Image_ModOptic;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ModMag;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ModUnderbarrel;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ModBarrel;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ScopeIcon;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                            EmptyModSlotBrush;                                 // 0x0320(0x00C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            FilledModSlotBrush;                                // 0x03E0(0x00C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class UImage*>      ModSlotWidgets;                                    // 0x04A0(0x0050)(BlueprintVisible, ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTag                           WeaponModSlotOpticTag;                             // 0x04F0(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9996[0x1C];                                    // 0x04F4(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleQuickBarSlotFocusChanged(EFortQuickBars QuickBarType, int32 QuickBarSlot);
	void HandleWeaponFullyEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void HandleWeaponModSlotsChanged(class AFortWeapon* Weapon);
	void ResetIconOpacities();
	void ResetItemInfo();
	void SetItemSlotInfo(struct FFortWeaponModSlot& ModSlot);
	void SetItemSlotSelected(bool bIsSelected);
	void SetItemSlotsInfo(TArray<struct FFortWeaponModSlot>& ModSlots);
	void UpdateModVisuals(TArray<struct FFortWeaponModSlot>& ModSlots);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaQuickBarSlotWeaponModsIndicator">();
	}
	static class UAthenaQuickBarSlotWeaponModsIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQuickBarSlotWeaponModsIndicator>();
	}
};

// Class WeaponModsUI.FortGameSettingRegistryExtension_WeaponModsUI
// 0x0000 (0x0028 - 0x0028)
class UFortGameSettingRegistryExtension_WeaponModsUI final  : public UFortGameSettingRegistryExtension
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameSettingRegistryExtension_WeaponModsUI">();
	}
	static class UFortGameSettingRegistryExtension_WeaponModsUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameSettingRegistryExtension_WeaponModsUI>();
	}
};

// Class WeaponModsUI.FortPickupInteractOverrideComponent_ModdableWeapons
// 0x0010 (0x00D0 - 0x00C0)
class UFortPickupInteractOverrideComponent_ModdableWeapons final  : public UFortPickupInteractOverrideComponent
{
public:
	FMulticastInlineDelegateProperty_             OnAttemptSecondInteractDelegate;                   // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPickupInteractOverrideComponent_ModdableWeapons">();
	}
	static class UFortPickupInteractOverrideComponent_ModdableWeapons* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickupInteractOverrideComponent_ModdableWeapons>();
	}
};

}

