#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZoneGraphAnnotations

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "ZoneGraphAnnotations_structs.hpp"
#include "StructUtils_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ZoneGraph_structs.hpp"


namespace SDK
{

// Class ZoneGraphAnnotations.ZoneGraphAnnotationComponent
// 0x0020 (0x0570 - 0x0550)
class UZoneGraphAnnotationComponent : public UDebugDrawComponent
{
public:
	uint8                                         Pad_818A[0x18];                                    // 0x0550(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableDebugDrawing;                               // 0x0568(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_818B[0x7];                                     // 0x0569(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphAnnotationComponent">();
	}
	static class UZoneGraphAnnotationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationComponent>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphAnnotationSubsystem
// 0x0070 (0x00B0 - 0x0040)
class UZoneGraphAnnotationSubsystem final  : public UTickableWorldSubsystem
{
public:
	TArray<struct FRegisteredZoneGraphAnnotation> RegisteredComponents;                              // 0x0040(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FInstancedStructContainer              Events[0x2];                                       // 0x0050(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_818C[0x8];                                     // 0x0070(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UZoneGraphAnnotationComponent*>  TagToAnnotationLookup;                             // 0x0078(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_818D[0x28];                                    // 0x0088(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphAnnotationSubsystem">();
	}
	static class UZoneGraphAnnotationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationSubsystem>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphAnnotationTest
// 0x0008 (0x0030 - 0x0028)
class UZoneGraphAnnotationTest : public UObject
{
public:
	class UZoneGraphAnnotationTestingComponent*   OwnerComponent;                                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphAnnotationTest">();
	}
	static class UZoneGraphAnnotationTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationTest>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphAnnotationTestingComponent
// 0x0010 (0x0560 - 0x0550)
class UZoneGraphAnnotationTestingComponent final  : public UDebugDrawComponent
{
public:
	TArray<class UZoneGraphAnnotationTest*>       Tests;                                             // 0x0550(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphAnnotationTestingComponent">();
	}
	static class UZoneGraphAnnotationTestingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationTestingComponent>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphAnnotationTestingActor
// 0x0008 (0x0298 - 0x0290)
class AZoneGraphAnnotationTestingActor final  : public AActor
{
public:
	class UZoneGraphAnnotationTestingComponent*   TestingComp;                                       // 0x0290(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Trigger();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphAnnotationTestingActor">();
	}
	static class AZoneGraphAnnotationTestingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZoneGraphAnnotationTestingActor>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphDisturbanceAnnotation
// 0x0070 (0x05E0 - 0x0570)
class UZoneGraphDisturbanceAnnotation final  : public UZoneGraphAnnotationComponent
{
public:
	struct FZoneGraphTag                          DangerAnnotationTag;                               // 0x0570(0x0001)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneGraphTag                          ObstacleAnnotationTag;                             // 0x0571(0x0001)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_818E[0x2];                                     // 0x0572(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneGraphTagFilter                    AffectedLaneTags;                                  // 0x0574(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphTagFilter                    EscapeLaneTags;                                    // 0x0580(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         IdealSpanLength;                                   // 0x058C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_818F[0x40];                                    // 0x0590(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UZoneGraphSubsystem*                    ZoneGraphSubsystem;                                // 0x05D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8190[0x8];                                     // 0x05D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphDisturbanceAnnotation">();
	}
	static class UZoneGraphDisturbanceAnnotation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphDisturbanceAnnotation>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphDisturbanceAnnotationTest
// 0x0020 (0x0050 - 0x0030)
class UZoneGraphDisturbanceAnnotationTest final  : public UZoneGraphAnnotationTest
{
public:
	struct FVector                                Offset;                                            // 0x0030(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Duration;                                          // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DangerRadius;                                      // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphDisturbanceAnnotationTest">();
	}
	static class UZoneGraphDisturbanceAnnotationTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphDisturbanceAnnotationTest>();
	}
};

// Class ZoneGraphAnnotations.ZoneGraphDisturbanceAnnotationBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UZoneGraphDisturbanceAnnotationBPLibrary final  : public UBlueprintFunctionLibrary
{
public:
	static void TriggerDanger(class UObject* WorldContextObject, class AActor* Instigator, struct FVector& Position, float Radius, float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphDisturbanceAnnotationBPLibrary">();
	}
	static class UZoneGraphDisturbanceAnnotationBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphDisturbanceAnnotationBPLibrary>();
	}
};

}

