#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZoneGraphDebug

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ZoneGraph_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ZoneGraphDebug.ZoneLaneTest
// 0x0008 (0x0030 - 0x0028)
class UZoneLaneTest final  : public UObject
{
public:
	class UZoneGraphTestingComponent*             OwnerComponent;                                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneLaneTest">();
	}
	static class UZoneLaneTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneLaneTest>();
	}
};

// Class ZoneGraphDebug.ZoneGraphTestingComponent
// 0x02E0 (0x07E0 - 0x0500)
class UZoneGraphTestingComponent final  : public UPrimitiveComponent
{
public:
	uint8                                         Pad_8181[0x10];                                    // 0x0500(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UZoneGraphSubsystem*                    ZoneGraph;                                         // 0x0510(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneGraphLaneLocation                 LaneLocation;                                      // 0x0518(0x0070)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphLaneLocation                 NextLaneLocation;                                  // 0x0588(0x0070)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphLaneLocation                 NearestLaneLocation;                               // 0x05F8(0x0070)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                SearchExtent;                                      // 0x0668(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AdvanceDistance;                                   // 0x0680(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8182[0x4];                                     // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NearestTestOffset;                                 // 0x0688(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneGraphTagFilter                    QueryFilter;                                       // 0x06A0(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bDrawLinkedLanes;                                  // 0x06AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawLaneTangentVectors;                           // 0x06AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawLaneSmoothing;                                // 0x06AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawBVTreeQuery;                                  // 0x06AF(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawLanePath;                                     // 0x06B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8183[0x7];                                     // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AZoneGraphTestingActor*                 OtherActor;                                        // 0x06B8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8184[0x100];                                   // 0x06C0(0x0100)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UZoneLaneTest*>                  CustomTests;                                       // 0x07C0(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_8185[0x10];                                    // 0x07D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisableCustomTests();
	void EnableCustomTests();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphTestingComponent">();
	}
	static class UZoneGraphTestingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphTestingComponent>();
	}
};

// Class ZoneGraphDebug.ZoneGraphTestingActor
// 0x0008 (0x0298 - 0x0290)
class AZoneGraphTestingActor final  : public AActor
{
public:
	class UZoneGraphTestingComponent*             DebugComp;                                         // 0x0290(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void DisableCustomTests();
	void EnableCustomTests();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphTestingActor">();
	}
	static class AZoneGraphTestingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZoneGraphTestingActor>();
	}
};

}

